TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{44585F17-F0A3-4DEF-AFE8-887A5AB383A5} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.2.LTS *
       3                    ;* Date/Time created: Fri Nov 16 15:53:09 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/LaunchPad/CC13X0_LAUNCHXL.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("D:\code\collector_cc1310lp\collector_cc1310lp")
      13                            .bound  ".TI.bound:flashBuf", 106496, 0
      14                            .noinit ".TI.bound:flashBuf"

    3112                            .dwattr $C$DW$200, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    3113                            .dwattr $C$DW$200, DW_AT_decl_line(0x5e6)
    3114                            .dwattr $C$DW$200, DW_AT_decl_column(0x05)
    3115                    
    3116                    $C$DW$201       .dwtag  DW_TAG_enumerator
    3117                            .dwattr $C$DW$201, DW_AT_name("RF_AllowDelayAny")
    3118                            .dwattr $C$DW$201, DW_AT_const_value(-1)
    3119                            .dwattr $C$DW$201, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    3120                            .dwattr $C$DW$201, DW_AT_decl_line(0x5e7)
    3121                            .dwattr $C$DW$201, DW_AT_decl_column(0x05)
    3122                    
    3123                            .dwattr $C$DW$T$1061, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/driver
    3124                            .dwattr $C$DW$T$1061, DW_AT_decl_line(0x5e5)
    3125                            .dwattr $C$DW$T$1061, DW_AT_decl_column(0x0e)
    3126                            .dwendtag $C$DW$T$1061
    3127                    
    3128                    $C$DW$T$1062    .dwtag  DW_TAG_typedef
    3129                            .dwattr $C$DW$T$1062, DW_AT_name("RF_AllowDelay")
    3130                            .dwattr $C$DW$T$1062, DW_AT_type(*$C$DW$T$1061)
    3131                            .dwattr $C$DW$T$1062, DW_AT_language(DW_LANG_C)
    3132                            .dwattr $C$DW$T$1062, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/driver
    3133                            .dwattr $C$DW$T$1062, DW_AT_decl_line(0x5e8)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{44585F17-F0A3-4DEF-AFE8-887A5AB383A5} PAGE   58

    3134                            .dwattr $C$DW$T$1062, DW_AT_decl_column(0x03)
    3135                    
    3136                    
    3137                    $C$DW$T$1063    .dwtag  DW_TAG_enumeration_type
    3138                            .dwattr $C$DW$T$1063, DW_AT_byte_size(0x01)
    3139                    $C$DW$202       .dwtag  DW_TAG_enumerator
    3140                            .dwattr $C$DW$202, DW_AT_name("RF_RatChannelAny")
    3141                            .dwattr $C$DW$202, DW_AT_const_value(-1)
    3142                            .dwattr $C$DW$202, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    3143                            .dwattr $C$DW$202, DW_AT_decl_line(0x608)
    3144                            .dwattr $C$DW$202, DW_AT_decl_column(0x05)
    3145                    
    3146                    $C$DW$203       .dwtag  DW_TAG_enumerator
    3147                            .dwattr $C$DW$203, DW_AT_name("RF_RatChannel0")
    3148                            .dwattr $C$DW$203, DW_AT_const_value(0x00)
    3149                            .dwattr $C$DW$203, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    3150                            .dwattr $C$DW$203, DW_AT_decl_line(0x609)
    3151                            .dwattr $C$DW$203, DW_AT_decl_column(0x05)
    3152                    
    3153                    $C$DW$204       .dwtag  DW_TAG_enumerator
    3154                            .dwattr $C$DW$204, DW_AT_name("RF_RatChannel1")
    3155                            .dwattr $C$DW$204, DW_AT_const_value(0x01)
    3156                            .dwattr $C$DW$204, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    3157                            .dwattr $C$DW$204, DW_AT_decl_line(0x60a)
    3158                            .dwattr $C$DW$204, DW_AT_decl_column(0x05)
    3159                    
    3160                    $C$DW$205       .dwtag  DW_TAG_enumerator
    3161                            .dwattr $C$DW$205, DW_AT_name("RF_RatChannel2")
    3162                            .dwattr $C$DW$205, DW_AT_const_value(0x02)
    3163                            .dwattr $C$DW$205, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    3164                            .dwattr $C$DW$205, DW_AT_decl_line(0x60b)
    3165                            .dwattr $C$DW$205, DW_AT_decl_column(0x05)
    3166                    
    3167                            .dwattr $C$DW$T$1063, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/driver
    3168                            .dwattr $C$DW$T$1063, DW_AT_decl_line(0x607)
    3169                            .dwattr $C$DW$T$1063, DW_AT_decl_column(0x0e)
    3170                            .dwendtag $C$DW$T$1063
    3171                    
    3172                    $C$DW$T$1064    .dwtag  DW_TAG_typedef
    3173                            .dwattr $C$DW$T$1064, DW_AT_name("RF_RatSelectChannel")
    3174                            .dwattr $C$DW$T$1064, DW_AT_type(*$C$DW$T$1063)
    3175                            .dwattr $C$DW$T$1064, DW_AT_language(DW_LANG_C)
    3176                            .dwattr $C$DW$T$1064, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/driver
    3177                            .dwattr $C$DW$T$1064, DW_AT_decl_line(0x60c)
    3178                            .dwattr $C$DW$T$1064, DW_AT_decl_column(0x03)
    3179                    
    3180                    
    3181                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3182                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
    3183                    $C$DW$206       .dwtag  DW_TAG_member
    3184                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$22)
    3185                            .dwattr $C$DW$206, DW_AT_name("rfMode")
    3186                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("rfMode")
    3187                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3188                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{44585F17-F0A3-4DEF-AFE8-887A5AB383A5} PAGE   59

    3189                            .dwattr $C$DW$206, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    3190                            .dwattr $C$DW$206, DW_AT_decl_line(0x41e)
    3191                            .dwattr $C$DW$206, DW_AT_decl_column(0x0d)
    3192                    
    3193                    $C$DW$207       .dwtag  DW_TAG_member
    3194                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$24)
    3195                            .dwattr $C$DW$207, DW_AT_name("cpePatchFxn")
    3196                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("cpePatchFxn")
    3197                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3198                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3199                            .dwattr $C$DW$207, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    3200                            .dwattr $C$DW$207, DW_AT_decl_line(0x41f)
    3201                            .dwattr $C$DW$207, DW_AT_decl_column(0x0c)
    3202                    
    3203                    $C$DW$208       .dwtag  DW_TAG_member
    3204                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$24)
    3205                            .dwattr $C$DW$208, DW_AT_name("mcePatchFxn")
    3206                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("mcePatchFxn")
    3207                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3208                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3209                            .dwattr $C$DW$208, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    3210                            .dwattr $C$DW$208, DW_AT_decl_line(0x420)
    3211                            .dwattr $C$DW$208, DW_AT_decl_column(0x0c)
    3212                    
    3213                    $C$DW$209       .dwtag  DW_TAG_member
    3214                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$24)
    3215                            .dwattr $C$DW$209, DW_AT_name("rfePatchFxn")
    3216                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("rfePatchFxn")
    3217                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3218                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3219                            .dwattr $C$DW$209, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    3220                            .dwattr $C$DW$209, DW_AT_decl_line(0x421)
    3221                            .dwattr $C$DW$209, DW_AT_decl_column(0x0c)
    3222                    
    3223                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/
    3224                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x41d)
    3225                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    3226                            .dwendtag $C$DW$T$25
    3227                    
    3228                    $C$DW$T$49      .dwtag  DW_TAG_typedef
    3229                            .dwattr $C$DW$T$49, DW_AT_name("RF_Mode")
    3230                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$25)
    3231                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3232                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/
    3233                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x422)
    3234                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x03)
    3235                    
    3236                    $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    3237                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    3238                            .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
    3239                    
    3240                    
    3241                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3242                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    3243                    $C$DW$210       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{44585F17-F0A3-4DEF-AFE8-887A5AB383A5} PAGE   60

    3244                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$22)
    3245                            .dwattr $C$DW$210, DW_AT_name("triggerType")
    3246                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("triggerType")
    3247                            .dwattr $C$DW$210, DW_AT_bit_offset(0x04)
    3248                            .dwattr $C$DW$210, DW_AT_bit_size(0x04)
    3249                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3250                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3251                            .dwattr $C$DW$210, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3252                            .dwattr $C$DW$210, DW_AT_decl_line(0x7d)
    3253                            .dwattr $C$DW$210, DW_AT_decl_column(0x0f)
    3254                    
    3255                    $C$DW$211       .dwtag  DW_TAG_member
    3256                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$22)
    3257                            .dwattr $C$DW$211, DW_AT_name("bEnaCmd")
    3258                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("bEnaCmd")
    3259                            .dwattr $C$DW$211, DW_AT_bit_offset(0x03)
    3260                            .dwattr $C$DW$211, DW_AT_bit_size(0x01)
    3261                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3262                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3263                            .dwattr $C$DW$211, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3264                            .dwattr $C$DW$211, DW_AT_decl_line(0x7e)
    3265                            .dwattr $C$DW$211, DW_AT_decl_column(0x0f)
    3266                    
    3267                    $C$DW$212       .dwtag  DW_TAG_member
    3268                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$22)
    3269                            .dwattr $C$DW$212, DW_AT_name("triggerNo")
    3270                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("triggerNo")
    3271                            .dwattr $C$DW$212, DW_AT_bit_offset(0x01)
    3272                            .dwattr $C$DW$212, DW_AT_bit_size(0x02)
    3273                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3274                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3275                            .dwattr $C$DW$212, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3276                            .dwattr $C$DW$212, DW_AT_decl_line(0x80)
    3277                            .dwattr $C$DW$212, DW_AT_decl_column(0x0f)
    3278                    
    3279                    $C$DW$213       .dwtag  DW_TAG_member
    3280                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$22)
    3281                            .dwattr $C$DW$213, DW_AT_name("pastTrig")
    3282                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("pastTrig")
    3283                            .dwattr $C$DW$213, DW_AT_bit_offset(0x00)
    3284                            .dwattr $C$DW$213, DW_AT_bit_size(0x01)
    3285                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3286                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3287                            .dwattr $C$DW$213, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3288                            .dwattr $C$DW$213, DW_AT_decl_line(0x81)
    3289                            .dwattr $C$DW$213, DW_AT_decl_column(0x0f)
    3290                    
    3291                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    3292                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x7c)
    3293                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x0b)
    3294                            .dwendtag $C$DW$T$26
    3295                    
    3296                    
    3297                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    3298                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{44585F17-F0A3-4DEF-AFE8-887A5AB383A5} PAGE   61

    3299                    $C$DW$214       .dwtag  DW_TAG_member
    3300                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$22)
    3301                            .dwattr $C$DW$214, DW_AT_name("rule")
    3302                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("rule")
    3303                            .dwattr $C$DW$214, DW_AT_bit_offset(0x04)
    3304                            .dwattr $C$DW$214, DW_AT_bit_size(0x04)
    3305                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3306                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3307                            .dwattr $C$DW$214, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3308                            .dwattr $C$DW$214, DW_AT_decl_line(0x85)
    3309                            .dwattr $C$DW$214, DW_AT_decl_column(0x0f)
    3310                    
    3311                    $C$DW$215       .dwtag  DW_TAG_member
    3312                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$22)
    3313                            .dwattr $C$DW$215, DW_AT_name("nSkip")
    3314                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("nSkip")
    3315                            .dwattr $C$DW$215, DW_AT_bit_offset(0x00)
    3316                            .dwattr $C$DW$215, DW_AT_bit_size(0x04)
    3317                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3318                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3319                            .dwattr $C$DW$215, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3320                            .dwattr $C$DW$215, DW_AT_decl_line(0x86)
    3321                            .dwattr $C$DW$215, DW_AT_decl_column(0x0f)
    3322                    
    3323                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    3324                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x84)
    3325                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x0b)
    3326                            .dwendtag $C$DW$T$27
    3327                    
    3328                    
    3329                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    3330                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    3331                    $C$DW$216       .dwtag  DW_TAG_member
    3332                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$22)
    3333                            .dwattr $C$DW$216, DW_AT_name("triggerType")
    3334                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("triggerType")
    3335                            .dwattr $C$DW$216, DW_AT_bit_offset(0x04)
    3336                            .dwattr $C$DW$216, DW_AT_bit_size(0x04)
    3337                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3338                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3339                            .dwattr $C$DW$216, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3340                            .dwattr $C$DW$216, DW_AT_decl_line(0xb3)
    3341                            .dwattr $C$DW$216, DW_AT_decl_column(0x0f)
    3342                    
    3343                    $C$DW$217       .dwtag  DW_TAG_member
    3344                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$22)
    3345                            .dwattr $C$DW$217, DW_AT_name("bEnaCmd")
    3346                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("bEnaCmd")
    3347                            .dwattr $C$DW$217, DW_AT_bit_offset(0x03)
    3348                            .dwattr $C$DW$217, DW_AT_bit_size(0x01)
    3349                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3350                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3351                            .dwattr $C$DW$217, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3352                            .dwattr $C$DW$217, DW_AT_decl_line(0xb4)
    3353                            .dwattr $C$DW$217, DW_AT_decl_column(0x0f)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{44585F17-F0A3-4DEF-AFE8-887A5AB383A5} PAGE   62

    3354                    
    3355                    $C$DW$218       .dwtag  DW_TAG_member
    3356                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$22)
    3357                            .dwattr $C$DW$218, DW_AT_name("triggerNo")
    3358                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("triggerNo")
    3359                            .dwattr $C$DW$218, DW_AT_bit_offset(0x01)
    3360                            .dwattr $C$DW$218, DW_AT_bit_size(0x02)
    3361                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3362                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3363                            .dwattr $C$DW$218, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3364                            .dwattr $C$DW$218, DW_AT_decl_line(0xb6)
    3365                            .dwattr $C$DW$218, DW_AT_decl_column(0x0f)
    3366                    
    3367                    $C$DW$219       .dwtag  DW_TAG_member
    3368                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$22)
    3369                            .dwattr $C$DW$219, DW_AT_name("pastTrig")
    3370                            .dwattr $C$DW$219, DW_AT_TI_symbol_name("pastTrig")
    3371                            .dwattr $C$DW$219, DW_AT_bit_offset(0x00)
    3372                            .dwattr $C$DW$219, DW_AT_bit_size(0x01)
    3373                            .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3374                            .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3375                            .dwattr $C$DW$219, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3376                            .dwattr $C$DW$219, DW_AT_decl_line(0xb7)
    3377                            .dwattr $C$DW$219, DW_AT_decl_column(0x0f)
    3378                    
    3379                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    3380                            .dwattr $C$DW$T$28, DW_AT_decl_line(0xb2)
    3381                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x0b)
    3382                            .dwendtag $C$DW$T$28
    3383                    
    3384                    
    3385                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3386                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    3387                    $C$DW$220       .dwtag  DW_TAG_member
    3388                            .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$22)
    3389                            .dwattr $C$DW$220, DW_AT_name("rule")
    3390                            .dwattr $C$DW$220, DW_AT_TI_symbol_name("rule")
    3391                            .dwattr $C$DW$220, DW_AT_bit_offset(0x04)
    3392                            .dwattr $C$DW$220, DW_AT_bit_size(0x04)
    3393                            .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3394                            .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3395                            .dwattr $C$DW$220, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3396                            .dwattr $C$DW$220, DW_AT_decl_line(0xbb)
    3397                            .dwattr $C$DW$220, DW_AT_decl_column(0x0f)
    3398                    
    3399                    $C$DW$221       .dwtag  DW_TAG_member
    3400                            .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$22)
    3401                            .dwattr $C$DW$221, DW_AT_name("nSkip")
    3402                            .dwattr $C$DW$221, DW_AT_TI_symbol_name("nSkip")
    3403                            .dwattr $C$DW$221, DW_AT_bit_offset(0x00)
    3404                            .dwattr $C$DW$221, DW_AT_bit_size(0x04)
    3405                            .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3406                            .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3407                            .dwattr $C$DW$221, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3408                            .dwattr $C$DW$221, DW_AT_decl_line(0xbc)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{44585F17-F0A3-4DEF-AFE8-887A5AB383A5} PAGE   63

    3409                            .dwattr $C$DW$221, DW_AT_decl_column(0x0f)
    3410                    
    3411                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    3412                            .dwattr $C$DW$T$29, DW_AT_decl_line(0xba)
    3413                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x0b)
    3414                            .dwendtag $C$DW$T$29
    3415                    
    3416                    
    3417                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3418                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    3419                    $C$DW$222       .dwtag  DW_TAG_member
    3420                            .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$31)
    3421                            .dwattr $C$DW$222, DW_AT_name("frontEndMode")
    3422                            .dwattr $C$DW$222, DW_AT_TI_symbol_name("frontEndMode")
    3423                            .dwattr $C$DW$222, DW_AT_bit_offset(0x0d)
    3424                            .dwattr $C$DW$222, DW_AT_bit_size(0x03)
    3425                            .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3426                            .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3427                            .dwattr $C$DW$222, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3428                            .dwattr $C$DW$222, DW_AT_decl_line(0xc9)
    3429                            .dwattr $C$DW$222, DW_AT_decl_column(0x10)
    3430                    
    3431                    $C$DW$223       .dwtag  DW_TAG_member
    3432                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$31)
    3433                            .dwattr $C$DW$223, DW_AT_name("biasMode")
    3434                            .dwattr $C$DW$223, DW_AT_TI_symbol_name("biasMode")
    3435                            .dwattr $C$DW$223, DW_AT_bit_offset(0x0c)
    3436                            .dwattr $C$DW$223, DW_AT_bit_size(0x01)
    3437                            .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3438                            .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3439                            .dwattr $C$DW$223, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3440                            .dwattr $C$DW$223, DW_AT_decl_line(0xcf)
    3441                            .dwattr $C$DW$223, DW_AT_decl_column(0x10)
    3442                    
    3443                    $C$DW$224       .dwtag  DW_TAG_member
    3444                            .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$31)
    3445                            .dwattr $C$DW$224, DW_AT_name("analogCfgMode")
    3446                            .dwattr $C$DW$224, DW_AT_TI_symbol_name("analogCfgMode")
    3447                            .dwattr $C$DW$224, DW_AT_bit_offset(0x06)
    3448                            .dwattr $C$DW$224, DW_AT_bit_size(0x06)
    3449                            .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3450                            .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3451                            .dwattr $C$DW$224, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3452                            .dwattr $C$DW$224, DW_AT_decl_line(0xd1)
    3453                            .dwattr $C$DW$224, DW_AT_decl_column(0x10)
    3454                    
    3455                    $C$DW$225       .dwtag  DW_TAG_member
    3456                            .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$31)
    3457                            .dwattr $C$DW$225, DW_AT_name("bNoFsPowerUp")
    3458                            .dwattr $C$DW$225, DW_AT_TI_symbol_name("bNoFsPowerUp")
    3459                            .dwattr $C$DW$225, DW_AT_bit_offset(0x05)
    3460                            .dwattr $C$DW$225, DW_AT_bit_size(0x01)
    3461                            .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3462                            .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3463                            .dwattr $C$DW$225, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{44585F17-F0A3-4DEF-AFE8-887A5AB383A5} PAGE   64

    3464                            .dwattr $C$DW$225, DW_AT_decl_line(0xd8)
    3465                            .dwattr $C$DW$225, DW_AT_decl_column(0x10)
    3466                    
    3467                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    3468                            .dwattr $C$DW$T$32, DW_AT_decl_line(0xc8)
    3469                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x0b)
    3470                            .dwendtag $C$DW$T$32
    3471                    
    3472                    
    3473                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3474                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    3475                    $C$DW$226       .dwtag  DW_TAG_member
    3476                            .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$22)
    3477                            .dwattr $C$DW$226, DW_AT_name("triggerType")
    3478                            .dwattr $C$DW$226, DW_AT_TI_symbol_name("triggerType")
    3479                            .dwattr $C$DW$226, DW_AT_bit_offset(0x04)
    3480                            .dwattr $C$DW$226, DW_AT_bit_size(0x04)
    3481                            .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3482                            .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3483                            .dwattr $C$DW$226, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3484                            .dwattr $C$DW$226, DW_AT_decl_line(0x1cf)
    3485                            .dwattr $C$DW$226, DW_AT_decl_column(0x0f)
    3486                    
    3487                    $C$DW$227       .dwtag  DW_TAG_member
    3488                            .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$22)
    3489                            .dwattr $C$DW$227, DW_AT_name("bEnaCmd")
    3490                            .dwattr $C$DW$227, DW_AT_TI_symbol_name("bEnaCmd")
    3491                            .dwattr $C$DW$227, DW_AT_bit_offset(0x03)
    3492                            .dwattr $C$DW$227, DW_AT_bit_size(0x01)
    3493                            .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3494                            .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3495                            .dwattr $C$DW$227, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3496                            .dwattr $C$DW$227, DW_AT_decl_line(0x1d0)
    3497                            .dwattr $C$DW$227, DW_AT_decl_column(0x0f)
    3498                    
    3499                    $C$DW$228       .dwtag  DW_TAG_member
    3500                            .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$22)
    3501                            .dwattr $C$DW$228, DW_AT_name("triggerNo")
    3502                            .dwattr $C$DW$228, DW_AT_TI_symbol_name("triggerNo")
    3503                            .dwattr $C$DW$228, DW_AT_bit_offset(0x01)
    3504                            .dwattr $C$DW$228, DW_AT_bit_size(0x02)
    3505                            .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3506                            .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3507                            .dwattr $C$DW$228, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3508                            .dwattr $C$DW$228, DW_AT_decl_line(0x1d2)
    3509                            .dwattr $C$DW$228, DW_AT_decl_column(0x0f)
    3510                    
    3511                    $C$DW$229       .dwtag  DW_TAG_member
    3512                            .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$22)
    3513                            .dwattr $C$DW$229, DW_AT_name("pastTrig")
    3514                            .dwattr $C$DW$229, DW_AT_TI_symbol_name("pastTrig")
    3515                            .dwattr $C$DW$229, DW_AT_bit_offset(0x00)
    3516                            .dwattr $C$DW$229, DW_AT_bit_size(0x01)
    3517                            .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3518                            .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{44585F17-F0A3-4DEF-AFE8-887A5AB383A5} PAGE   65

    3519                            .dwattr $C$DW$229, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3520                            .dwattr $C$DW$229, DW_AT_decl_line(0x1d3)
    3521                            .dwattr $C$DW$229, DW_AT_decl_column(0x0f)
    3522                    
    3523                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    3524                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x1ce)
    3525                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x0b)
    3526                            .dwendtag $C$DW$T$33
    3527                    
    3528                    
    3529                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3530                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    3531                    $C$DW$230       .dwtag  DW_TAG_member
    3532                            .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$22)
    3533                            .dwattr $C$DW$230, DW_AT_name("rule")
    3534                            .dwattr $C$DW$230, DW_AT_TI_symbol_name("rule")
    3535                            .dwattr $C$DW$230, DW_AT_bit_offset(0x04)
    3536                            .dwattr $C$DW$230, DW_AT_bit_size(0x04)
    3537                            .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3538                            .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3539                            .dwattr $C$DW$230, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3540                            .dwattr $C$DW$230, DW_AT_decl_line(0x1d7)
    3541                            .dwattr $C$DW$230, DW_AT_decl_column(0x0f)
    3542                    
    3543                    $C$DW$231       .dwtag  DW_TAG_member
    3544                            .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$22)
    3545                            .dwattr $C$DW$231, DW_AT_name("nSkip")
    3546                            .dwattr $C$DW$231, DW_AT_TI_symbol_name("nSkip")
    3547                            .dwattr $C$DW$231, DW_AT_bit_offset(0x00)
    3548                            .dwattr $C$DW$231, DW_AT_bit_size(0x04)
    3549                            .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3550                            .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3551                            .dwattr $C$DW$231, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3552                            .dwattr $C$DW$231, DW_AT_decl_line(0x1d8)
    3553                            .dwattr $C$DW$231, DW_AT_decl_column(0x0f)
    3554                    
    3555                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    3556                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x1d6)
    3557                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x0b)
    3558                            .dwendtag $C$DW$T$34
    3559                    
    3560                    
    3561                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3562                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    3563                    $C$DW$232       .dwtag  DW_TAG_member
    3564                            .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$31)
    3565                            .dwattr $C$DW$232, DW_AT_name("modType")
    3566                            .dwattr $C$DW$232, DW_AT_TI_symbol_name("modType")
    3567                            .dwattr $C$DW$232, DW_AT_bit_offset(0x0d)
    3568                            .dwattr $C$DW$232, DW_AT_bit_size(0x03)
    3569                            .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3570                            .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3571                            .dwattr $C$DW$232, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3572                            .dwattr $C$DW$232, DW_AT_decl_line(0x1db)
    3573                            .dwattr $C$DW$232, DW_AT_decl_column(0x10)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{44585F17-F0A3-4DEF-AFE8-887A5AB383A5} PAGE   66

    3574                    
    3575                    $C$DW$233       .dwtag  DW_TAG_member
    3576                            .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$31)
    3577                            .dwattr $C$DW$233, DW_AT_name("deviation")
    3578                            .dwattr $C$DW$233, DW_AT_TI_symbol_name("deviation")
    3579                            .dwattr $C$DW$233, DW_AT_bit_offset(0x00)
    3580                            .dwattr $C$DW$233, DW_AT_bit_size(0x0d)
    3581                            .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3582                            .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3583                            .dwattr $C$DW$233, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3584                            .dwattr $C$DW$233, DW_AT_decl_line(0x1de)
    3585                            .dwattr $C$DW$233, DW_AT_decl_column(0x10)
    3586                    
    3587                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    3588                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x1da)
    3589                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x0b)
    3590                            .dwendtag $C$DW$T$35
    3591                    
    3592                    
    3593                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    3594                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    3595                    $C$DW$234       .dwtag  DW_TAG_member
    3596                            .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$37)
    3597                            .dwattr $C$DW$234, DW_AT_name("preScale")
    3598                            .dwattr $C$DW$234, DW_AT_TI_symbol_name("preScale")
    3599                            .dwattr $C$DW$234, DW_AT_bit_offset(0x1c)
    3600                            .dwattr $C$DW$234, DW_AT_bit_size(0x04)
    3601                            .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3602                            .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3603                            .dwattr $C$DW$234, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3604                            .dwattr $C$DW$234, DW_AT_decl_line(0x1e1)
    3605                            .dwattr $C$DW$234, DW_AT_decl_column(0x10)
    3606                    
    3607                    $C$DW$235       .dwtag  DW_TAG_member
    3608                            .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$37)
    3609                            .dwattr $C$DW$235, DW_AT_name("rateWord")
    3610                            .dwattr $C$DW$235, DW_AT_TI_symbol_name("rateWord")
    3611                            .dwattr $C$DW$235, DW_AT_bit_offset(0x03)
    3612                            .dwattr $C$DW$235, DW_AT_bit_size(0x15)
    3613                            .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3614                            .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3615                            .dwattr $C$DW$235, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3616                            .dwattr $C$DW$235, DW_AT_decl_line(0x1e3)
    3617                            .dwattr $C$DW$235, DW_AT_decl_column(0x10)
    3618                    
    3619                    $C$DW$236       .dwtag  DW_TAG_member
    3620                            .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$37)
    3621                            .dwattr $C$DW$236, DW_AT_name("decimMode")
    3622                            .dwattr $C$DW$236, DW_AT_TI_symbol_name("decimMode")
    3623                            .dwattr $C$DW$236, DW_AT_bit_offset(0x00)
    3624                            .dwattr $C$DW$236, DW_AT_bit_size(0x03)
    3625                            .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3626                            .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3627                            .dwattr $C$DW$236, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3628                            .dwattr $C$DW$236, DW_AT_decl_line(0x1e4)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{44585F17-F0A3-4DEF-AFE8-887A5AB383A5} PAGE   67

    3629                            .dwattr $C$DW$236, DW_AT_decl_column(0x10)
    3630                    
    3631                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    3632                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x1e0)
    3633                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x0b)
    3634                            .dwendtag $C$DW$T$38
    3635                    
    3636                    
    3637                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    3638                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    3639                    $C$DW$237       .dwtag  DW_TAG_member
    3640                            .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$22)
    3641                            .dwattr $C$DW$237, DW_AT_name("nPreamBytes")
    3642                            .dwattr $C$DW$237, DW_AT_TI_symbol_name("nPreamBytes")
    3643                            .dwattr $C$DW$237, DW_AT_bit_offset(0x02)
    3644                            .dwattr $C$DW$237, DW_AT_bit_size(0x06)
    3645                            .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3646                            .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3647                            .dwattr $C$DW$237, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3648                            .dwattr $C$DW$237, DW_AT_decl_line(0x1ec)
    3649                            .dwattr $C$DW$237, DW_AT_decl_column(0x0f)
    3650                    
    3651                    $C$DW$238       .dwtag  DW_TAG_member
    3652                            .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$22)
    3653                            .dwattr $C$DW$238, DW_AT_name("preamMode")
    3654                            .dwattr $C$DW$238, DW_AT_TI_symbol_name("preamMode")
    3655                            .dwattr $C$DW$238, DW_AT_bit_offset(0x00)
    3656                            .dwattr $C$DW$238, DW_AT_bit_size(0x02)
    3657                            .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3658                            .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3659                            .dwattr $C$DW$238, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3660                            .dwattr $C$DW$238, DW_AT_decl_line(0x1f2)
    3661                            .dwattr $C$DW$238, DW_AT_decl_column(0x0f)
    3662                    
    3663                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    3664                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x1eb)
    3665                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x0b)
    3666                            .dwendtag $C$DW$T$39
    3667                    
    3668                    
    3669                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3670                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    3671                    $C$DW$239       .dwtag  DW_TAG_member
    3672                            .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$31)
    3673                            .dwattr $C$DW$239, DW_AT_name("nSwBits")
    3674                            .dwattr $C$DW$239, DW_AT_TI_symbol_name("nSwBits")
    3675                            .dwattr $C$DW$239, DW_AT_bit_offset(0x0a)
    3676                            .dwattr $C$DW$239, DW_AT_bit_size(0x06)
    3677                            .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3678                            .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3679                            .dwattr $C$DW$239, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3680                            .dwattr $C$DW$239, DW_AT_decl_line(0x1f8)
    3681                            .dwattr $C$DW$239, DW_AT_decl_column(0x10)
    3682                    
    3683                    $C$DW$240       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{44585F17-F0A3-4DEF-AFE8-887A5AB383A5} PAGE   68

    3684                            .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$31)
    3685                            .dwattr $C$DW$240, DW_AT_name("bBitReversal")
    3686                            .dwattr $C$DW$240, DW_AT_TI_symbol_name("bBitReversal")
    3687                            .dwattr $C$DW$240, DW_AT_bit_offset(0x09)
    3688                            .dwattr $C$DW$240, DW_AT_bit_size(0x01)
    3689                            .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3690                            .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3691                            .dwattr $C$DW$240, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3692                            .dwattr $C$DW$240, DW_AT_decl_line(0x1f9)
    3693                            .dwattr $C$DW$240, DW_AT_decl_column(0x10)
    3694                    
    3695                    $C$DW$241       .dwtag  DW_TAG_member
    3696                            .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$31)
    3697                            .dwattr $C$DW$241, DW_AT_name("bMsbFirst")
    3698                            .dwattr $C$DW$241, DW_AT_TI_symbol_name("bMsbFirst")
    3699                            .dwattr $C$DW$241, DW_AT_bit_offset(0x08)
    3700                            .dwattr $C$DW$241, DW_AT_bit_size(0x01)
    3701                            .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3702                            .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3703                            .dwattr $C$DW$241, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3704                            .dwattr $C$DW$241, DW_AT_decl_line(0x1fb)
    3705                            .dwattr $C$DW$241, DW_AT_decl_column(0x10)
    3706                    
    3707                    $C$DW$242       .dwtag  DW_TAG_member
    3708                            .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$31)
    3709                            .dwattr $C$DW$242, DW_AT_name("fecMode")
    3710                            .dwattr $C$DW$242, DW_AT_TI_symbol_name("fecMode")
    3711                            .dwattr $C$DW$242, DW_AT_bit_offset(0x04)
    3712                            .dwattr $C$DW$242, DW_AT_bit_size(0x04)
    3713                            .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3714                            .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3715                            .dwattr $C$DW$242, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3716                            .dwattr $C$DW$242, DW_AT_decl_line(0x1fd)
    3717                            .dwattr $C$DW$242, DW_AT_decl_column(0x10)
    3718                    
    3719                    $C$DW$243       .dwtag  DW_TAG_member
    3720                            .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$31)
    3721                            .dwattr $C$DW$243, DW_AT_name("whitenMode")
    3722                            .dwattr $C$DW$243, DW_AT_TI_symbol_name("whitenMode")
    3723                            .dwattr $C$DW$243, DW_AT_bit_offset(0x00)
    3724                            .dwattr $C$DW$243, DW_AT_bit_size(0x03)
    3725                            .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3726                            .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3727                            .dwattr $C$DW$243, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3728                            .dwattr $C$DW$243, DW_AT_decl_line(0x203)
    3729                            .dwattr $C$DW$243, DW_AT_decl_column(0x10)
    3730                    
    3731                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    3732                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x1f7)
    3733                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0b)
    3734                            .dwendtag $C$DW$T$40
    3735                    
    3736                    
    3737                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3738                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{44585F17-F0A3-4DEF-AFE8-887A5AB383A5} PAGE   69

    3739                    $C$DW$244       .dwtag  DW_TAG_member
    3740                            .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$31)
    3741                            .dwattr $C$DW$244, DW_AT_name("frontEndMode")
    3742                            .dwattr $C$DW$244, DW_AT_TI_symbol_name("frontEndMode")
    3743                            .dwattr $C$DW$244, DW_AT_bit_offset(0x0d)
    3744                            .dwattr $C$DW$244, DW_AT_bit_size(0x03)
    3745                            .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3746                            .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3747                            .dwattr $C$DW$244, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3748                            .dwattr $C$DW$244, DW_AT_decl_line(0x20d)
    3749                            .dwattr $C$DW$244, DW_AT_decl_column(0x10)
    3750                    
    3751                    $C$DW$245       .dwtag  DW_TAG_member
    3752                            .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$31)
    3753                            .dwattr $C$DW$245, DW_AT_name("biasMode")
    3754                            .dwattr $C$DW$245, DW_AT_TI_symbol_name("biasMode")
    3755                            .dwattr $C$DW$245, DW_AT_bit_offset(0x0c)
    3756                            .dwattr $C$DW$245, DW_AT_bit_size(0x01)
    3757                            .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3758                            .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3759                            .dwattr $C$DW$245, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3760                            .dwattr $C$DW$245, DW_AT_decl_line(0x213)
    3761                            .dwattr $C$DW$245, DW_AT_decl_column(0x10)
    3762                    
    3763                    $C$DW$246       .dwtag  DW_TAG_member
    3764                            .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$31)
    3765                            .dwattr $C$DW$246, DW_AT_name("analogCfgMode")
    3766                            .dwattr $C$DW$246, DW_AT_TI_symbol_name("analogCfgMode")
    3767                            .dwattr $C$DW$246, DW_AT_bit_offset(0x06)
    3768                            .dwattr $C$DW$246, DW_AT_bit_size(0x06)
    3769                            .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3770                            .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3771                            .dwattr $C$DW$246, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3772                            .dwattr $C$DW$246, DW_AT_decl_line(0x215)
    3773                            .dwattr $C$DW$246, DW_AT_decl_column(0x10)
    3774                    
    3775                    $C$DW$247       .dwtag  DW_TAG_member
    3776                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$31)
    3777                            .dwattr $C$DW$247, DW_AT_name("bNoFsPowerUp")
    3778                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("bNoFsPowerUp")
    3779                            .dwattr $C$DW$247, DW_AT_bit_offset(0x05)
    3780                            .dwattr $C$DW$247, DW_AT_bit_size(0x01)
    3781                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3782                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3783                            .dwattr $C$DW$247, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3784                            .dwattr $C$DW$247, DW_AT_decl_line(0x21c)
    3785                            .dwattr $C$DW$247, DW_AT_decl_column(0x10)
    3786                    
    3787                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    3788                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x20c)
    3789                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x0b)
    3790                            .dwendtag $C$DW$T$41
    3791                    
    3792                    
    3793                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{44585F17-F0A3-4DEF-AFE8-887A5AB383A5} PAGE   70

    3794                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    3795                    $C$DW$248       .dwtag  DW_TAG_member
    3796                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$22)
    3797                            .dwattr $C$DW$248, DW_AT_name("triggerType")
    3798                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("triggerType")
    3799                            .dwattr $C$DW$248, DW_AT_bit_offset(0x04)
    3800                            .dwattr $C$DW$248, DW_AT_bit_size(0x04)
    3801                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3802                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3803                            .dwattr $C$DW$248, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3804                            .dwattr $C$DW$248, DW_AT_decl_line(0x232)
    3805                            .dwattr $C$DW$248, DW_AT_decl_column(0x0f)
    3806                    
    3807                    $C$DW$249       .dwtag  DW_TAG_member
    3808                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$22)
    3809                            .dwattr $C$DW$249, DW_AT_name("bEnaCmd")
    3810                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("bEnaCmd")
    3811                            .dwattr $C$DW$249, DW_AT_bit_offset(0x03)
    3812                            .dwattr $C$DW$249, DW_AT_bit_size(0x01)
    3813                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3814                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3815                            .dwattr $C$DW$249, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3816                            .dwattr $C$DW$249, DW_AT_decl_line(0x233)
    3817                            .dwattr $C$DW$249, DW_AT_decl_column(0x0f)
    3818                    
    3819                    $C$DW$250       .dwtag  DW_TAG_member
    3820                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$22)
    3821                            .dwattr $C$DW$250, DW_AT_name("triggerNo")
    3822                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("triggerNo")
    3823                            .dwattr $C$DW$250, DW_AT_bit_offset(0x01)
    3824                            .dwattr $C$DW$250, DW_AT_bit_size(0x02)
    3825                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3826                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3827                            .dwattr $C$DW$250, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3828                            .dwattr $C$DW$250, DW_AT_decl_line(0x235)
    3829                            .dwattr $C$DW$250, DW_AT_decl_column(0x0f)
    3830                    
    3831                    $C$DW$251       .dwtag  DW_TAG_member
    3832                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$22)
    3833                            .dwattr $C$DW$251, DW_AT_name("pastTrig")
    3834                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("pastTrig")
    3835                            .dwattr $C$DW$251, DW_AT_bit_offset(0x00)
    3836                            .dwattr $C$DW$251, DW_AT_bit_size(0x01)
    3837                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3838                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3839                            .dwattr $C$DW$251, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3840                            .dwattr $C$DW$251, DW_AT_decl_line(0x236)
    3841                            .dwattr $C$DW$251, DW_AT_decl_column(0x0f)
    3842                    
    3843                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    3844                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x231)
    3845                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0b)
    3846                            .dwendtag $C$DW$T$42
    3847                    
    3848                    
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{44585F17-F0A3-4DEF-AFE8-887A5AB383A5} PAGE   71

    3849                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    3850                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    3851                    $C$DW$252       .dwtag  DW_TAG_member
    3852                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$22)
    3853                            .dwattr $C$DW$252, DW_AT_name("rule")
    3854                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("rule")
    3855                            .dwattr $C$DW$252, DW_AT_bit_offset(0x04)
    3856                            .dwattr $C$DW$252, DW_AT_bit_size(0x04)
    3857                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3858                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3859                            .dwattr $C$DW$252, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3860                            .dwattr $C$DW$252, DW_AT_decl_line(0x23a)
    3861                            .dwattr $C$DW$252, DW_AT_decl_column(0x0f)
    3862                    
    3863                    $C$DW$253       .dwtag  DW_TAG_member
    3864                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$22)
    3865                            .dwattr $C$DW$253, DW_AT_name("nSkip")
    3866                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("nSkip")
    3867                            .dwattr $C$DW$253, DW_AT_bit_offset(0x00)
    3868                            .dwattr $C$DW$253, DW_AT_bit_size(0x04)
    3869                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3870                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3871                            .dwattr $C$DW$253, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3872                            .dwattr $C$DW$253, DW_AT_decl_line(0x23b)
    3873                            .dwattr $C$DW$253, DW_AT_decl_column(0x0f)
    3874                    
    3875                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    3876                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x239)
    3877                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x0b)
    3878                            .dwendtag $C$DW$T$43
    3879                    
    3880                    
    3881                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    3882                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    3883                    $C$DW$254       .dwtag  DW_TAG_member
    3884                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$31)
    3885                            .dwattr $C$DW$254, DW_AT_name("modType")
    3886                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("modType")
    3887                            .dwattr $C$DW$254, DW_AT_bit_offset(0x0d)
    3888                            .dwattr $C$DW$254, DW_AT_bit_size(0x03)
    3889                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3890                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3891                            .dwattr $C$DW$254, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3892                            .dwattr $C$DW$254, DW_AT_decl_line(0x23e)
    3893                            .dwattr $C$DW$254, DW_AT_decl_column(0x10)
    3894                    
    3895                    $C$DW$255       .dwtag  DW_TAG_member
    3896                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$31)
    3897                            .dwattr $C$DW$255, DW_AT_name("deviation")
    3898                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("deviation")
    3899                            .dwattr $C$DW$255, DW_AT_bit_offset(0x00)
    3900                            .dwattr $C$DW$255, DW_AT_bit_size(0x0d)
    3901                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3902                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3903                            .dwattr $C$DW$255, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{44585F17-F0A3-4DEF-AFE8-887A5AB383A5} PAGE   72

    3904                            .dwattr $C$DW$255, DW_AT_decl_line(0x241)
    3905                            .dwattr $C$DW$255, DW_AT_decl_column(0x10)
    3906                    
    3907                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    3908                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x23d)
    3909                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x0b)
    3910                            .dwendtag $C$DW$T$44
    3911                    
    3912                    
    3913                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    3914                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x04)
    3915                    $C$DW$256       .dwtag  DW_TAG_member
    3916                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$37)
    3917                            .dwattr $C$DW$256, DW_AT_name("preScale")
    3918                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("preScale")
    3919                            .dwattr $C$DW$256, DW_AT_bit_offset(0x1c)
    3920                            .dwattr $C$DW$256, DW_AT_bit_size(0x04)
    3921                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3922                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3923                            .dwattr $C$DW$256, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3924                            .dwattr $C$DW$256, DW_AT_decl_line(0x244)
    3925                            .dwattr $C$DW$256, DW_AT_decl_column(0x10)
    3926                    
    3927                    $C$DW$257       .dwtag  DW_TAG_member
    3928                            .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$37)
    3929                            .dwattr $C$DW$257, DW_AT_name("rateWord")
    3930                            .dwattr $C$DW$257, DW_AT_TI_symbol_name("rateWord")
    3931                            .dwattr $C$DW$257, DW_AT_bit_offset(0x03)
    3932                            .dwattr $C$DW$257, DW_AT_bit_size(0x15)
    3933                            .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3934                            .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3935                            .dwattr $C$DW$257, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3936                            .dwattr $C$DW$257, DW_AT_decl_line(0x246)
    3937                            .dwattr $C$DW$257, DW_AT_decl_column(0x10)
    3938                    
    3939                    $C$DW$258       .dwtag  DW_TAG_member
    3940                            .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$37)
    3941                            .dwattr $C$DW$258, DW_AT_name("decimMode")
    3942                            .dwattr $C$DW$258, DW_AT_TI_symbol_name("decimMode")
    3943                            .dwattr $C$DW$258, DW_AT_bit_offset(0x00)
    3944                            .dwattr $C$DW$258, DW_AT_bit_size(0x03)
    3945                            .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3946                            .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3947                            .dwattr $C$DW$258, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3948                            .dwattr $C$DW$258, DW_AT_decl_line(0x247)
    3949                            .dwattr $C$DW$258, DW_AT_decl_column(0x10)
    3950                    
    3951                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    3952                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x243)
    3953                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x0b)
    3954                            .dwendtag $C$DW$T$45
    3955                    
    3956                    
    3957                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    3958                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{44585F17-F0A3-4DEF-AFE8-887A5AB383A5} PAGE   73

    3959                    $C$DW$259       .dwtag  DW_TAG_member
    3960                            .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$22)
    3961                            .dwattr $C$DW$259, DW_AT_name("nPreamBytes")
    3962                            .dwattr $C$DW$259, DW_AT_TI_symbol_name("nPreamBytes")
    3963                            .dwattr $C$DW$259, DW_AT_bit_offset(0x02)
    3964                            .dwattr $C$DW$259, DW_AT_bit_size(0x06)
    3965                            .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3966                            .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3967                            .dwattr $C$DW$259, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3968                            .dwattr $C$DW$259, DW_AT_decl_line(0x24f)
    3969                            .dwattr $C$DW$259, DW_AT_decl_column(0x0f)
    3970                    
    3971                    $C$DW$260       .dwtag  DW_TAG_member
    3972                            .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$22)
    3973                            .dwattr $C$DW$260, DW_AT_name("preamMode")
    3974                            .dwattr $C$DW$260, DW_AT_TI_symbol_name("preamMode")
    3975                            .dwattr $C$DW$260, DW_AT_bit_offset(0x00)
    3976                            .dwattr $C$DW$260, DW_AT_bit_size(0x02)
    3977                            .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3978                            .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3979                            .dwattr $C$DW$260, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    3980                            .dwattr $C$DW$260, DW_AT_decl_line(0x255)
    3981                            .dwattr $C$DW$260, DW_AT_decl_column(0x0f)
    3982                    
    3983                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    3984                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x24e)
    3985                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x0b)
    3986                            .dwendtag $C$DW$T$46
    3987                    
    3988                    
    3989                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    3990                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    3991                    $C$DW$261       .dwtag  DW_TAG_member
    3992                            .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$31)
    3993                            .dwattr $C$DW$261, DW_AT_name("nSwBits")
    3994                            .dwattr $C$DW$261, DW_AT_TI_symbol_name("nSwBits")
    3995                            .dwattr $C$DW$261, DW_AT_bit_offset(0x0a)
    3996                            .dwattr $C$DW$261, DW_AT_bit_size(0x06)
    3997                            .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3998                            .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3999                            .dwattr $C$DW$261, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    4000                            .dwattr $C$DW$261, DW_AT_decl_line(0x25b)
    4001                            .dwattr $C$DW$261, DW_AT_decl_column(0x10)
    4002                    
    4003                    $C$DW$262       .dwtag  DW_TAG_member
    4004                            .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$31)
    4005                            .dwattr $C$DW$262, DW_AT_name("bBitReversal")
    4006                            .dwattr $C$DW$262, DW_AT_TI_symbol_name("bBitReversal")
    4007                            .dwattr $C$DW$262, DW_AT_bit_offset(0x09)
    4008                            .dwattr $C$DW$262, DW_AT_bit_size(0x01)
    4009                            .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4010                            .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    4011                            .dwattr $C$DW$262, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    4012                            .dwattr $C$DW$262, DW_AT_decl_line(0x25c)
    4013                            .dwattr $C$DW$262, DW_AT_decl_column(0x10)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{44585F17-F0A3-4DEF-AFE8-887A5AB383A5} PAGE   74

    4014                    
    4015                    $C$DW$263       .dwtag  DW_TAG_member
    4016                            .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$31)
    4017                            .dwattr $C$DW$263, DW_AT_name("bMsbFirst")
    4018                            .dwattr $C$DW$263, DW_AT_TI_symbol_name("bMsbFirst")
    4019                            .dwattr $C$DW$263, DW_AT_bit_offset(0x08)
    4020                            .dwattr $C$DW$263, DW_AT_bit_size(0x01)
    4021                            .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4022                            .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    4023                            .dwattr $C$DW$263, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    4024                            .dwattr $C$DW$263, DW_AT_decl_line(0x25e)
    4025                            .dwattr $C$DW$263, DW_AT_decl_column(0x10)
    4026                    
    4027                    $C$DW$264       .dwtag  DW_TAG_member
    4028                            .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$31)
    4029                            .dwattr $C$DW$264, DW_AT_name("fecMode")
    4030                            .dwattr $C$DW$264, DW_AT_TI_symbol_name("fecMode")
    4031                            .dwattr $C$DW$264, DW_AT_bit_offset(0x04)
    4032                            .dwattr $C$DW$264, DW_AT_bit_size(0x04)
    4033                            .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4034                            .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    4035                            .dwattr $C$DW$264, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    4036                            .dwattr $C$DW$264, DW_AT_decl_line(0x260)
    4037                            .dwattr $C$DW$264, DW_AT_decl_column(0x10)
    4038                    
    4039                    $C$DW$265       .dwtag  DW_TAG_member
    4040                            .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$31)
    4041                            .dwattr $C$DW$265, DW_AT_name("whitenMode")
    4042                            .dwattr $C$DW$265, DW_AT_TI_symbol_name("whitenMode")
    4043                            .dwattr $C$DW$265, DW_AT_bit_offset(0x00)
    4044                            .dwattr $C$DW$265, DW_AT_bit_size(0x03)
    4045                            .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4046                            .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    4047                            .dwattr $C$DW$265, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    4048                            .dwattr $C$DW$265, DW_AT_decl_line(0x266)
    4049                            .dwattr $C$DW$265, DW_AT_decl_column(0x10)
    4050                    
    4051                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    4052                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x25a)
    4053                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x0b)
    4054                            .dwendtag $C$DW$T$47
    4055                    
    4056                    
    4057                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    4058                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    4059                    $C$DW$266       .dwtag  DW_TAG_member
    4060                            .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$31)
    4061                            .dwattr $C$DW$266, DW_AT_name("frontEndMode")
    4062                            .dwattr $C$DW$266, DW_AT_TI_symbol_name("frontEndMode")
    4063                            .dwattr $C$DW$266, DW_AT_bit_offset(0x0d)
    4064                            .dwattr $C$DW$266, DW_AT_bit_size(0x03)
    4065                            .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4066                            .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    4067                            .dwattr $C$DW$266, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    4068                            .dwattr $C$DW$266, DW_AT_decl_line(0x270)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{44585F17-F0A3-4DEF-AFE8-887A5AB383A5} PAGE   75

    4069                            .dwattr $C$DW$266, DW_AT_decl_column(0x10)
    4070                    
    4071                    $C$DW$267       .dwtag  DW_TAG_member
    4072                            .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$31)
    4073                            .dwattr $C$DW$267, DW_AT_name("biasMode")
    4074                            .dwattr $C$DW$267, DW_AT_TI_symbol_name("biasMode")
    4075                            .dwattr $C$DW$267, DW_AT_bit_offset(0x0c)
    4076                            .dwattr $C$DW$267, DW_AT_bit_size(0x01)
    4077                            .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4078                            .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    4079                            .dwattr $C$DW$267, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    4080                            .dwattr $C$DW$267, DW_AT_decl_line(0x276)
    4081                            .dwattr $C$DW$267, DW_AT_decl_column(0x10)
    4082                    
    4083                    $C$DW$268       .dwtag  DW_TAG_member
    4084                            .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$31)
    4085                            .dwattr $C$DW$268, DW_AT_name("analogCfgMode")
    4086                            .dwattr $C$DW$268, DW_AT_TI_symbol_name("analogCfgMode")
    4087                            .dwattr $C$DW$268, DW_AT_bit_offset(0x06)
    4088                            .dwattr $C$DW$268, DW_AT_bit_size(0x06)
    4089                            .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4090                            .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    4091                            .dwattr $C$DW$268, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    4092                            .dwattr $C$DW$268, DW_AT_decl_line(0x278)
    4093                            .dwattr $C$DW$268, DW_AT_decl_column(0x10)
    4094                    
    4095                    $C$DW$269       .dwtag  DW_TAG_member
    4096                            .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$31)
    4097                            .dwattr $C$DW$269, DW_AT_name("bNoFsPowerUp")
    4098                            .dwattr $C$DW$269, DW_AT_TI_symbol_name("bNoFsPowerUp")
    4099                            .dwattr $C$DW$269, DW_AT_bit_offset(0x05)
    4100                            .dwattr $C$DW$269, DW_AT_bit_size(0x01)
    4101                            .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4102                            .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    4103                            .dwattr $C$DW$269, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    4104                            .dwattr $C$DW$269, DW_AT_decl_line(0x27f)
    4105                            .dwattr $C$DW$269, DW_AT_decl_column(0x10)
    4106                    
    4107                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    4108                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x26f)
    4109                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x0b)
    4110                            .dwendtag $C$DW$T$48
    4111                    
    4112                    
    4113                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    4114                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x24)
    4115                    $C$DW$270       .dwtag  DW_TAG_member
    4116                            .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$37)
    4117                            .dwattr $C$DW$270, DW_AT_name("nInactivityTimeout")
    4118                            .dwattr $C$DW$270, DW_AT_TI_symbol_name("nInactivityTimeout")
    4119                            .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4120                            .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    4121                            .dwattr $C$DW$270, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    4122                            .dwattr $C$DW$270, DW_AT_decl_line(0x50e)
    4123                            .dwattr $C$DW$270, DW_AT_decl_column(0x1d)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{44585F17-F0A3-4DEF-AFE8-887A5AB383A5} PAGE   76

    4124                    
    4125                    $C$DW$271       .dwtag  DW_TAG_member
    4126                            .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$50)
    4127                            .dwattr $C$DW$271, DW_AT_name("pRfMode")
    4128                            .dwattr $C$DW$271, DW_AT_TI_symbol_name("pRfMode")
    4129                            .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4130                            .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    4131                            .dwattr $C$DW$271, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    4132                            .dwattr $C$DW$271, DW_AT_decl_line(0x50f)
    4133                            .dwattr $C$DW$271, DW_AT_decl_column(0x1d)
    4134                    
    4135                    $C$DW$272       .dwtag  DW_TAG_member
    4136                            .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$52)
    4137                            .dwattr $C$DW$272, DW_AT_name("pOpSetup")
    4138                            .dwattr $C$DW$272, DW_AT_TI_symbol_name("pOpSetup")
    4139                            .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4140                            .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    4141                            .dwattr $C$DW$272, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    4142                            .dwattr $C$DW$272, DW_AT_decl_line(0x510)
    4143                            .dwattr $C$DW$272, DW_AT_decl_column(0x1d)
    4144                    
    4145                    $C$DW$273       .dwtag  DW_TAG_member
    4146                            .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$37)
    4147                            .dwattr $C$DW$273, DW_AT_name("nPowerUpDuration")
    4148                            .dwattr $C$DW$273, DW_AT_TI_symbol_name("nPowerUpDuration")
    4149                            .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4150                            .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    4151                            .dwattr $C$DW$273, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    4152                            .dwattr $C$DW$273, DW_AT_decl_line(0x511)
    4153                            .dwattr $C$DW$273, DW_AT_decl_column(0x1d)
    4154                    
    4155                    $C$DW$274       .dwtag  DW_TAG_member
    4156                            .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$53)
    4157                            .dwattr $C$DW$274, DW_AT_name("bMeasurePowerUpDuration")
    4158                            .dwattr $C$DW$274, DW_AT_TI_symbol_name("bMeasurePowerUpDuration")
    4159                            .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4160                            .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    4161                            .dwattr $C$DW$274, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    4162                            .dwattr $C$DW$274, DW_AT_decl_line(0x512)
    4163                            .dwattr $C$DW$274, DW_AT_decl_column(0x1d)
    4164                    
    4165                    $C$DW$275       .dwtag  DW_TAG_member
    4166                            .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$53)
    4167                            .dwattr $C$DW$275, DW_AT_name("bUpdateSetup")
    4168                            .dwattr $C$DW$275, DW_AT_TI_symbol_name("bUpdateSetup")
    4169                            .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    4170                            .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    4171                            .dwattr $C$DW$275, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    4172                            .dwattr $C$DW$275, DW_AT_decl_line(0x513)
    4173                            .dwattr $C$DW$275, DW_AT_decl_column(0x1d)
    4174                    
    4175                    $C$DW$276       .dwtag  DW_TAG_member
    4176                            .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$31)
    4177                            .dwattr $C$DW$276, DW_AT_name("nPowerUpDurationMargin")
    4178                            .dwattr $C$DW$276, DW_AT_TI_symbol_name("nPowerUpDurationMargin")
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{44585F17-F0A3-4DEF-AFE8-887A5AB383A5} PAGE   77

    4179                            .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4180                            .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    4181                            .dwattr $C$DW$276, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    4182                            .dwattr $C$DW$276, DW_AT_decl_line(0x514)
    4183                            .dwattr $C$DW$276, DW_AT_decl_column(0x1d)
    4184                    
    4185                    $C$DW$277       .dwtag  DW_TAG_member
    4186                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$3)
    4187                            .dwattr $C$DW$277, DW_AT_name("pPowerCb")
    4188                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("pPowerCb")
    4189                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4190                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    4191                            .dwattr $C$DW$277, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    4192                            .dwattr $C$DW$277, DW_AT_decl_line(0x515)
    4193                            .dwattr $C$DW$277, DW_AT_decl_column(0x1d)
    4194                    
    4195                    $C$DW$278       .dwtag  DW_TAG_member
    4196                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$3)
    4197                            .dwattr $C$DW$278, DW_AT_name("pErrCb")
    4198                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("pErrCb")
    4199                            .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4200                            .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    4201                            .dwattr $C$DW$278, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    4202                            .dwattr $C$DW$278, DW_AT_decl_line(0x516)
    4203                            .dwattr $C$DW$278, DW_AT_decl_column(0x1d)
    4204                    
    4205                    $C$DW$279       .dwtag  DW_TAG_member
    4206                            .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$3)
    4207                            .dwattr $C$DW$279, DW_AT_name("pClientEventCb")
    4208                            .dwattr $C$DW$279, DW_AT_TI_symbol_name("pClientEventCb")
    4209                            .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4210                            .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    4211                            .dwattr $C$DW$279, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    4212                            .dwattr $C$DW$279, DW_AT_decl_line(0x517)
    4213                            .dwattr $C$DW$279, DW_AT_decl_column(0x1d)
    4214                    
    4215                    $C$DW$280       .dwtag  DW_TAG_member
    4216                            .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$54)
    4217                            .dwattr $C$DW$280, DW_AT_name("nClientEventMask")
    4218                            .dwattr $C$DW$280, DW_AT_TI_symbol_name("nClientEventMask")
    4219                            .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4220                            .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    4221                            .dwattr $C$DW$280, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    4222                            .dwattr $C$DW$280, DW_AT_decl_line(0x518)
    4223                            .dwattr $C$DW$280, DW_AT_decl_column(0x1d)
    4224                    
    4225                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/
    4226                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x50d)
    4227                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x0c)
    4228                            .dwendtag $C$DW$T$55
    4229                    
    4230                    
    4231                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    4232                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x01)
    4233                    $C$DW$281       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{44585F17-F0A3-4DEF-AFE8-887A5AB383A5} PAGE   78

    4234                            .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$22)
    4235                            .dwattr $C$DW$281, DW_AT_name("triggerType")
    4236                            .dwattr $C$DW$281, DW_AT_TI_symbol_name("triggerType")
    4237                            .dwattr $C$DW$281, DW_AT_bit_offset(0x04)
    4238                            .dwattr $C$DW$281, DW_AT_bit_size(0x04)
    4239                            .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4240                            .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    4241                            .dwattr $C$DW$281, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    4242                            .dwattr $C$DW$281, DW_AT_decl_line(0xee)
    4243                            .dwattr $C$DW$281, DW_AT_decl_column(0x0f)
    4244                    
    4245                    $C$DW$282       .dwtag  DW_TAG_member
    4246                            .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$22)
    4247                            .dwattr $C$DW$282, DW_AT_name("bEnaCmd")
    4248                            .dwattr $C$DW$282, DW_AT_TI_symbol_name("bEnaCmd")
    4249                            .dwattr $C$DW$282, DW_AT_bit_offset(0x03)
    4250                            .dwattr $C$DW$282, DW_AT_bit_size(0x01)
    4251                            .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4252                            .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    4253                            .dwattr $C$DW$282, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    4254                            .dwattr $C$DW$282, DW_AT_decl_line(0xef)
    4255                            .dwattr $C$DW$282, DW_AT_decl_column(0x0f)
    4256                    
    4257                    $C$DW$283       .dwtag  DW_TAG_member
    4258                            .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$22)
    4259                            .dwattr $C$DW$283, DW_AT_name("triggerNo")
    4260                            .dwattr $C$DW$283, DW_AT_TI_symbol_name("triggerNo")
    4261                            .dwattr $C$DW$283, DW_AT_bit_offset(0x01)
    4262                            .dwattr $C$DW$283, DW_AT_bit_size(0x02)
    4263                            .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4264                            .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    4265                            .dwattr $C$DW$283, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    4266                            .dwattr $C$DW$283, DW_AT_decl_line(0xf1)
    4267                            .dwattr $C$DW$283, DW_AT_decl_column(0x0f)
    4268                    
    4269                    $C$DW$284       .dwtag  DW_TAG_member
    4270                            .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$22)
    4271                            .dwattr $C$DW$284, DW_AT_name("pastTrig")
    4272                            .dwattr $C$DW$284, DW_AT_TI_symbol_name("pastTrig")
    4273                            .dwattr $C$DW$284, DW_AT_bit_offset(0x00)
    4274                            .dwattr $C$DW$284, DW_AT_bit_size(0x01)
    4275                            .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4276                            .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    4277                            .dwattr $C$DW$284, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    4278                            .dwattr $C$DW$284, DW_AT_decl_line(0xf2)
    4279                            .dwattr $C$DW$284, DW_AT_decl_column(0x0f)
    4280                    
    4281                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    4282                            .dwattr $C$DW$T$56, DW_AT_decl_line(0xed)
    4283                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x0b)
    4284                            .dwendtag $C$DW$T$56
    4285                    
    4286                    
    4287                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
    4288                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x01)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{44585F17-F0A3-4DEF-AFE8-887A5AB383A5} PAGE   79

    4289                    $C$DW$285       .dwtag  DW_TAG_member
