TI ARM Assembler PC v18.1.2 Thu Nov 15 15:14:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{C21975A2-F5E9-4E6C-B1AA-FAD658E17ED5} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.2.LTS *
       3                    ;* Date/Time created: Thu Nov 15 15:14:59 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/HighLevel/hmac_global.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("D:\code\collector_cc1310lp\collector_cc1310lp")
      13                            .global macBeaconCoordAction1
      14                            .common macBeaconCoordAction1,8,4

    5807                            .dwattr $C$DW$496, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    5808                            .dwattr $C$DW$496, DW_AT_decl_line(0x5e6)
    5809                            .dwattr $C$DW$496, DW_AT_decl_column(0x05)
    5810                    
    5811                    $C$DW$497       .dwtag  DW_TAG_enumerator
    5812                            .dwattr $C$DW$497, DW_AT_name("RF_AllowDelayAny")
    5813                            .dwattr $C$DW$497, DW_AT_const_value(-1)
    5814                            .dwattr $C$DW$497, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    5815                            .dwattr $C$DW$497, DW_AT_decl_line(0x5e7)
    5816                            .dwattr $C$DW$497, DW_AT_decl_column(0x05)
    5817                    
    5818                            .dwattr $C$DW$T$1116, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/driver
    5819                            .dwattr $C$DW$T$1116, DW_AT_decl_line(0x5e5)
    5820                            .dwattr $C$DW$T$1116, DW_AT_decl_column(0x0e)
    5821                            .dwendtag $C$DW$T$1116
    5822                    
    5823                    $C$DW$T$1117    .dwtag  DW_TAG_typedef
    5824                            .dwattr $C$DW$T$1117, DW_AT_name("RF_AllowDelay")
    5825                            .dwattr $C$DW$T$1117, DW_AT_type(*$C$DW$T$1116)
    5826                            .dwattr $C$DW$T$1117, DW_AT_language(DW_LANG_C)
    5827                            .dwattr $C$DW$T$1117, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/driver
    5828                            .dwattr $C$DW$T$1117, DW_AT_decl_line(0x5e8)
    5829                            .dwattr $C$DW$T$1117, DW_AT_decl_column(0x03)
    5830                    
TI ARM Assembler PC v18.1.2 Thu Nov 15 15:14:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{C21975A2-F5E9-4E6C-B1AA-FAD658E17ED5} PAGE  107

    5831                    
    5832                    $C$DW$T$1118    .dwtag  DW_TAG_enumeration_type
    5833                            .dwattr $C$DW$T$1118, DW_AT_byte_size(0x01)
    5834                    $C$DW$498       .dwtag  DW_TAG_enumerator
    5835                            .dwattr $C$DW$498, DW_AT_name("RF_RatChannelAny")
    5836                            .dwattr $C$DW$498, DW_AT_const_value(-1)
    5837                            .dwattr $C$DW$498, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    5838                            .dwattr $C$DW$498, DW_AT_decl_line(0x608)
    5839                            .dwattr $C$DW$498, DW_AT_decl_column(0x05)
    5840                    
    5841                    $C$DW$499       .dwtag  DW_TAG_enumerator
    5842                            .dwattr $C$DW$499, DW_AT_name("RF_RatChannel0")
    5843                            .dwattr $C$DW$499, DW_AT_const_value(0x00)
    5844                            .dwattr $C$DW$499, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    5845                            .dwattr $C$DW$499, DW_AT_decl_line(0x609)
    5846                            .dwattr $C$DW$499, DW_AT_decl_column(0x05)
    5847                    
    5848                    $C$DW$500       .dwtag  DW_TAG_enumerator
    5849                            .dwattr $C$DW$500, DW_AT_name("RF_RatChannel1")
    5850                            .dwattr $C$DW$500, DW_AT_const_value(0x01)
    5851                            .dwattr $C$DW$500, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    5852                            .dwattr $C$DW$500, DW_AT_decl_line(0x60a)
    5853                            .dwattr $C$DW$500, DW_AT_decl_column(0x05)
    5854                    
    5855                    $C$DW$501       .dwtag  DW_TAG_enumerator
    5856                            .dwattr $C$DW$501, DW_AT_name("RF_RatChannel2")
    5857                            .dwattr $C$DW$501, DW_AT_const_value(0x02)
    5858                            .dwattr $C$DW$501, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    5859                            .dwattr $C$DW$501, DW_AT_decl_line(0x60b)
    5860                            .dwattr $C$DW$501, DW_AT_decl_column(0x05)
    5861                    
    5862                            .dwattr $C$DW$T$1118, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/driver
    5863                            .dwattr $C$DW$T$1118, DW_AT_decl_line(0x607)
    5864                            .dwattr $C$DW$T$1118, DW_AT_decl_column(0x0e)
    5865                            .dwendtag $C$DW$T$1118
    5866                    
    5867                    $C$DW$T$1119    .dwtag  DW_TAG_typedef
    5868                            .dwattr $C$DW$T$1119, DW_AT_name("RF_RatSelectChannel")
    5869                            .dwattr $C$DW$T$1119, DW_AT_type(*$C$DW$T$1118)
    5870                            .dwattr $C$DW$T$1119, DW_AT_language(DW_LANG_C)
    5871                            .dwattr $C$DW$T$1119, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/driver
    5872                            .dwattr $C$DW$T$1119, DW_AT_decl_line(0x60c)
    5873                            .dwattr $C$DW$T$1119, DW_AT_decl_column(0x03)
    5874                    
    5875                    
    5876                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    5877                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    5878                    $C$DW$502       .dwtag  DW_TAG_member
    5879                            .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$21)
    5880                            .dwattr $C$DW$502, DW_AT_name("event")
    5881                            .dwattr $C$DW$502, DW_AT_TI_symbol_name("event")
    5882                            .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5883                            .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    5884                            .dwattr $C$DW$502, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    5885                            .dwattr $C$DW$502, DW_AT_decl_line(0x2b6)
TI ARM Assembler PC v18.1.2 Thu Nov 15 15:14:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{C21975A2-F5E9-4E6C-B1AA-FAD658E17ED5} PAGE  108

    5886                            .dwattr $C$DW$502, DW_AT_decl_column(0x0b)
    5887                    
    5888                    $C$DW$503       .dwtag  DW_TAG_member
    5889                            .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$21)
    5890                            .dwattr $C$DW$503, DW_AT_name("status")
    5891                            .dwattr $C$DW$503, DW_AT_TI_symbol_name("status")
    5892                            .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5893                            .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    5894                            .dwattr $C$DW$503, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    5895                            .dwattr $C$DW$503, DW_AT_decl_line(0x2b7)
    5896                            .dwattr $C$DW$503, DW_AT_decl_column(0x0b)
    5897                    
    5898                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    5899                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x2b5)
    5900                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x01)
    5901                            .dwendtag $C$DW$T$22
    5902                    
    5903                    $C$DW$T$38      .dwtag  DW_TAG_typedef
    5904                            .dwattr $C$DW$T$38, DW_AT_name("macEventHdr_t")
    5905                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$22)
    5906                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    5907                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    5908                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x2b8)
    5909                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x03)
    5910                    
    5911                    
    5912                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    5913                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x0a)
    5914                    $C$DW$504       .dwtag  DW_TAG_member
    5915                            .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$475)
    5916                            .dwattr $C$DW$504, DW_AT_name("addr")
    5917                            .dwattr $C$DW$504, DW_AT_TI_symbol_name("addr")
    5918                            .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5919                            .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    5920                            .dwattr $C$DW$504, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/api_mac.h")
    5921                            .dwattr $C$DW$504, DW_AT_decl_line(0x4db)
    5922                            .dwattr $C$DW$504, DW_AT_decl_column(0x07)
    5923                    
    5924                    $C$DW$505       .dwtag  DW_TAG_member
    5925                            .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$24)
    5926                            .dwattr $C$DW$505, DW_AT_name("addrMode")
    5927                            .dwattr $C$DW$505, DW_AT_TI_symbol_name("addrMode")
    5928                            .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5929                            .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    5930                            .dwattr $C$DW$505, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/api_mac.h")
    5931                            .dwattr $C$DW$505, DW_AT_decl_line(0x4de)
    5932                            .dwattr $C$DW$505, DW_AT_decl_column(0x17)
    5933                    
    5934                            .dwattr $C$DW$T$25, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/api_mac.h")
    5935                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x4d0)
    5936                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    5937                            .dwendtag $C$DW$T$25
    5938                    
    5939                    $C$DW$T$706     .dwtag  DW_TAG_typedef
    5940                            .dwattr $C$DW$T$706, DW_AT_name("ApiMac_sAddr_t")
TI ARM Assembler PC v18.1.2 Thu Nov 15 15:14:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{C21975A2-F5E9-4E6C-B1AA-FAD658E17ED5} PAGE  109

    5941                            .dwattr $C$DW$T$706, DW_AT_type(*$C$DW$T$25)
    5942                            .dwattr $C$DW$T$706, DW_AT_language(DW_LANG_C)
    5943                            .dwattr $C$DW$T$706, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/api_mac.h")
    5944                            .dwattr $C$DW$T$706, DW_AT_decl_line(0x4df)
    5945                            .dwattr $C$DW$T$706, DW_AT_decl_column(0x03)
    5946                    
    5947                    
    5948                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    5949                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x0a)
    5950                    $C$DW$506       .dwtag  DW_TAG_member
    5951                            .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$476)
    5952                            .dwattr $C$DW$506, DW_AT_name("addr")
    5953                            .dwattr $C$DW$506, DW_AT_TI_symbol_name("addr")
    5954                            .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5955                            .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    5956                            .dwattr $C$DW$506, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/Services/saddr.h")
    5957                            .dwattr $C$DW$506, DW_AT_decl_line(0x55)
    5958                            .dwattr $C$DW$506, DW_AT_decl_column(0x05)
    5959                    
    5960                    $C$DW$507       .dwtag  DW_TAG_member
    5961                            .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$27)
    5962                            .dwattr $C$DW$507, DW_AT_name("addrMode")
    5963                            .dwattr $C$DW$507, DW_AT_TI_symbol_name("addrMode")
    5964                            .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5965                            .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    5966                            .dwattr $C$DW$507, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/Services/saddr.h")
    5967                            .dwattr $C$DW$507, DW_AT_decl_line(0x56)
    5968                            .dwattr $C$DW$507, DW_AT_decl_column(0x13)
    5969                    
    5970                            .dwattr $C$DW$T$28, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/Services/saddr.h")
    5971                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x50)
    5972                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x01)
    5973                            .dwendtag $C$DW$T$28
    5974                    
    5975                    $C$DW$T$29      .dwtag  DW_TAG_typedef
    5976                            .dwattr $C$DW$T$29, DW_AT_name("sAddr_t")
    5977                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    5978                            .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    5979                            .dwattr $C$DW$T$29, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/Services/saddr.h")
    5980                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x57)
    5981                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x03)
    5982                    
    5983                    
    5984                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    5985                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x24)
    5986                    $C$DW$508       .dwtag  DW_TAG_member
    5987                            .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$29)
    5988                            .dwattr $C$DW$508, DW_AT_name("coordAddress")
    5989                            .dwattr $C$DW$508, DW_AT_TI_symbol_name("coordAddress")
    5990                            .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5991                            .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    5992                            .dwattr $C$DW$508, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    5993                            .dwattr $C$DW$508, DW_AT_decl_line(0x3e1)
    5994                            .dwattr $C$DW$508, DW_AT_decl_column(0x11)
    5995                    
TI ARM Assembler PC v18.1.2 Thu Nov 15 15:14:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{C21975A2-F5E9-4E6C-B1AA-FAD658E17ED5} PAGE  110

    5996                    $C$DW$509       .dwtag  DW_TAG_member
    5997                            .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$30)
    5998                            .dwattr $C$DW$509, DW_AT_name("coordPanId")
    5999                            .dwattr $C$DW$509, DW_AT_TI_symbol_name("coordPanId")
    6000                            .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6001                            .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    6002                            .dwattr $C$DW$509, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6003                            .dwattr $C$DW$509, DW_AT_decl_line(0x3e2)
    6004                            .dwattr $C$DW$509, DW_AT_decl_column(0x11)
    6005                    
    6006                    $C$DW$510       .dwtag  DW_TAG_member
    6007                            .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$30)
    6008                            .dwattr $C$DW$510, DW_AT_name("superframeSpec")
    6009                            .dwattr $C$DW$510, DW_AT_TI_symbol_name("superframeSpec")
    6010                            .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6011                            .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    6012                            .dwattr $C$DW$510, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6013                            .dwattr $C$DW$510, DW_AT_decl_line(0x3e3)
    6014                            .dwattr $C$DW$510, DW_AT_decl_column(0x11)
    6015                    
    6016                    $C$DW$511       .dwtag  DW_TAG_member
    6017                            .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$21)
    6018                            .dwattr $C$DW$511, DW_AT_name("logicalChannel")
    6019                            .dwattr $C$DW$511, DW_AT_TI_symbol_name("logicalChannel")
    6020                            .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6021                            .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    6022                            .dwattr $C$DW$511, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6023                            .dwattr $C$DW$511, DW_AT_decl_line(0x3e4)
    6024                            .dwattr $C$DW$511, DW_AT_decl_column(0x11)
    6025                    
    6026                    $C$DW$512       .dwtag  DW_TAG_member
    6027                            .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$21)
    6028                            .dwattr $C$DW$512, DW_AT_name("channelPage")
    6029                            .dwattr $C$DW$512, DW_AT_TI_symbol_name("channelPage")
    6030                            .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    6031                            .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    6032                            .dwattr $C$DW$512, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6033                            .dwattr $C$DW$512, DW_AT_decl_line(0x3e5)
    6034                            .dwattr $C$DW$512, DW_AT_decl_column(0x11)
    6035                    
    6036                    $C$DW$513       .dwtag  DW_TAG_member
    6037                            .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$31)
    6038                            .dwattr $C$DW$513, DW_AT_name("gtsPermit")
    6039                            .dwattr $C$DW$513, DW_AT_TI_symbol_name("gtsPermit")
    6040                            .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6041                            .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    6042                            .dwattr $C$DW$513, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6043                            .dwattr $C$DW$513, DW_AT_decl_line(0x3e6)
    6044                            .dwattr $C$DW$513, DW_AT_decl_column(0x11)
    6045                    
    6046                    $C$DW$514       .dwtag  DW_TAG_member
    6047                            .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$21)
    6048                            .dwattr $C$DW$514, DW_AT_name("linkQuality")
    6049                            .dwattr $C$DW$514, DW_AT_TI_symbol_name("linkQuality")
    6050                            .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
TI ARM Assembler PC v18.1.2 Thu Nov 15 15:14:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{C21975A2-F5E9-4E6C-B1AA-FAD658E17ED5} PAGE  111

    6051                            .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    6052                            .dwattr $C$DW$514, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6053                            .dwattr $C$DW$514, DW_AT_decl_line(0x3e7)
    6054                            .dwattr $C$DW$514, DW_AT_decl_column(0x11)
    6055                    
    6056                    $C$DW$515       .dwtag  DW_TAG_member
    6057                            .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$32)
    6058                            .dwattr $C$DW$515, DW_AT_name("timestamp")
    6059                            .dwattr $C$DW$515, DW_AT_TI_symbol_name("timestamp")
    6060                            .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6061                            .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    6062                            .dwattr $C$DW$515, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6063                            .dwattr $C$DW$515, DW_AT_decl_line(0x3e8)
    6064                            .dwattr $C$DW$515, DW_AT_decl_column(0x11)
    6065                    
    6066                    $C$DW$516       .dwtag  DW_TAG_member
    6067                            .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$31)
    6068                            .dwattr $C$DW$516, DW_AT_name("securityFailure")
    6069                            .dwattr $C$DW$516, DW_AT_TI_symbol_name("securityFailure")
    6070                            .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6071                            .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    6072                            .dwattr $C$DW$516, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6073                            .dwattr $C$DW$516, DW_AT_decl_line(0x3e9)
    6074                            .dwattr $C$DW$516, DW_AT_decl_column(0x11)
    6075                    
    6076                    $C$DW$517       .dwtag  DW_TAG_member
    6077                            .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$33)
    6078                            .dwattr $C$DW$517, DW_AT_name("sec")
    6079                            .dwattr $C$DW$517, DW_AT_TI_symbol_name("sec")
    6080                            .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    6081                            .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    6082                            .dwattr $C$DW$517, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6083                            .dwattr $C$DW$517, DW_AT_decl_line(0x3ea)
    6084                            .dwattr $C$DW$517, DW_AT_decl_column(0x11)
    6085                    
    6086                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    6087                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x3e0)
    6088                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x01)
    6089                            .dwendtag $C$DW$T$34
    6090                    
    6091                    $C$DW$T$76      .dwtag  DW_TAG_typedef
    6092                            .dwattr $C$DW$T$76, DW_AT_name("macPanDesc_t")
    6093                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$34)
    6094                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    6095                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    6096                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x3eb)
    6097                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    6098                    
    6099                    $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    6100                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    6101                            .dwattr $C$DW$T$77, DW_AT_address_class(0x20)
    6102                    
    6103                    
    6104                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6105                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x2c)
TI ARM Assembler PC v18.1.2 Thu Nov 15 15:14:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{C21975A2-F5E9-4E6C-B1AA-FAD658E17ED5} PAGE  112

    6106                    $C$DW$518       .dwtag  DW_TAG_member
    6107                            .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$35)
    6108                            .dwattr $C$DW$518, DW_AT_name("scanChannels")
    6109                            .dwattr $C$DW$518, DW_AT_TI_symbol_name("scanChannels")
    6110                            .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6111                            .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    6112                            .dwattr $C$DW$518, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6113                            .dwattr $C$DW$518, DW_AT_decl_line(0x421)
    6114                            .dwattr $C$DW$518, DW_AT_decl_column(0x14)
    6115                    
    6116                    $C$DW$519       .dwtag  DW_TAG_member
    6117                            .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$21)
    6118                            .dwattr $C$DW$519, DW_AT_name("scanType")
    6119                            .dwattr $C$DW$519, DW_AT_TI_symbol_name("scanType")
    6120                            .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6121                            .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    6122                            .dwattr $C$DW$519, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6123                            .dwattr $C$DW$519, DW_AT_decl_line(0x422)
    6124                            .dwattr $C$DW$519, DW_AT_decl_column(0x14)
    6125                    
    6126                    $C$DW$520       .dwtag  DW_TAG_member
    6127                            .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$21)
    6128                            .dwattr $C$DW$520, DW_AT_name("scanDuration")
    6129                            .dwattr $C$DW$520, DW_AT_TI_symbol_name("scanDuration")
    6130                            .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6131                            .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    6132                            .dwattr $C$DW$520, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6133                            .dwattr $C$DW$520, DW_AT_decl_line(0x423)
    6134                            .dwattr $C$DW$520, DW_AT_decl_column(0x14)
    6135                    
    6136                    $C$DW$521       .dwtag  DW_TAG_member
    6137                            .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$21)
    6138                            .dwattr $C$DW$521, DW_AT_name("channelPage")
    6139                            .dwattr $C$DW$521, DW_AT_TI_symbol_name("channelPage")
    6140                            .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    6141                            .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    6142                            .dwattr $C$DW$521, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6143                            .dwattr $C$DW$521, DW_AT_decl_line(0x424)
    6144                            .dwattr $C$DW$521, DW_AT_decl_column(0x14)
    6145                    
    6146                    $C$DW$522       .dwtag  DW_TAG_member
    6147                            .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$21)
    6148                            .dwattr $C$DW$522, DW_AT_name("phyID")
    6149                            .dwattr $C$DW$522, DW_AT_TI_symbol_name("phyID")
    6150                            .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6151                            .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    6152                            .dwattr $C$DW$522, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6153                            .dwattr $C$DW$522, DW_AT_decl_line(0x425)
    6154                            .dwattr $C$DW$522, DW_AT_decl_column(0x14)
    6155                    
    6156                    $C$DW$523       .dwtag  DW_TAG_member
    6157                            .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$21)
    6158                            .dwattr $C$DW$523, DW_AT_name("maxResults")
    6159                            .dwattr $C$DW$523, DW_AT_TI_symbol_name("maxResults")
    6160                            .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
TI ARM Assembler PC v18.1.2 Thu Nov 15 15:14:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{C21975A2-F5E9-4E6C-B1AA-FAD658E17ED5} PAGE  113

    6161                            .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    6162                            .dwattr $C$DW$523, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6163                            .dwattr $C$DW$523, DW_AT_decl_line(0x426)
    6164                            .dwattr $C$DW$523, DW_AT_decl_column(0x14)
    6165                    
    6166                    $C$DW$524       .dwtag  DW_TAG_member
    6167                            .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$31)
    6168                            .dwattr $C$DW$524, DW_AT_name("permitJoining")
    6169                            .dwattr $C$DW$524, DW_AT_TI_symbol_name("permitJoining")
    6170                            .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6171                            .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    6172                            .dwattr $C$DW$524, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6173                            .dwattr $C$DW$524, DW_AT_decl_line(0x427)
    6174                            .dwattr $C$DW$524, DW_AT_decl_column(0x14)
    6175                    
    6176                    $C$DW$525       .dwtag  DW_TAG_member
    6177                            .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$21)
    6178                            .dwattr $C$DW$525, DW_AT_name("linkQuality")
    6179                            .dwattr $C$DW$525, DW_AT_TI_symbol_name("linkQuality")
    6180                            .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    6181                            .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    6182                            .dwattr $C$DW$525, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6183                            .dwattr $C$DW$525, DW_AT_decl_line(0x429)
    6184                            .dwattr $C$DW$525, DW_AT_decl_column(0x14)
    6185                    
    6186                    $C$DW$526       .dwtag  DW_TAG_member
    6187                            .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$21)
    6188                            .dwattr $C$DW$526, DW_AT_name("percentFilter")
    6189                            .dwattr $C$DW$526, DW_AT_TI_symbol_name("percentFilter")
    6190                            .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6191                            .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    6192                            .dwattr $C$DW$526, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6193                            .dwattr $C$DW$526, DW_AT_decl_line(0x42b)
    6194                            .dwattr $C$DW$526, DW_AT_decl_column(0x14)
    6195                    
    6196                    $C$DW$527       .dwtag  DW_TAG_member
    6197                            .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$33)
    6198                            .dwattr $C$DW$527, DW_AT_name("sec")
    6199                            .dwattr $C$DW$527, DW_AT_TI_symbol_name("sec")
    6200                            .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    6201                            .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    6202                            .dwattr $C$DW$527, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6203                            .dwattr $C$DW$527, DW_AT_decl_line(0x42e)
    6204                            .dwattr $C$DW$527, DW_AT_decl_column(0x14)
    6205                    
    6206                    $C$DW$528       .dwtag  DW_TAG_member
    6207                            .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$31)
    6208                            .dwattr $C$DW$528, DW_AT_name("MPMScan")
    6209                            .dwattr $C$DW$528, DW_AT_TI_symbol_name("MPMScan")
    6210                            .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6211                            .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    6212                            .dwattr $C$DW$528, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6213                            .dwattr $C$DW$528, DW_AT_decl_line(0x42f)
    6214                            .dwattr $C$DW$528, DW_AT_decl_column(0x14)
    6215                    
TI ARM Assembler PC v18.1.2 Thu Nov 15 15:14:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{C21975A2-F5E9-4E6C-B1AA-FAD658E17ED5} PAGE  114

    6216                    $C$DW$529       .dwtag  DW_TAG_member
    6217                            .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$21)
    6218                            .dwattr $C$DW$529, DW_AT_name("MPMScanType")
    6219                            .dwattr $C$DW$529, DW_AT_TI_symbol_name("MPMScanType")
    6220                            .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    6221                            .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    6222                            .dwattr $C$DW$529, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6223                            .dwattr $C$DW$529, DW_AT_decl_line(0x431)
    6224                            .dwattr $C$DW$529, DW_AT_decl_column(0x14)
    6225                    
    6226                    $C$DW$530       .dwtag  DW_TAG_member
    6227                            .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$30)
    6228                            .dwattr $C$DW$530, DW_AT_name("MPMScanDuration")
    6229                            .dwattr $C$DW$530, DW_AT_TI_symbol_name("MPMScanDuration")
    6230                            .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    6231                            .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    6232                            .dwattr $C$DW$530, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6233                            .dwattr $C$DW$530, DW_AT_decl_line(0x432)
    6234                            .dwattr $C$DW$530, DW_AT_decl_column(0x14)
    6235                    
    6236                    $C$DW$531       .dwtag  DW_TAG_member
    6237                            .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$477)
    6238                            .dwattr $C$DW$531, DW_AT_name("result")
    6239                            .dwattr $C$DW$531, DW_AT_TI_symbol_name("result")
    6240                            .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6241                            .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    6242                            .dwattr $C$DW$531, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6243                            .dwattr $C$DW$531, DW_AT_decl_line(0x440)
    6244                            .dwattr $C$DW$531, DW_AT_decl_column(0x05)
    6245                    
    6246                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    6247                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x420)
    6248                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    6249                            .dwendtag $C$DW$T$36
    6250                    
    6251                    $C$DW$T$479     .dwtag  DW_TAG_typedef
    6252                            .dwattr $C$DW$T$479, DW_AT_name("macMlmeScanReq_t")
    6253                            .dwattr $C$DW$T$479, DW_AT_type(*$C$DW$T$36)
    6254                            .dwattr $C$DW$T$479, DW_AT_language(DW_LANG_C)
    6255                            .dwattr $C$DW$T$479, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154st
    6256                            .dwattr $C$DW$T$479, DW_AT_decl_line(0x441)
    6257                            .dwattr $C$DW$T$479, DW_AT_decl_column(0x03)
    6258                    
    6259                    
    6260                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    6261                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    6262                    $C$DW$532       .dwtag  DW_TAG_member
    6263                            .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$21)
    6264                            .dwattr $C$DW$532, DW_AT_name("msduHandle")
    6265                            .dwattr $C$DW$532, DW_AT_TI_symbol_name("msduHandle")
    6266                            .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6267                            .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    6268                            .dwattr $C$DW$532, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6269                            .dwattr $C$DW$532, DW_AT_decl_line(0x160)
    6270                            .dwattr $C$DW$532, DW_AT_decl_column(0x1f)
TI ARM Assembler PC v18.1.2 Thu Nov 15 15:14:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{C21975A2-F5E9-4E6C-B1AA-FAD658E17ED5} PAGE  115

    6271                    
    6272                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    6273                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x15f)
    6274                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    6275                            .dwendtag $C$DW$T$37
    6276                    
    6277                    $C$DW$T$482     .dwtag  DW_TAG_typedef
    6278                            .dwattr $C$DW$T$482, DW_AT_name("macMcpsPurgeReq_t")
    6279                            .dwattr $C$DW$T$482, DW_AT_type(*$C$DW$T$37)
    6280                            .dwattr $C$DW$T$482, DW_AT_language(DW_LANG_C)
    6281                            .dwattr $C$DW$T$482, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154st
    6282                            .dwattr $C$DW$T$482, DW_AT_decl_line(0x161)
    6283                            .dwattr $C$DW$T$482, DW_AT_decl_column(0x03)
    6284                    
    6285                    
    6286                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6287                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x38)
    6288                    $C$DW$533       .dwtag  DW_TAG_member
    6289                            .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$38)
    6290                            .dwattr $C$DW$533, DW_AT_name("hdr")
    6291                            .dwattr $C$DW$533, DW_AT_TI_symbol_name("hdr")
    6292                            .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6293                            .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    6294                            .dwattr $C$DW$533, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6295                            .dwattr $C$DW$533, DW_AT_decl_line(0x167)
    6296                            .dwattr $C$DW$533, DW_AT_decl_column(0x1f)
    6297                    
    6298                    $C$DW$534       .dwtag  DW_TAG_member
    6299                            .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$483)
    6300                            .dwattr $C$DW$534, DW_AT_name("mac")
    6301                            .dwattr $C$DW$534, DW_AT_TI_symbol_name("mac")
    6302                            .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6303                            .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    6304                            .dwattr $C$DW$534, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6305                            .dwattr $C$DW$534, DW_AT_decl_line(0x170)
    6306                            .dwattr $C$DW$534, DW_AT_decl_column(0x05)
    6307                    
    6308                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    6309                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x166)
    6310                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    6311                            .dwendtag $C$DW$T$39
    6312                    
    6313                    $C$DW$T$495     .dwtag  DW_TAG_typedef
    6314                            .dwattr $C$DW$T$495, DW_AT_name("macApiEvent_t")
    6315                            .dwattr $C$DW$T$495, DW_AT_type(*$C$DW$T$39)
    6316                            .dwattr $C$DW$T$495, DW_AT_language(DW_LANG_C)
    6317                            .dwattr $C$DW$T$495, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154st
    6318                            .dwattr $C$DW$T$495, DW_AT_decl_line(0x171)
    6319                            .dwattr $C$DW$T$495, DW_AT_decl_column(0x03)
    6320                    
    6321                    
    6322                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6323                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x08)
    6324                    $C$DW$535       .dwtag  DW_TAG_member
    6325                            .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$40)
TI ARM Assembler PC v18.1.2 Thu Nov 15 15:14:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{C21975A2-F5E9-4E6C-B1AA-FAD658E17ED5} PAGE  116

    6326                            .dwattr $C$DW$535, DW_AT_name("p")
    6327                            .dwattr $C$DW$535, DW_AT_TI_symbol_name("p")
    6328                            .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6329                            .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    6330                            .dwattr $C$DW$535, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/Services/sdata.h")
    6331                            .dwattr $C$DW$535, DW_AT_decl_line(0x3d)
    6332                            .dwattr $C$DW$535, DW_AT_decl_column(0x0e)
    6333                    
    6334                    $C$DW$536       .dwtag  DW_TAG_member
    6335                            .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$30)
    6336                            .dwattr $C$DW$536, DW_AT_name("len")
    6337                            .dwattr $C$DW$536, DW_AT_TI_symbol_name("len")
    6338                            .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6339                            .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    6340                            .dwattr $C$DW$536, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/Services/sdata.h")
    6341                            .dwattr $C$DW$536, DW_AT_decl_line(0x3e)
    6342                            .dwattr $C$DW$536, DW_AT_decl_column(0x0e)
    6343                    
    6344                            .dwattr $C$DW$T$41, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/Services/sdata.h")
    6345                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x3c)
    6346                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    6347                            .dwendtag $C$DW$T$41
    6348                    
    6349                    $C$DW$T$62      .dwtag  DW_TAG_typedef
    6350                            .dwattr $C$DW$T$62, DW_AT_name("sData_t")
    6351                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$41)
    6352                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    6353                            .dwattr $C$DW$T$62, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/Services/sdata.h")
    6354                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x3f)
    6355                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    6356                    
    6357                    
    6358                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    6359                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x0a)
    6360                    $C$DW$537       .dwtag  DW_TAG_member
    6361                            .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$42)
    6362                            .dwattr $C$DW$537, DW_AT_name("lookupData")
    6363                            .dwattr $C$DW$537, DW_AT_TI_symbol_name("lookupData")
    6364                            .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6365                            .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    6366                            .dwattr $C$DW$537, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6367                            .dwattr $C$DW$537, DW_AT_decl_line(0x2c6)
    6368                            .dwattr $C$DW$537, DW_AT_decl_column(0x16)
    6369                    
    6370                    $C$DW$538       .dwtag  DW_TAG_member
    6371                            .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$21)
    6372                            .dwattr $C$DW$538, DW_AT_name("lookupDataSize")
    6373                            .dwattr $C$DW$538, DW_AT_TI_symbol_name("lookupDataSize")
    6374                            .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6375                            .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    6376                            .dwattr $C$DW$538, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6377                            .dwattr $C$DW$538, DW_AT_decl_line(0x2c7)
    6378                            .dwattr $C$DW$538, DW_AT_decl_column(0x16)
    6379                    
    6380                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
TI ARM Assembler PC v18.1.2 Thu Nov 15 15:14:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{C21975A2-F5E9-4E6C-B1AA-FAD658E17ED5} PAGE  117

    6381                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x2c5)
    6382                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x01)
    6383                            .dwendtag $C$DW$T$43
    6384                    
    6385                    $C$DW$T$46      .dwtag  DW_TAG_typedef
    6386                            .dwattr $C$DW$T$46, DW_AT_name("keyIdLookupDescriptor_t")
    6387                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$43)
    6388                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    6389                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    6390                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x2c8)
    6391                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x03)
    6392                    
    6393                    $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    6394                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    6395                            .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    6396                    
    6397                    
    6398                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    6399                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
    6400                    $C$DW$539       .dwtag  DW_TAG_member
    6401                            .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$30)
    6402                            .dwattr $C$DW$539, DW_AT_name("deviceDescriptorHandle")
    6403                            .dwattr $C$DW$539, DW_AT_TI_symbol_name("deviceDescriptorHandle")
    6404                            .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6405                            .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    6406                            .dwattr $C$DW$539, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6407                            .dwattr $C$DW$539, DW_AT_decl_line(0x2cd)
    6408                            .dwattr $C$DW$539, DW_AT_decl_column(0x16)
    6409                    
    6410                    $C$DW$540       .dwtag  DW_TAG_member
    6411                            .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$31)
    6412                            .dwattr $C$DW$540, DW_AT_name("uniqueDevice")
    6413                            .dwattr $C$DW$540, DW_AT_TI_symbol_name("uniqueDevice")
    6414                            .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6415                            .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    6416                            .dwattr $C$DW$540, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6417                            .dwattr $C$DW$540, DW_AT_decl_line(0x2ce)
    6418                            .dwattr $C$DW$540, DW_AT_decl_column(0x16)
    6419                    
    6420                    $C$DW$541       .dwtag  DW_TAG_member
    6421                            .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$31)
    6422                            .dwattr $C$DW$541, DW_AT_name("blackListed")
    6423                            .dwattr $C$DW$541, DW_AT_TI_symbol_name("blackListed")
    6424                            .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6425                            .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    6426                            .dwattr $C$DW$541, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6427                            .dwattr $C$DW$541, DW_AT_decl_line(0x2cf)
    6428                            .dwattr $C$DW$541, DW_AT_decl_column(0x16)
    6429                    
    6430                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    6431                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x2cc)
    6432                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    6433                            .dwendtag $C$DW$T$44
    6434                    
    6435                    $C$DW$T$48      .dwtag  DW_TAG_typedef
TI ARM Assembler PC v18.1.2 Thu Nov 15 15:14:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{C21975A2-F5E9-4E6C-B1AA-FAD658E17ED5} PAGE  118

    6436                            .dwattr $C$DW$T$48, DW_AT_name("keyDeviceDescriptor_t")
    6437                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$44)
    6438                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    6439                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    6440                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x2d0)
    6441                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x03)
    6442                    
    6443                    $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    6444                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    6445                            .dwattr $C$DW$T$49, DW_AT_address_class(0x20)
    6446                    
    6447                    
    6448                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    6449                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    6450                    $C$DW$542       .dwtag  DW_TAG_member
    6451                            .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$21)
    6452                            .dwattr $C$DW$542, DW_AT_name("frameType")
    6453                            .dwattr $C$DW$542, DW_AT_TI_symbol_name("frameType")
    6454                            .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6455                            .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    6456                            .dwattr $C$DW$542, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6457                            .dwattr $C$DW$542, DW_AT_decl_line(0x2d5)
    6458                            .dwattr $C$DW$542, DW_AT_decl_column(0x16)
    6459                    
    6460                    $C$DW$543       .dwtag  DW_TAG_member
    6461                            .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$21)
    6462                            .dwattr $C$DW$543, DW_AT_name("cmdFrameId")
    6463                            .dwattr $C$DW$543, DW_AT_TI_symbol_name("cmdFrameId")
    6464                            .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6465                            .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    6466                            .dwattr $C$DW$543, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6467                            .dwattr $C$DW$543, DW_AT_decl_line(0x2d6)
    6468                            .dwattr $C$DW$543, DW_AT_decl_column(0x16)
    6469                    
    6470                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    6471                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x2d4)
    6472                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x01)
    6473                            .dwendtag $C$DW$T$45
    6474                    
    6475                    $C$DW$T$50      .dwtag  DW_TAG_typedef
    6476                            .dwattr $C$DW$T$50, DW_AT_name("keyUsageDescriptor_t")
    6477                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$45)
    6478                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    6479                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    6480                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2d7)
    6481                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x03)
    6482                    
    6483                    $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    6484                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    6485                            .dwattr $C$DW$T$51, DW_AT_address_class(0x20)
    6486                    
    6487                    
    6488                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    6489                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x2c)
    6490                    $C$DW$544       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.2 Thu Nov 15 15:14:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{C21975A2-F5E9-4E6C-B1AA-FAD658E17ED5} PAGE  119

    6491                            .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$47)
    6492                            .dwattr $C$DW$544, DW_AT_name("keyIdLookupList")
    6493                            .dwattr $C$DW$544, DW_AT_TI_symbol_name("keyIdLookupList")
    6494                            .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6495                            .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    6496                            .dwattr $C$DW$544, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6497                            .dwattr $C$DW$544, DW_AT_decl_line(0x2dc)
    6498                            .dwattr $C$DW$544, DW_AT_decl_column(0x1d)
    6499                    
    6500                    $C$DW$545       .dwtag  DW_TAG_member
    6501                            .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$21)
    6502                            .dwattr $C$DW$545, DW_AT_name("keyIdLookupEntries")
    6503                            .dwattr $C$DW$545, DW_AT_TI_symbol_name("keyIdLookupEntries")
    6504                            .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6505                            .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    6506                            .dwattr $C$DW$545, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6507                            .dwattr $C$DW$545, DW_AT_decl_line(0x2dd)
    6508                            .dwattr $C$DW$545, DW_AT_decl_column(0x1c)
    6509                    
    6510                    $C$DW$546       .dwtag  DW_TAG_member
    6511                            .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$49)
    6512                            .dwattr $C$DW$546, DW_AT_name("keyDeviceList")
    6513                            .dwattr $C$DW$546, DW_AT_TI_symbol_name("keyDeviceList")
    6514                            .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6515                            .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    6516                            .dwattr $C$DW$546, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6517                            .dwattr $C$DW$546, DW_AT_decl_line(0x2df)
    6518                            .dwattr $C$DW$546, DW_AT_decl_column(0x1d)
    6519                    
    6520                    $C$DW$547       .dwtag  DW_TAG_member
    6521                            .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$30)
    6522                            .dwattr $C$DW$547, DW_AT_name("keyDeviceListEntries")
    6523                            .dwattr $C$DW$547, DW_AT_TI_symbol_name("keyDeviceListEntries")
    6524                            .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6525                            .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    6526                            .dwattr $C$DW$547, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6527                            .dwattr $C$DW$547, DW_AT_decl_line(0x2e2)
    6528                            .dwattr $C$DW$547, DW_AT_decl_column(0x1d)
    6529                    
    6530                    $C$DW$548       .dwtag  DW_TAG_member
    6531                            .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$51)
    6532                            .dwattr $C$DW$548, DW_AT_name("keyUsageList")
    6533                            .dwattr $C$DW$548, DW_AT_TI_symbol_name("keyUsageList")
    6534                            .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6535                            .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    6536                            .dwattr $C$DW$548, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6537                            .dwattr $C$DW$548, DW_AT_decl_line(0x2e4)
    6538                            .dwattr $C$DW$548, DW_AT_decl_column(0x1d)
    6539                    
    6540                    $C$DW$549       .dwtag  DW_TAG_member
    6541                            .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$21)
    6542                            .dwattr $C$DW$549, DW_AT_name("keyUsageListEntries")
    6543                            .dwattr $C$DW$549, DW_AT_TI_symbol_name("keyUsageListEntries")
    6544                            .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6545                            .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.2 Thu Nov 15 15:14:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{C21975A2-F5E9-4E6C-B1AA-FAD658E17ED5} PAGE  120

    6546                            .dwattr $C$DW$549, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6547                            .dwattr $C$DW$549, DW_AT_decl_line(0x2e6)
    6548                            .dwattr $C$DW$549, DW_AT_decl_column(0x1c)
    6549                    
    6550                    $C$DW$550       .dwtag  DW_TAG_member
    6551                            .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$52)
    6552                            .dwattr $C$DW$550, DW_AT_name("key")
    6553                            .dwattr $C$DW$550, DW_AT_TI_symbol_name("key")
    6554                            .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    6555                            .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    6556                            .dwattr $C$DW$550, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6557                            .dwattr $C$DW$550, DW_AT_decl_line(0x2e8)
    6558                            .dwattr $C$DW$550, DW_AT_decl_column(0x1c)
    6559                    
    6560                    $C$DW$551       .dwtag  DW_TAG_member
    6561                            .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$32)
    6562                            .dwattr $C$DW$551, DW_AT_name("frameCounter")
    6563                            .dwattr $C$DW$551, DW_AT_TI_symbol_name("frameCounter")
    6564                            .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6565                            .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    6566                            .dwattr $C$DW$551, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6567                            .dwattr $C$DW$551, DW_AT_decl_line(0x2e9)
    6568                            .dwattr $C$DW$551, DW_AT_decl_column(0x1c)
    6569                    
    6570                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    6571                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x2db)
    6572                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
    6573                            .dwendtag $C$DW$T$53
    6574                    
    6575                    $C$DW$T$55      .dwtag  DW_TAG_typedef
    6576                            .dwattr $C$DW$T$55, DW_AT_name("keyDescriptor_t")
    6577                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$53)
    6578                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    6579                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    6580                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x2ec)
    6581                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x03)
    6582                    
    6583                    $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    6584                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    6585                            .dwattr $C$DW$T$56, DW_AT_address_class(0x20)
    6586                    
    6587                    
    6588                    $C$DW$T$61      .dwtag  DW_TAG_structure_type
    6589                            .dwattr $C$DW$T$61, DW_AT_byte_size(0x78)
    6590                    $C$DW$552       .dwtag  DW_TAG_member
    6591                            .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$32)
    6592                            .dwattr $C$DW$552, DW_AT_name("timestamp")
    6593                            .dwattr $C$DW$552, DW_AT_TI_symbol_name("timestamp")
    6594                            .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6595                            .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    6596                            .dwattr $C$DW$552, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6597                            .dwattr $C$DW$552, DW_AT_decl_line(0x356)
    6598                            .dwattr $C$DW$552, DW_AT_decl_column(0x19)
    6599                    
    6600                    $C$DW$553       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.2 Thu Nov 15 15:14:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{C21975A2-F5E9-4E6C-B1AA-FAD658E17ED5} PAGE  121

    6601                            .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$30)
    6602                            .dwattr $C$DW$553, DW_AT_name("timestamp2")
    6603                            .dwattr $C$DW$553, DW_AT_TI_symbol_name("timestamp2")
    6604                            .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6605                            .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    6606                            .dwattr $C$DW$553, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6607                            .dwattr $C$DW$553, DW_AT_decl_line(0x357)
    6608                            .dwattr $C$DW$553, DW_AT_decl_column(0x19)
    6609                    
    6610                    $C$DW$554       .dwtag  DW_TAG_member
    6611                            .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$30)
    6612                            .dwattr $C$DW$554, DW_AT_name("timeToLive")
    6613                            .dwattr $C$DW$554, DW_AT_TI_symbol_name("timeToLive")
    6614                            .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6615                            .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    6616                            .dwattr $C$DW$554, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6617                            .dwattr $C$DW$554, DW_AT_decl_line(0x358)
    6618                            .dwattr $C$DW$554, DW_AT_decl_column(0x19)
    6619                    
    6620                    $C$DW$555       .dwtag  DW_TAG_member
    6621                            .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$21)
    6622                            .dwattr $C$DW$555, DW_AT_name("frameType")
    6623                            .dwattr $C$DW$555, DW_AT_TI_symbol_name("frameType")
    6624                            .dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6625                            .dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
    6626                            .dwattr $C$DW$555, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6627                            .dwattr $C$DW$555, DW_AT_decl_line(0x359)
    6628                            .dwattr $C$DW$555, DW_AT_decl_column(0x19)
    6629                    
    6630                    $C$DW$556       .dwtag  DW_TAG_member
    6631                            .dwattr $C$DW$556, DW_AT_type(*$C$DW$T$30)
    6632                            .dwattr $C$DW$556, DW_AT_name("txOptions")
    6633                            .dwattr $C$DW$556, DW_AT_TI_symbol_name("txOptions")
    6634                            .dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6635                            .dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
    6636                            .dwattr $C$DW$556, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6637                            .dwattr $C$DW$556, DW_AT_decl_line(0x35a)
    6638                            .dwattr $C$DW$556, DW_AT_decl_column(0x19)
    6639                    
    6640                    $C$DW$557       .dwtag  DW_TAG_member
    6641                            .dwattr $C$DW$557, DW_AT_type(*$C$DW$T$21)
    6642                            .dwattr $C$DW$557, DW_AT_name("txMode")
    6643                            .dwattr $C$DW$557, DW_AT_TI_symbol_name("txMode")
    6644                            .dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6645                            .dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
    6646                            .dwattr $C$DW$557, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6647                            .dwattr $C$DW$557, DW_AT_decl_line(0x35b)
    6648                            .dwattr $C$DW$557, DW_AT_decl_column(0x19)
    6649                    
    6650                    $C$DW$558       .dwtag  DW_TAG_member
    6651                            .dwattr $C$DW$558, DW_AT_type(*$C$DW$T$21)
    6652                            .dwattr $C$DW$558, DW_AT_name("txSched")
    6653                            .dwattr $C$DW$558, DW_AT_TI_symbol_name("txSched")
    6654                            .dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6655                            .dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.2 Thu Nov 15 15:14:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{C21975A2-F5E9-4E6C-B1AA-FAD658E17ED5} PAGE  122

    6656                            .dwattr $C$DW$558, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6657                            .dwattr $C$DW$558, DW_AT_decl_line(0x35c)
    6658                            .dwattr $C$DW$558, DW_AT_decl_column(0x19)
    6659                    
    6660                    $C$DW$559       .dwtag  DW_TAG_member
    6661                            .dwattr $C$DW$559, DW_AT_type(*$C$DW$T$21)
    6662                            .dwattr $C$DW$559, DW_AT_name("retries")
    6663                            .dwattr $C$DW$559, DW_AT_TI_symbol_name("retries")
    6664                            .dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6665                            .dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
    6666                            .dwattr $C$DW$559, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6667                            .dwattr $C$DW$559, DW_AT_decl_line(0x35d)
    6668                            .dwattr $C$DW$559, DW_AT_decl_column(0x19)
    6669                    
    6670                    $C$DW$560       .dwtag  DW_TAG_member
    6671                            .dwattr $C$DW$560, DW_AT_type(*$C$DW$T$21)
    6672                            .dwattr $C$DW$560, DW_AT_name("channel")
    6673                            .dwattr $C$DW$560, DW_AT_TI_symbol_name("channel")
    6674                            .dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    6675                            .dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
    6676                            .dwattr $C$DW$560, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6677                            .dwattr $C$DW$560, DW_AT_decl_line(0x35e)
    6678                            .dwattr $C$DW$560, DW_AT_decl_column(0x19)
    6679                    
    6680                    $C$DW$561       .dwtag  DW_TAG_member
    6681                            .dwattr $C$DW$561, DW_AT_type(*$C$DW$T$21)
    6682                            .dwattr $C$DW$561, DW_AT_name("power")
    6683                            .dwattr $C$DW$561, DW_AT_TI_symbol_name("power")
    6684                            .dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6685                            .dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
    6686                            .dwattr $C$DW$561, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6687                            .dwattr $C$DW$561, DW_AT_decl_line(0x35f)
    6688                            .dwattr $C$DW$561, DW_AT_decl_column(0x19)
    6689                    
    6690                    $C$DW$562       .dwtag  DW_TAG_member
    6691                            .dwattr $C$DW$562, DW_AT_type(*$C$DW$T$21)
    6692                            .dwattr $C$DW$562, DW_AT_name("mpduLinkQuality")
    6693                            .dwattr $C$DW$562, DW_AT_TI_symbol_name("mpduLinkQuality")
    6694                            .dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6695                            .dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
    6696                            .dwattr $C$DW$562, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6697                            .dwattr $C$DW$562, DW_AT_decl_line(0x360)
    6698                            .dwattr $C$DW$562, DW_AT_decl_column(0x19)
    6699                    
    6700                    $C$DW$563       .dwtag  DW_TAG_member
    6701                            .dwattr $C$DW$563, DW_AT_type(*$C$DW$T$21)
    6702                            .dwattr $C$DW$563, DW_AT_name("correlation")
    6703                            .dwattr $C$DW$563, DW_AT_TI_symbol_name("correlation")
    6704                            .dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6705                            .dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
    6706                            .dwattr $C$DW$563, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6707                            .dwattr $C$DW$563, DW_AT_decl_line(0x361)
    6708                            .dwattr $C$DW$563, DW_AT_decl_column(0x19)
    6709                    
    6710                    $C$DW$564       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.2 Thu Nov 15 15:14:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{C21975A2-F5E9-4E6C-B1AA-FAD658E17ED5} PAGE  123

    6711                            .dwattr $C$DW$564, DW_AT_type(*$C$DW$T$54)
    6712                            .dwattr $C$DW$564, DW_AT_name("rssi")
    6713                            .dwattr $C$DW$564, DW_AT_TI_symbol_name("rssi")
    6714                            .dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    6715                            .dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
    6716                            .dwattr $C$DW$564, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6717                            .dwattr $C$DW$564, DW_AT_decl_line(0x362)
    6718                            .dwattr $C$DW$564, DW_AT_decl_column(0x19)
    6719                    
    6720                    $C$DW$565       .dwtag  DW_TAG_member
    6721                            .dwattr $C$DW$565, DW_AT_type(*$C$DW$T$40)
    6722                            .dwattr $C$DW$565, DW_AT_name("ptrMData")
    6723                            .dwattr $C$DW$565, DW_AT_TI_symbol_name("ptrMData")
    6724                            .dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6725                            .dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
    6726                            .dwattr $C$DW$565, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6727                            .dwattr $C$DW$565, DW_AT_decl_line(0x364)
    6728                            .dwattr $C$DW$565, DW_AT_decl_column(0x19)
    6729                    
    6730                    $C$DW$566       .dwtag  DW_TAG_member
    6731                            .dwattr $C$DW$566, DW_AT_type(*$C$DW$T$56)
    6732                            .dwattr $C$DW$566, DW_AT_name("pKeyDesc")
    6733                            .dwattr $C$DW$566, DW_AT_TI_symbol_name("pKeyDesc")
    6734                            .dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6735                            .dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
    6736                            .dwattr $C$DW$566, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6737                            .dwattr $C$DW$566, DW_AT_decl_line(0x365)
    6738                            .dwattr $C$DW$566, DW_AT_decl_column(0x19)
    6739                    
    6740                    $C$DW$567       .dwtag  DW_TAG_member
    6741                            .dwattr $C$DW$567, DW_AT_type(*$C$DW$T$32)
    6742                            .dwattr $C$DW$567, DW_AT_name("frameCntr")
    6743                            .dwattr $C$DW$567, DW_AT_TI_symbol_name("frameCntr")
    6744                            .dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6745                            .dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
    6746                            .dwattr $C$DW$567, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6747                            .dwattr $C$DW$567, DW_AT_decl_line(0x366)
    6748                            .dwattr $C$DW$567, DW_AT_decl_column(0x19)
    6749                    
    6750                    $C$DW$568       .dwtag  DW_TAG_member
    6751                            .dwattr $C$DW$568, DW_AT_type(*$C$DW$T$58)
    6752                            .dwattr $C$DW$568, DW_AT_name("payloadIeInfo")
    6753                            .dwattr $C$DW$568, DW_AT_TI_symbol_name("payloadIeInfo")
    6754                            .dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6755                            .dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
    6756                            .dwattr $C$DW$568, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6757                            .dwattr $C$DW$568, DW_AT_decl_line(0x368)
    6758                            .dwattr $C$DW$568, DW_AT_decl_column(0x19)
    6759                    
    6760                    $C$DW$569       .dwtag  DW_TAG_member
    6761                            .dwattr $C$DW$569, DW_AT_type(*$C$DW$T$60)
    6762                            .dwattr $C$DW$569, DW_AT_name("headerIeInfo")
    6763                            .dwattr $C$DW$569, DW_AT_TI_symbol_name("headerIeInfo")
    6764                            .dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    6765                            .dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.2 Thu Nov 15 15:14:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{C21975A2-F5E9-4E6C-B1AA-FAD658E17ED5} PAGE  124

    6766                            .dwattr $C$DW$569, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6767                            .dwattr $C$DW$569, DW_AT_decl_line(0x369)
    6768                            .dwattr $C$DW$569, DW_AT_decl_column(0x19)
    6769                    
    6770                    $C$DW$570       .dwtag  DW_TAG_member
    6771                            .dwattr $C$DW$570, DW_AT_type(*$C$DW$T$30)
    6772                            .dwattr $C$DW$570, DW_AT_name("totalLen")
    6773                            .dwattr $C$DW$570, DW_AT_TI_symbol_name("totalLen")
    6774                            .dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    6775                            .dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
    6776                            .dwattr $C$DW$570, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6777                            .dwattr $C$DW$570, DW_AT_decl_line(0x36a)
    6778                            .dwattr $C$DW$570, DW_AT_decl_column(0x19)
    6779                    
    6780                    $C$DW$571       .dwtag  DW_TAG_member
    6781                            .dwattr $C$DW$571, DW_AT_type(*$C$DW$T$40)
    6782                            .dwattr $C$DW$571, DW_AT_name("ptrHeaderIE")
    6783                            .dwattr $C$DW$571, DW_AT_TI_symbol_name("ptrHeaderIE")
    6784                            .dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6785                            .dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
    6786                            .dwattr $C$DW$571, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6787                            .dwattr $C$DW$571, DW_AT_decl_line(0x36b)
    6788                            .dwattr $C$DW$571, DW_AT_decl_column(0x19)
    6789                    
    6790                    $C$DW$572       .dwtag  DW_TAG_member
    6791                            .dwattr $C$DW$572, DW_AT_type(*$C$DW$T$30)
    6792                            .dwattr $C$DW$572, DW_AT_name("headerIesLen")
    6793                            .dwattr $C$DW$572, DW_AT_TI_symbol_name("headerIesLen")
    6794                            .dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    6795                            .dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
    6796                            .dwattr $C$DW$572, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6797                            .dwattr $C$DW$572, DW_AT_decl_line(0x36c)
    6798                            .dwattr $C$DW$572, DW_AT_decl_column(0x19)
    6799                    
    6800                    $C$DW$573       .dwtag  DW_TAG_member
    6801                            .dwattr $C$DW$573, DW_AT_type(*$C$DW$T$40)
    6802                            .dwattr $C$DW$573, DW_AT_name("ptrPayloadIE")
    6803                            .dwattr $C$DW$573, DW_AT_TI_symbol_name("ptrPayloadIE")
    6804                            .dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    6805                            .dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
    6806                            .dwattr $C$DW$573, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6807                            .dwattr $C$DW$573, DW_AT_decl_line(0x36d)
    6808                            .dwattr $C$DW$573, DW_AT_decl_column(0x19)
    6809                    
    6810                    $C$DW$574       .dwtag  DW_TAG_member
    6811                            .dwattr $C$DW$574, DW_AT_type(*$C$DW$T$40)
    6812                            .dwattr $C$DW$574, DW_AT_name("ptrUTIE")
    6813                            .dwattr $C$DW$574, DW_AT_TI_symbol_name("ptrUTIE")
    6814                            .dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    6815                            .dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
    6816                            .dwattr $C$DW$574, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6817                            .dwattr $C$DW$574, DW_AT_decl_line(0x36e)
    6818                            .dwattr $C$DW$574, DW_AT_decl_column(0x19)
    6819                    
    6820                    $C$DW$575       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.2 Thu Nov 15 15:14:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{C21975A2-F5E9-4E6C-B1AA-FAD658E17ED5} PAGE  125

    6821                            .dwattr $C$DW$575, DW_AT_type(*$C$DW$T$40)
    6822                            .dwattr $C$DW$575, DW_AT_name("ptrBTIE")
    6823                            .dwattr $C$DW$575, DW_AT_TI_symbol_name("ptrBTIE")
    6824                            .dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    6825                            .dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
    6826                            .dwattr $C$DW$575, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6827                            .dwattr $C$DW$575, DW_AT_decl_line(0x36f)
    6828                            .dwattr $C$DW$575, DW_AT_decl_column(0x19)
    6829                    
    6830                    $C$DW$576       .dwtag  DW_TAG_member
    6831                            .dwattr $C$DW$576, DW_AT_type(*$C$DW$T$40)
    6832                            .dwattr $C$DW$576, DW_AT_name("ptrFrameCnt")
    6833                            .dwattr $C$DW$576, DW_AT_TI_symbol_name("ptrFrameCnt")
    6834                            .dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    6835                            .dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
    6836                            .dwattr $C$DW$576, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6837                            .dwattr $C$DW$576, DW_AT_decl_line(0x370)
    6838                            .dwattr $C$DW$576, DW_AT_decl_column(0x19)
    6839                    
    6840                    $C$DW$577       .dwtag  DW_TAG_member
    6841                            .dwattr $C$DW$577, DW_AT_type(*$C$DW$T$21)
    6842                            .dwattr $C$DW$577, DW_AT_name("rsl")
    6843                            .dwattr $C$DW$577, DW_AT_TI_symbol_name("rsl")
    6844                            .dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6845                            .dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
    6846                            .dwattr $C$DW$577, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6847                            .dwattr $C$DW$577, DW_AT_decl_line(0x371)
    6848                            .dwattr $C$DW$577, DW_AT_decl_column(0x19)
    6849                    
    6850                    $C$DW$578       .dwtag  DW_TAG_member
    6851                            .dwattr $C$DW$578, DW_AT_type(*$C$DW$T$21)
    6852                            .dwattr $C$DW$578, DW_AT_name("nb")
    6853                            .dwattr $C$DW$578, DW_AT_TI_symbol_name("nb")
    6854                            .dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
    6855                            .dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
    6856                            .dwattr $C$DW$578, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6857                            .dwattr $C$DW$578, DW_AT_decl_line(0x372)
    6858                            .dwattr $C$DW$578, DW_AT_decl_column(0x19)
    6859                    
    6860                    $C$DW$579       .dwtag  DW_TAG_member
    6861                            .dwattr $C$DW$579, DW_AT_type(*$C$DW$T$21)
    6862                            .dwattr $C$DW$579, DW_AT_name("be")
    6863                            .dwattr $C$DW$579, DW_AT_TI_symbol_name("be")
    6864                            .dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    6865                            .dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
    6866                            .dwattr $C$DW$579, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6867                            .dwattr $C$DW$579, DW_AT_decl_line(0x373)
    6868                            .dwattr $C$DW$579, DW_AT_decl_column(0x19)
    6869                    
    6870                    $C$DW$580       .dwtag  DW_TAG_member
    6871                            .dwattr $C$DW$580, DW_AT_type(*$C$DW$T$21)
    6872                            .dwattr $C$DW$580, DW_AT_name("fhFrameType")
    6873                            .dwattr $C$DW$580, DW_AT_TI_symbol_name("fhFrameType")
    6874                            .dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x5f]
    6875                            .dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.2 Thu Nov 15 15:14:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{C21975A2-F5E9-4E6C-B1AA-FAD658E17ED5} PAGE  126

    6876                            .dwattr $C$DW$580, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6877                            .dwattr $C$DW$580, DW_AT_decl_line(0x374)
    6878                            .dwattr $C$DW$580, DW_AT_decl_column(0x19)
    6879                    
    6880                    $C$DW$581       .dwtag  DW_TAG_member
    6881                            .dwattr $C$DW$581, DW_AT_type(*$C$DW$T$21)
    6882                            .dwattr $C$DW$581, DW_AT_name("gpDuration")
    6883                            .dwattr $C$DW$581, DW_AT_TI_symbol_name("gpDuration")
    6884                            .dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    6885                            .dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
    6886                            .dwattr $C$DW$581, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6887                            .dwattr $C$DW$581, DW_AT_decl_line(0x375)
    6888                            .dwattr $C$DW$581, DW_AT_decl_column(0x19)
    6889                    
    6890                    $C$DW$582       .dwtag  DW_TAG_member
    6891                            .dwattr $C$DW$582, DW_AT_type(*$C$DW$T$21)
    6892                            .dwattr $C$DW$582, DW_AT_name("gpNumOfTx")
    6893                            .dwattr $C$DW$582, DW_AT_TI_symbol_name("gpNumOfTx")
    6894                            .dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    6895                            .dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
    6896                            .dwattr $C$DW$582, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6897                            .dwattr $C$DW$582, DW_AT_decl_line(0x376)
    6898                            .dwattr $C$DW$582, DW_AT_decl_column(0x19)
    6899                    
    6900                    $C$DW$583       .dwtag  DW_TAG_member
    6901                            .dwattr $C$DW$583, DW_AT_type(*$C$DW$T$21)
    6902                            .dwattr $C$DW$583, DW_AT_name("gpInterframeDelay")
    6903                            .dwattr $C$DW$583, DW_AT_TI_symbol_name("gpInterframeDelay")
    6904                            .dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    6905                            .dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
    6906                            .dwattr $C$DW$583, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6907                            .dwattr $C$DW$583, DW_AT_decl_line(0x377)
    6908                            .dwattr $C$DW$583, DW_AT_decl_column(0x19)
    6909                    
    6910                    $C$DW$584       .dwtag  DW_TAG_member
    6911                            .dwattr $C$DW$584, DW_AT_type(*$C$DW$T$486)
    6912                            .dwattr $C$DW$584, DW_AT_name("dest")
    6913                            .dwattr $C$DW$584, DW_AT_TI_symbol_name("dest")
    6914                            .dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    6915                            .dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
    6916                            .dwattr $C$DW$584, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6917                            .dwattr $C$DW$584, DW_AT_decl_line(0x37d)
    6918                            .dwattr $C$DW$584, DW_AT_decl_column(0x05)
    6919                    
    6920                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    6921                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x355)
    6922                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x01)
    6923                            .dwendtag $C$DW$T$61
    6924                    
    6925                    $C$DW$T$63      .dwtag  DW_TAG_typedef
    6926                            .dwattr $C$DW$T$63, DW_AT_name("macTxIntData_t")
    6927                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$61)
    6928                            .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    6929                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    6930                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x37e)
TI ARM Assembler PC v18.1.2 Thu Nov 15 15:14:59 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{C21975A2-F5E9-4E6C-B1AA-FAD658E17ED5} PAGE  127

    6931                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    6932                    
    6933                    
    6934                    $C$DW$T$64      .dwtag  DW_TAG_structure_type
    6935                            .dwattr $C$DW$T$64, DW_AT_byte_size(0xa4)
    6936                    $C$DW$585       .dwtag  DW_TAG_member
    6937                            .dwattr $C$DW$585, DW_AT_type(*$C$DW$T$38)
    6938                            .dwattr $C$DW$585, DW_AT_name("hdr")
    6939                            .dwattr $C$DW$585, DW_AT_TI_symbol_name("hdr")
    6940                            .dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6941                            .dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
    6942                            .dwattr $C$DW$585, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6943                            .dwattr $C$DW$585, DW_AT_decl_line(0x150)
    6944                            .dwattr $C$DW$585, DW_AT_decl_column(0x1f)
    6945                    
    6946                    $C$DW$586       .dwtag  DW_TAG_member
    6947                            .dwattr $C$DW$586, DW_AT_type(*$C$DW$T$62)
    6948                            .dwattr $C$DW$586, DW_AT_name("mpdu")
    6949                            .dwattr $C$DW$586, DW_AT_TI_symbol_name("mpdu")
    6950                            .dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6951                            .dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
    6952                            .dwattr $C$DW$586, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6953                            .dwattr $C$DW$586, DW_AT_decl_line(0x151)
    6954                            .dwattr $C$DW$586, DW_AT_decl_column(0x1f)
    6955                    
    6956                    $C$DW$587       .dwtag  DW_TAG_member
    6957                            .dwattr $C$DW$587, DW_AT_type(*$C$DW$T$63)
    6958                            .dwattr $C$DW$587, DW_AT_name("internal")
    6959                            .dwattr $C$DW$587, DW_AT_TI_symbol_name("internal")
    6960                            .dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6961                            .dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
    6962                            .dwattr $C$DW$587, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6963                            .dwattr $C$DW$587, DW_AT_decl_line(0x152)
    6964                            .dwattr $C$DW$587, DW_AT_decl_column(0x1f)
    6965                    
    6966                    $C$DW$588       .dwtag  DW_TAG_member
    6967                            .dwattr $C$DW$588, DW_AT_type(*$C$DW$T$491)
    6968                            .dwattr $C$DW$588, DW_AT_name("mac")
    6969                            .dwattr $C$DW$588, DW_AT_TI_symbol_name("mac")
    6970                            .dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    6971                            .dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
    6972                            .dwattr $C$DW$588, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6973                            .dwattr $C$DW$588, DW_AT_decl_line(0x15a)
