TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{1C129E45-DDBE-43AE-90DD-CDEF4BAF1631} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.2.LTS *
       3                    ;* Date/Time created: Fri Nov 16 15:54:42 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/mac_user_config.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("D:\code\collector_cc1310lp\collector_cc1310lp")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    5526                            .dwattr $C$DW$468, DW_AT_decl_file("..\Application\mac_user_config.h")
    5527                            .dwattr $C$DW$468, DW_AT_decl_line(0x11d)
    5528                            .dwattr $C$DW$468, DW_AT_decl_column(0x05)
    5529                    
    5530                    $C$DW$469       .dwtag  DW_TAG_enumerator
    5531                            .dwattr $C$DW$469, DW_AT_name("MAC_RADIO_CC1352P")
    5532                            .dwattr $C$DW$469, DW_AT_const_value(0x02)
    5533                            .dwattr $C$DW$469, DW_AT_decl_file("..\Application\mac_user_config.h")
    5534                            .dwattr $C$DW$469, DW_AT_decl_line(0x11e)
    5535                            .dwattr $C$DW$469, DW_AT_decl_column(0x05)
    5536                    
    5537                    $C$DW$470       .dwtag  DW_TAG_enumerator
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{1C129E45-DDBE-43AE-90DD-CDEF4BAF1631} PAGE  103

    5538                            .dwattr $C$DW$470, DW_AT_name("MAC_RADIO_CCXXX2")
    5539                            .dwattr $C$DW$470, DW_AT_const_value(0x00)
    5540                            .dwattr $C$DW$470, DW_AT_decl_file("..\Application\mac_user_config.h")
    5541                            .dwattr $C$DW$470, DW_AT_decl_line(0x11f)
    5542                            .dwattr $C$DW$470, DW_AT_decl_column(0x05)
    5543                    
    5544                            .dwattr $C$DW$T$780, DW_AT_decl_file("..\Application\mac_user_config.h")
    5545                            .dwattr $C$DW$T$780, DW_AT_decl_line(0x118)
    5546                            .dwattr $C$DW$T$780, DW_AT_decl_column(0x01)
    5547                            .dwendtag $C$DW$T$780
    5548                    
    5549                    $C$DW$T$781     .dwtag  DW_TAG_typedef
    5550                            .dwattr $C$DW$T$781, DW_AT_name("macChipType_t")
    5551                            .dwattr $C$DW$T$781, DW_AT_type(*$C$DW$T$780)
    5552                            .dwattr $C$DW$T$781, DW_AT_language(DW_LANG_C)
    5553                            .dwattr $C$DW$T$781, DW_AT_decl_file("..\Application\mac_user_config.h")
    5554                            .dwattr $C$DW$T$781, DW_AT_decl_line(0x120)
    5555                            .dwattr $C$DW$T$781, DW_AT_decl_column(0x03)
    5556                    
    5557                    
    5558                    $C$DW$T$782     .dwtag  DW_TAG_enumeration_type
    5559                            .dwattr $C$DW$T$782, DW_AT_byte_size(0x01)
    5560                    $C$DW$471       .dwtag  DW_TAG_enumerator
    5561                            .dwattr $C$DW$471, DW_AT_name("MAC_HW_REV_21")
    5562                            .dwattr $C$DW$471, DW_AT_const_value(0x00)
    5563                            .dwattr $C$DW$471, DW_AT_decl_file("..\Application\mac_user_config.h")
    5564                            .dwattr $C$DW$471, DW_AT_decl_line(0x125)
    5565                            .dwattr $C$DW$471, DW_AT_decl_column(0x05)
    5566                    
    5567                    $C$DW$472       .dwtag  DW_TAG_enumerator
    5568                            .dwattr $C$DW$472, DW_AT_name("MAC_HW_REV_20")
    5569                            .dwattr $C$DW$472, DW_AT_const_value(0x01)
    5570                            .dwattr $C$DW$472, DW_AT_decl_file("..\Application\mac_user_config.h")
    5571                            .dwattr $C$DW$472, DW_AT_decl_line(0x126)
    5572                            .dwattr $C$DW$472, DW_AT_decl_column(0x05)
    5573                    
    5574                    $C$DW$473       .dwtag  DW_TAG_enumerator
    5575                            .dwattr $C$DW$473, DW_AT_name("MAC_HW_MAX_REVS")
    5576                            .dwattr $C$DW$473, DW_AT_const_value(0x02)
    5577                            .dwattr $C$DW$473, DW_AT_decl_file("..\Application\mac_user_config.h")
    5578                            .dwattr $C$DW$473, DW_AT_decl_line(0x127)
    5579                            .dwattr $C$DW$473, DW_AT_decl_column(0x05)
    5580                    
    5581                            .dwattr $C$DW$T$782, DW_AT_decl_file("..\Application\mac_user_config.h")
    5582                            .dwattr $C$DW$T$782, DW_AT_decl_line(0x124)
    5583                            .dwattr $C$DW$T$782, DW_AT_decl_column(0x01)
    5584                            .dwendtag $C$DW$T$782
    5585                    
    5586                    $C$DW$T$783     .dwtag  DW_TAG_typedef
    5587                            .dwattr $C$DW$T$783, DW_AT_name("macHwRevision_t")
    5588                            .dwattr $C$DW$T$783, DW_AT_type(*$C$DW$T$782)
    5589                            .dwattr $C$DW$T$783, DW_AT_language(DW_LANG_C)
    5590                            .dwattr $C$DW$T$783, DW_AT_decl_file("..\Application\mac_user_config.h")
    5591                            .dwattr $C$DW$T$783, DW_AT_decl_line(0x128)
    5592                            .dwattr $C$DW$T$783, DW_AT_decl_column(0x03)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{1C129E45-DDBE-43AE-90DD-CDEF4BAF1631} PAGE  104

    5593                    
    5594                    
    5595                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    5596                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
    5597                    $C$DW$474       .dwtag  DW_TAG_member
    5598                            .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$22)
    5599                            .dwattr $C$DW$474, DW_AT_name("rfMode")
    5600                            .dwattr $C$DW$474, DW_AT_TI_symbol_name("rfMode")
    5601                            .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5602                            .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    5603                            .dwattr $C$DW$474, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    5604                            .dwattr $C$DW$474, DW_AT_decl_line(0x41e)
    5605                            .dwattr $C$DW$474, DW_AT_decl_column(0x0d)
    5606                    
    5607                    $C$DW$475       .dwtag  DW_TAG_member
    5608                            .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$24)
    5609                            .dwattr $C$DW$475, DW_AT_name("cpePatchFxn")
    5610                            .dwattr $C$DW$475, DW_AT_TI_symbol_name("cpePatchFxn")
    5611                            .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5612                            .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    5613                            .dwattr $C$DW$475, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    5614                            .dwattr $C$DW$475, DW_AT_decl_line(0x41f)
    5615                            .dwattr $C$DW$475, DW_AT_decl_column(0x0c)
    5616                    
    5617                    $C$DW$476       .dwtag  DW_TAG_member
    5618                            .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$24)
    5619                            .dwattr $C$DW$476, DW_AT_name("mcePatchFxn")
    5620                            .dwattr $C$DW$476, DW_AT_TI_symbol_name("mcePatchFxn")
    5621                            .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5622                            .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    5623                            .dwattr $C$DW$476, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    5624                            .dwattr $C$DW$476, DW_AT_decl_line(0x420)
    5625                            .dwattr $C$DW$476, DW_AT_decl_column(0x0c)
    5626                    
    5627                    $C$DW$477       .dwtag  DW_TAG_member
    5628                            .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$24)
    5629                            .dwattr $C$DW$477, DW_AT_name("rfePatchFxn")
    5630                            .dwattr $C$DW$477, DW_AT_TI_symbol_name("rfePatchFxn")
    5631                            .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5632                            .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    5633                            .dwattr $C$DW$477, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    5634                            .dwattr $C$DW$477, DW_AT_decl_line(0x421)
    5635                            .dwattr $C$DW$477, DW_AT_decl_column(0x0c)
    5636                    
    5637                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/
    5638                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x41d)
    5639                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    5640                            .dwendtag $C$DW$T$25
    5641                    
    5642                    $C$DW$T$49      .dwtag  DW_TAG_typedef
    5643                            .dwattr $C$DW$T$49, DW_AT_name("RF_Mode")
    5644                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$25)
    5645                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    5646                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/
    5647                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x422)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{1C129E45-DDBE-43AE-90DD-CDEF4BAF1631} PAGE  105

    5648                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x03)
    5649                    
    5650                    $C$DW$T$784     .dwtag  DW_TAG_const_type
    5651                            .dwattr $C$DW$T$784, DW_AT_type(*$C$DW$T$49)
    5652                    
    5653                    $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    5654                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    5655                            .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
    5656                    
    5657                    
    5658                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    5659                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    5660                    $C$DW$478       .dwtag  DW_TAG_member
    5661                            .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$22)
    5662                            .dwattr $C$DW$478, DW_AT_name("triggerType")
    5663                            .dwattr $C$DW$478, DW_AT_TI_symbol_name("triggerType")
    5664                            .dwattr $C$DW$478, DW_AT_bit_offset(0x04)
    5665                            .dwattr $C$DW$478, DW_AT_bit_size(0x04)
    5666                            .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5667                            .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    5668                            .dwattr $C$DW$478, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    5669                            .dwattr $C$DW$478, DW_AT_decl_line(0x7d)
    5670                            .dwattr $C$DW$478, DW_AT_decl_column(0x0f)
    5671                    
    5672                    $C$DW$479       .dwtag  DW_TAG_member
    5673                            .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$22)
    5674                            .dwattr $C$DW$479, DW_AT_name("bEnaCmd")
    5675                            .dwattr $C$DW$479, DW_AT_TI_symbol_name("bEnaCmd")
    5676                            .dwattr $C$DW$479, DW_AT_bit_offset(0x03)
    5677                            .dwattr $C$DW$479, DW_AT_bit_size(0x01)
    5678                            .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5679                            .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    5680                            .dwattr $C$DW$479, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    5681                            .dwattr $C$DW$479, DW_AT_decl_line(0x7e)
    5682                            .dwattr $C$DW$479, DW_AT_decl_column(0x0f)
    5683                    
    5684                    $C$DW$480       .dwtag  DW_TAG_member
    5685                            .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$22)
    5686                            .dwattr $C$DW$480, DW_AT_name("triggerNo")
    5687                            .dwattr $C$DW$480, DW_AT_TI_symbol_name("triggerNo")
    5688                            .dwattr $C$DW$480, DW_AT_bit_offset(0x01)
    5689                            .dwattr $C$DW$480, DW_AT_bit_size(0x02)
    5690                            .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5691                            .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    5692                            .dwattr $C$DW$480, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    5693                            .dwattr $C$DW$480, DW_AT_decl_line(0x80)
    5694                            .dwattr $C$DW$480, DW_AT_decl_column(0x0f)
    5695                    
    5696                    $C$DW$481       .dwtag  DW_TAG_member
    5697                            .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$22)
    5698                            .dwattr $C$DW$481, DW_AT_name("pastTrig")
    5699                            .dwattr $C$DW$481, DW_AT_TI_symbol_name("pastTrig")
    5700                            .dwattr $C$DW$481, DW_AT_bit_offset(0x00)
    5701                            .dwattr $C$DW$481, DW_AT_bit_size(0x01)
    5702                            .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{1C129E45-DDBE-43AE-90DD-CDEF4BAF1631} PAGE  106

    5703                            .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    5704                            .dwattr $C$DW$481, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    5705                            .dwattr $C$DW$481, DW_AT_decl_line(0x81)
    5706                            .dwattr $C$DW$481, DW_AT_decl_column(0x0f)
    5707                    
    5708                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    5709                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x7c)
    5710                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x0b)
    5711                            .dwendtag $C$DW$T$26
    5712                    
    5713                    
    5714                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    5715                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    5716                    $C$DW$482       .dwtag  DW_TAG_member
    5717                            .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$22)
    5718                            .dwattr $C$DW$482, DW_AT_name("rule")
    5719                            .dwattr $C$DW$482, DW_AT_TI_symbol_name("rule")
    5720                            .dwattr $C$DW$482, DW_AT_bit_offset(0x04)
    5721                            .dwattr $C$DW$482, DW_AT_bit_size(0x04)
    5722                            .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5723                            .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    5724                            .dwattr $C$DW$482, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    5725                            .dwattr $C$DW$482, DW_AT_decl_line(0x85)
    5726                            .dwattr $C$DW$482, DW_AT_decl_column(0x0f)
    5727                    
    5728                    $C$DW$483       .dwtag  DW_TAG_member
    5729                            .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$22)
    5730                            .dwattr $C$DW$483, DW_AT_name("nSkip")
    5731                            .dwattr $C$DW$483, DW_AT_TI_symbol_name("nSkip")
    5732                            .dwattr $C$DW$483, DW_AT_bit_offset(0x00)
    5733                            .dwattr $C$DW$483, DW_AT_bit_size(0x04)
    5734                            .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5735                            .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    5736                            .dwattr $C$DW$483, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    5737                            .dwattr $C$DW$483, DW_AT_decl_line(0x86)
    5738                            .dwattr $C$DW$483, DW_AT_decl_column(0x0f)
    5739                    
    5740                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    5741                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x84)
    5742                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x0b)
    5743                            .dwendtag $C$DW$T$27
    5744                    
    5745                    
    5746                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    5747                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    5748                    $C$DW$484       .dwtag  DW_TAG_member
    5749                            .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$22)
    5750                            .dwattr $C$DW$484, DW_AT_name("triggerType")
    5751                            .dwattr $C$DW$484, DW_AT_TI_symbol_name("triggerType")
    5752                            .dwattr $C$DW$484, DW_AT_bit_offset(0x04)
    5753                            .dwattr $C$DW$484, DW_AT_bit_size(0x04)
    5754                            .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5755                            .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    5756                            .dwattr $C$DW$484, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    5757                            .dwattr $C$DW$484, DW_AT_decl_line(0xb3)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{1C129E45-DDBE-43AE-90DD-CDEF4BAF1631} PAGE  107

    5758                            .dwattr $C$DW$484, DW_AT_decl_column(0x0f)
    5759                    
    5760                    $C$DW$485       .dwtag  DW_TAG_member
    5761                            .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$22)
    5762                            .dwattr $C$DW$485, DW_AT_name("bEnaCmd")
    5763                            .dwattr $C$DW$485, DW_AT_TI_symbol_name("bEnaCmd")
    5764                            .dwattr $C$DW$485, DW_AT_bit_offset(0x03)
    5765                            .dwattr $C$DW$485, DW_AT_bit_size(0x01)
    5766                            .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5767                            .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    5768                            .dwattr $C$DW$485, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    5769                            .dwattr $C$DW$485, DW_AT_decl_line(0xb4)
    5770                            .dwattr $C$DW$485, DW_AT_decl_column(0x0f)
    5771                    
    5772                    $C$DW$486       .dwtag  DW_TAG_member
    5773                            .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$22)
    5774                            .dwattr $C$DW$486, DW_AT_name("triggerNo")
    5775                            .dwattr $C$DW$486, DW_AT_TI_symbol_name("triggerNo")
    5776                            .dwattr $C$DW$486, DW_AT_bit_offset(0x01)
    5777                            .dwattr $C$DW$486, DW_AT_bit_size(0x02)
    5778                            .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5779                            .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    5780                            .dwattr $C$DW$486, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    5781                            .dwattr $C$DW$486, DW_AT_decl_line(0xb6)
    5782                            .dwattr $C$DW$486, DW_AT_decl_column(0x0f)
    5783                    
    5784                    $C$DW$487       .dwtag  DW_TAG_member
    5785                            .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$22)
    5786                            .dwattr $C$DW$487, DW_AT_name("pastTrig")
    5787                            .dwattr $C$DW$487, DW_AT_TI_symbol_name("pastTrig")
    5788                            .dwattr $C$DW$487, DW_AT_bit_offset(0x00)
    5789                            .dwattr $C$DW$487, DW_AT_bit_size(0x01)
    5790                            .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5791                            .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    5792                            .dwattr $C$DW$487, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    5793                            .dwattr $C$DW$487, DW_AT_decl_line(0xb7)
    5794                            .dwattr $C$DW$487, DW_AT_decl_column(0x0f)
    5795                    
    5796                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    5797                            .dwattr $C$DW$T$28, DW_AT_decl_line(0xb2)
    5798                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x0b)
    5799                            .dwendtag $C$DW$T$28
    5800                    
    5801                    
    5802                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    5803                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    5804                    $C$DW$488       .dwtag  DW_TAG_member
    5805                            .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$22)
    5806                            .dwattr $C$DW$488, DW_AT_name("rule")
    5807                            .dwattr $C$DW$488, DW_AT_TI_symbol_name("rule")
    5808                            .dwattr $C$DW$488, DW_AT_bit_offset(0x04)
    5809                            .dwattr $C$DW$488, DW_AT_bit_size(0x04)
    5810                            .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5811                            .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    5812                            .dwattr $C$DW$488, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{1C129E45-DDBE-43AE-90DD-CDEF4BAF1631} PAGE  108

    5813                            .dwattr $C$DW$488, DW_AT_decl_line(0xbb)
    5814                            .dwattr $C$DW$488, DW_AT_decl_column(0x0f)
    5815                    
    5816                    $C$DW$489       .dwtag  DW_TAG_member
    5817                            .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$22)
    5818                            .dwattr $C$DW$489, DW_AT_name("nSkip")
    5819                            .dwattr $C$DW$489, DW_AT_TI_symbol_name("nSkip")
    5820                            .dwattr $C$DW$489, DW_AT_bit_offset(0x00)
    5821                            .dwattr $C$DW$489, DW_AT_bit_size(0x04)
    5822                            .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5823                            .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    5824                            .dwattr $C$DW$489, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    5825                            .dwattr $C$DW$489, DW_AT_decl_line(0xbc)
    5826                            .dwattr $C$DW$489, DW_AT_decl_column(0x0f)
    5827                    
    5828                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    5829                            .dwattr $C$DW$T$29, DW_AT_decl_line(0xba)
    5830                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x0b)
    5831                            .dwendtag $C$DW$T$29
    5832                    
    5833                    
    5834                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    5835                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    5836                    $C$DW$490       .dwtag  DW_TAG_member
    5837                            .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$31)
    5838                            .dwattr $C$DW$490, DW_AT_name("frontEndMode")
    5839                            .dwattr $C$DW$490, DW_AT_TI_symbol_name("frontEndMode")
    5840                            .dwattr $C$DW$490, DW_AT_bit_offset(0x0d)
    5841                            .dwattr $C$DW$490, DW_AT_bit_size(0x03)
    5842                            .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5843                            .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    5844                            .dwattr $C$DW$490, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    5845                            .dwattr $C$DW$490, DW_AT_decl_line(0xc9)
    5846                            .dwattr $C$DW$490, DW_AT_decl_column(0x10)
    5847                    
    5848                    $C$DW$491       .dwtag  DW_TAG_member
    5849                            .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$31)
    5850                            .dwattr $C$DW$491, DW_AT_name("biasMode")
    5851                            .dwattr $C$DW$491, DW_AT_TI_symbol_name("biasMode")
    5852                            .dwattr $C$DW$491, DW_AT_bit_offset(0x0c)
    5853                            .dwattr $C$DW$491, DW_AT_bit_size(0x01)
    5854                            .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5855                            .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    5856                            .dwattr $C$DW$491, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    5857                            .dwattr $C$DW$491, DW_AT_decl_line(0xcf)
    5858                            .dwattr $C$DW$491, DW_AT_decl_column(0x10)
    5859                    
    5860                    $C$DW$492       .dwtag  DW_TAG_member
    5861                            .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$31)
    5862                            .dwattr $C$DW$492, DW_AT_name("analogCfgMode")
    5863                            .dwattr $C$DW$492, DW_AT_TI_symbol_name("analogCfgMode")
    5864                            .dwattr $C$DW$492, DW_AT_bit_offset(0x06)
    5865                            .dwattr $C$DW$492, DW_AT_bit_size(0x06)
    5866                            .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5867                            .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{1C129E45-DDBE-43AE-90DD-CDEF4BAF1631} PAGE  109

    5868                            .dwattr $C$DW$492, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    5869                            .dwattr $C$DW$492, DW_AT_decl_line(0xd1)
    5870                            .dwattr $C$DW$492, DW_AT_decl_column(0x10)
    5871                    
    5872                    $C$DW$493       .dwtag  DW_TAG_member
    5873                            .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$31)
    5874                            .dwattr $C$DW$493, DW_AT_name("bNoFsPowerUp")
    5875                            .dwattr $C$DW$493, DW_AT_TI_symbol_name("bNoFsPowerUp")
    5876                            .dwattr $C$DW$493, DW_AT_bit_offset(0x05)
    5877                            .dwattr $C$DW$493, DW_AT_bit_size(0x01)
    5878                            .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5879                            .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    5880                            .dwattr $C$DW$493, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    5881                            .dwattr $C$DW$493, DW_AT_decl_line(0xd8)
    5882                            .dwattr $C$DW$493, DW_AT_decl_column(0x10)
    5883                    
    5884                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    5885                            .dwattr $C$DW$T$32, DW_AT_decl_line(0xc8)
    5886                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x0b)
    5887                            .dwendtag $C$DW$T$32
    5888                    
    5889                    
    5890                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    5891                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    5892                    $C$DW$494       .dwtag  DW_TAG_member
    5893                            .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$22)
    5894                            .dwattr $C$DW$494, DW_AT_name("triggerType")
    5895                            .dwattr $C$DW$494, DW_AT_TI_symbol_name("triggerType")
    5896                            .dwattr $C$DW$494, DW_AT_bit_offset(0x04)
    5897                            .dwattr $C$DW$494, DW_AT_bit_size(0x04)
    5898                            .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5899                            .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    5900                            .dwattr $C$DW$494, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    5901                            .dwattr $C$DW$494, DW_AT_decl_line(0x1cf)
    5902                            .dwattr $C$DW$494, DW_AT_decl_column(0x0f)
    5903                    
    5904                    $C$DW$495       .dwtag  DW_TAG_member
    5905                            .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$22)
    5906                            .dwattr $C$DW$495, DW_AT_name("bEnaCmd")
    5907                            .dwattr $C$DW$495, DW_AT_TI_symbol_name("bEnaCmd")
    5908                            .dwattr $C$DW$495, DW_AT_bit_offset(0x03)
    5909                            .dwattr $C$DW$495, DW_AT_bit_size(0x01)
    5910                            .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5911                            .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    5912                            .dwattr $C$DW$495, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    5913                            .dwattr $C$DW$495, DW_AT_decl_line(0x1d0)
    5914                            .dwattr $C$DW$495, DW_AT_decl_column(0x0f)
    5915                    
    5916                    $C$DW$496       .dwtag  DW_TAG_member
    5917                            .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$22)
    5918                            .dwattr $C$DW$496, DW_AT_name("triggerNo")
    5919                            .dwattr $C$DW$496, DW_AT_TI_symbol_name("triggerNo")
    5920                            .dwattr $C$DW$496, DW_AT_bit_offset(0x01)
    5921                            .dwattr $C$DW$496, DW_AT_bit_size(0x02)
    5922                            .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{1C129E45-DDBE-43AE-90DD-CDEF4BAF1631} PAGE  110

    5923                            .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    5924                            .dwattr $C$DW$496, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    5925                            .dwattr $C$DW$496, DW_AT_decl_line(0x1d2)
    5926                            .dwattr $C$DW$496, DW_AT_decl_column(0x0f)
    5927                    
    5928                    $C$DW$497       .dwtag  DW_TAG_member
    5929                            .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$22)
    5930                            .dwattr $C$DW$497, DW_AT_name("pastTrig")
    5931                            .dwattr $C$DW$497, DW_AT_TI_symbol_name("pastTrig")
    5932                            .dwattr $C$DW$497, DW_AT_bit_offset(0x00)
    5933                            .dwattr $C$DW$497, DW_AT_bit_size(0x01)
    5934                            .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5935                            .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    5936                            .dwattr $C$DW$497, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    5937                            .dwattr $C$DW$497, DW_AT_decl_line(0x1d3)
    5938                            .dwattr $C$DW$497, DW_AT_decl_column(0x0f)
    5939                    
    5940                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    5941                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x1ce)
    5942                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x0b)
    5943                            .dwendtag $C$DW$T$33
    5944                    
    5945                    
    5946                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    5947                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    5948                    $C$DW$498       .dwtag  DW_TAG_member
    5949                            .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$22)
    5950                            .dwattr $C$DW$498, DW_AT_name("rule")
    5951                            .dwattr $C$DW$498, DW_AT_TI_symbol_name("rule")
    5952                            .dwattr $C$DW$498, DW_AT_bit_offset(0x04)
    5953                            .dwattr $C$DW$498, DW_AT_bit_size(0x04)
    5954                            .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5955                            .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    5956                            .dwattr $C$DW$498, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    5957                            .dwattr $C$DW$498, DW_AT_decl_line(0x1d7)
    5958                            .dwattr $C$DW$498, DW_AT_decl_column(0x0f)
    5959                    
    5960                    $C$DW$499       .dwtag  DW_TAG_member
    5961                            .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$22)
    5962                            .dwattr $C$DW$499, DW_AT_name("nSkip")
    5963                            .dwattr $C$DW$499, DW_AT_TI_symbol_name("nSkip")
    5964                            .dwattr $C$DW$499, DW_AT_bit_offset(0x00)
    5965                            .dwattr $C$DW$499, DW_AT_bit_size(0x04)
    5966                            .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5967                            .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    5968                            .dwattr $C$DW$499, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    5969                            .dwattr $C$DW$499, DW_AT_decl_line(0x1d8)
    5970                            .dwattr $C$DW$499, DW_AT_decl_column(0x0f)
    5971                    
    5972                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    5973                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x1d6)
    5974                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x0b)
    5975                            .dwendtag $C$DW$T$34
    5976                    
    5977                    
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{1C129E45-DDBE-43AE-90DD-CDEF4BAF1631} PAGE  111

    5978                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5979                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    5980                    $C$DW$500       .dwtag  DW_TAG_member
    5981                            .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$31)
    5982                            .dwattr $C$DW$500, DW_AT_name("modType")
    5983                            .dwattr $C$DW$500, DW_AT_TI_symbol_name("modType")
    5984                            .dwattr $C$DW$500, DW_AT_bit_offset(0x0d)
    5985                            .dwattr $C$DW$500, DW_AT_bit_size(0x03)
    5986                            .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5987                            .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    5988                            .dwattr $C$DW$500, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    5989                            .dwattr $C$DW$500, DW_AT_decl_line(0x1db)
    5990                            .dwattr $C$DW$500, DW_AT_decl_column(0x10)
    5991                    
    5992                    $C$DW$501       .dwtag  DW_TAG_member
    5993                            .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$31)
    5994                            .dwattr $C$DW$501, DW_AT_name("deviation")
    5995                            .dwattr $C$DW$501, DW_AT_TI_symbol_name("deviation")
    5996                            .dwattr $C$DW$501, DW_AT_bit_offset(0x00)
    5997                            .dwattr $C$DW$501, DW_AT_bit_size(0x0d)
    5998                            .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5999                            .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    6000                            .dwattr $C$DW$501, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6001                            .dwattr $C$DW$501, DW_AT_decl_line(0x1de)
    6002                            .dwattr $C$DW$501, DW_AT_decl_column(0x10)
    6003                    
    6004                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    6005                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x1da)
    6006                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x0b)
    6007                            .dwendtag $C$DW$T$35
    6008                    
    6009                    
    6010                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    6011                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    6012                    $C$DW$502       .dwtag  DW_TAG_member
    6013                            .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$37)
    6014                            .dwattr $C$DW$502, DW_AT_name("preScale")
    6015                            .dwattr $C$DW$502, DW_AT_TI_symbol_name("preScale")
    6016                            .dwattr $C$DW$502, DW_AT_bit_offset(0x1c)
    6017                            .dwattr $C$DW$502, DW_AT_bit_size(0x04)
    6018                            .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6019                            .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    6020                            .dwattr $C$DW$502, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6021                            .dwattr $C$DW$502, DW_AT_decl_line(0x1e1)
    6022                            .dwattr $C$DW$502, DW_AT_decl_column(0x10)
    6023                    
    6024                    $C$DW$503       .dwtag  DW_TAG_member
    6025                            .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$37)
    6026                            .dwattr $C$DW$503, DW_AT_name("rateWord")
    6027                            .dwattr $C$DW$503, DW_AT_TI_symbol_name("rateWord")
    6028                            .dwattr $C$DW$503, DW_AT_bit_offset(0x03)
    6029                            .dwattr $C$DW$503, DW_AT_bit_size(0x15)
    6030                            .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6031                            .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    6032                            .dwattr $C$DW$503, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{1C129E45-DDBE-43AE-90DD-CDEF4BAF1631} PAGE  112

    6033                            .dwattr $C$DW$503, DW_AT_decl_line(0x1e3)
    6034                            .dwattr $C$DW$503, DW_AT_decl_column(0x10)
    6035                    
    6036                    $C$DW$504       .dwtag  DW_TAG_member
    6037                            .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$37)
    6038                            .dwattr $C$DW$504, DW_AT_name("decimMode")
    6039                            .dwattr $C$DW$504, DW_AT_TI_symbol_name("decimMode")
    6040                            .dwattr $C$DW$504, DW_AT_bit_offset(0x00)
    6041                            .dwattr $C$DW$504, DW_AT_bit_size(0x03)
    6042                            .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6043                            .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    6044                            .dwattr $C$DW$504, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6045                            .dwattr $C$DW$504, DW_AT_decl_line(0x1e4)
    6046                            .dwattr $C$DW$504, DW_AT_decl_column(0x10)
    6047                    
    6048                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    6049                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x1e0)
    6050                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x0b)
    6051                            .dwendtag $C$DW$T$38
    6052                    
    6053                    
    6054                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6055                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    6056                    $C$DW$505       .dwtag  DW_TAG_member
    6057                            .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$22)
    6058                            .dwattr $C$DW$505, DW_AT_name("nPreamBytes")
    6059                            .dwattr $C$DW$505, DW_AT_TI_symbol_name("nPreamBytes")
    6060                            .dwattr $C$DW$505, DW_AT_bit_offset(0x02)
    6061                            .dwattr $C$DW$505, DW_AT_bit_size(0x06)
    6062                            .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6063                            .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    6064                            .dwattr $C$DW$505, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6065                            .dwattr $C$DW$505, DW_AT_decl_line(0x1ec)
    6066                            .dwattr $C$DW$505, DW_AT_decl_column(0x0f)
    6067                    
    6068                    $C$DW$506       .dwtag  DW_TAG_member
    6069                            .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$22)
    6070                            .dwattr $C$DW$506, DW_AT_name("preamMode")
    6071                            .dwattr $C$DW$506, DW_AT_TI_symbol_name("preamMode")
    6072                            .dwattr $C$DW$506, DW_AT_bit_offset(0x00)
    6073                            .dwattr $C$DW$506, DW_AT_bit_size(0x02)
    6074                            .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6075                            .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    6076                            .dwattr $C$DW$506, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6077                            .dwattr $C$DW$506, DW_AT_decl_line(0x1f2)
    6078                            .dwattr $C$DW$506, DW_AT_decl_column(0x0f)
    6079                    
    6080                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    6081                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x1eb)
    6082                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x0b)
    6083                            .dwendtag $C$DW$T$39
    6084                    
    6085                    
    6086                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    6087                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{1C129E45-DDBE-43AE-90DD-CDEF4BAF1631} PAGE  113

    6088                    $C$DW$507       .dwtag  DW_TAG_member
    6089                            .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$31)
    6090                            .dwattr $C$DW$507, DW_AT_name("nSwBits")
    6091                            .dwattr $C$DW$507, DW_AT_TI_symbol_name("nSwBits")
    6092                            .dwattr $C$DW$507, DW_AT_bit_offset(0x0a)
    6093                            .dwattr $C$DW$507, DW_AT_bit_size(0x06)
    6094                            .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6095                            .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    6096                            .dwattr $C$DW$507, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6097                            .dwattr $C$DW$507, DW_AT_decl_line(0x1f8)
    6098                            .dwattr $C$DW$507, DW_AT_decl_column(0x10)
    6099                    
    6100                    $C$DW$508       .dwtag  DW_TAG_member
    6101                            .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$31)
    6102                            .dwattr $C$DW$508, DW_AT_name("bBitReversal")
    6103                            .dwattr $C$DW$508, DW_AT_TI_symbol_name("bBitReversal")
    6104                            .dwattr $C$DW$508, DW_AT_bit_offset(0x09)
    6105                            .dwattr $C$DW$508, DW_AT_bit_size(0x01)
    6106                            .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6107                            .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    6108                            .dwattr $C$DW$508, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6109                            .dwattr $C$DW$508, DW_AT_decl_line(0x1f9)
    6110                            .dwattr $C$DW$508, DW_AT_decl_column(0x10)
    6111                    
    6112                    $C$DW$509       .dwtag  DW_TAG_member
    6113                            .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$31)
    6114                            .dwattr $C$DW$509, DW_AT_name("bMsbFirst")
    6115                            .dwattr $C$DW$509, DW_AT_TI_symbol_name("bMsbFirst")
    6116                            .dwattr $C$DW$509, DW_AT_bit_offset(0x08)
    6117                            .dwattr $C$DW$509, DW_AT_bit_size(0x01)
    6118                            .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6119                            .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    6120                            .dwattr $C$DW$509, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6121                            .dwattr $C$DW$509, DW_AT_decl_line(0x1fb)
    6122                            .dwattr $C$DW$509, DW_AT_decl_column(0x10)
    6123                    
    6124                    $C$DW$510       .dwtag  DW_TAG_member
    6125                            .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$31)
    6126                            .dwattr $C$DW$510, DW_AT_name("fecMode")
    6127                            .dwattr $C$DW$510, DW_AT_TI_symbol_name("fecMode")
    6128                            .dwattr $C$DW$510, DW_AT_bit_offset(0x04)
    6129                            .dwattr $C$DW$510, DW_AT_bit_size(0x04)
    6130                            .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6131                            .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    6132                            .dwattr $C$DW$510, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6133                            .dwattr $C$DW$510, DW_AT_decl_line(0x1fd)
    6134                            .dwattr $C$DW$510, DW_AT_decl_column(0x10)
    6135                    
    6136                    $C$DW$511       .dwtag  DW_TAG_member
    6137                            .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$31)
    6138                            .dwattr $C$DW$511, DW_AT_name("whitenMode")
    6139                            .dwattr $C$DW$511, DW_AT_TI_symbol_name("whitenMode")
    6140                            .dwattr $C$DW$511, DW_AT_bit_offset(0x00)
    6141                            .dwattr $C$DW$511, DW_AT_bit_size(0x03)
    6142                            .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{1C129E45-DDBE-43AE-90DD-CDEF4BAF1631} PAGE  114

    6143                            .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    6144                            .dwattr $C$DW$511, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6145                            .dwattr $C$DW$511, DW_AT_decl_line(0x203)
    6146                            .dwattr $C$DW$511, DW_AT_decl_column(0x10)
    6147                    
    6148                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    6149                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x1f7)
    6150                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0b)
    6151                            .dwendtag $C$DW$T$40
    6152                    
    6153                    
    6154                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6155                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    6156                    $C$DW$512       .dwtag  DW_TAG_member
    6157                            .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$31)
    6158                            .dwattr $C$DW$512, DW_AT_name("frontEndMode")
    6159                            .dwattr $C$DW$512, DW_AT_TI_symbol_name("frontEndMode")
    6160                            .dwattr $C$DW$512, DW_AT_bit_offset(0x0d)
    6161                            .dwattr $C$DW$512, DW_AT_bit_size(0x03)
    6162                            .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6163                            .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    6164                            .dwattr $C$DW$512, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6165                            .dwattr $C$DW$512, DW_AT_decl_line(0x20d)
    6166                            .dwattr $C$DW$512, DW_AT_decl_column(0x10)
    6167                    
    6168                    $C$DW$513       .dwtag  DW_TAG_member
    6169                            .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$31)
    6170                            .dwattr $C$DW$513, DW_AT_name("biasMode")
    6171                            .dwattr $C$DW$513, DW_AT_TI_symbol_name("biasMode")
    6172                            .dwattr $C$DW$513, DW_AT_bit_offset(0x0c)
    6173                            .dwattr $C$DW$513, DW_AT_bit_size(0x01)
    6174                            .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6175                            .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    6176                            .dwattr $C$DW$513, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6177                            .dwattr $C$DW$513, DW_AT_decl_line(0x213)
    6178                            .dwattr $C$DW$513, DW_AT_decl_column(0x10)
    6179                    
    6180                    $C$DW$514       .dwtag  DW_TAG_member
    6181                            .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$31)
    6182                            .dwattr $C$DW$514, DW_AT_name("analogCfgMode")
    6183                            .dwattr $C$DW$514, DW_AT_TI_symbol_name("analogCfgMode")
    6184                            .dwattr $C$DW$514, DW_AT_bit_offset(0x06)
    6185                            .dwattr $C$DW$514, DW_AT_bit_size(0x06)
    6186                            .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6187                            .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    6188                            .dwattr $C$DW$514, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6189                            .dwattr $C$DW$514, DW_AT_decl_line(0x215)
    6190                            .dwattr $C$DW$514, DW_AT_decl_column(0x10)
    6191                    
    6192                    $C$DW$515       .dwtag  DW_TAG_member
    6193                            .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$31)
    6194                            .dwattr $C$DW$515, DW_AT_name("bNoFsPowerUp")
    6195                            .dwattr $C$DW$515, DW_AT_TI_symbol_name("bNoFsPowerUp")
    6196                            .dwattr $C$DW$515, DW_AT_bit_offset(0x05)
    6197                            .dwattr $C$DW$515, DW_AT_bit_size(0x01)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{1C129E45-DDBE-43AE-90DD-CDEF4BAF1631} PAGE  115

    6198                            .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6199                            .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    6200                            .dwattr $C$DW$515, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6201                            .dwattr $C$DW$515, DW_AT_decl_line(0x21c)
    6202                            .dwattr $C$DW$515, DW_AT_decl_column(0x10)
    6203                    
    6204                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    6205                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x20c)
    6206                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x0b)
    6207                            .dwendtag $C$DW$T$41
    6208                    
    6209                    
    6210                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    6211                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    6212                    $C$DW$516       .dwtag  DW_TAG_member
    6213                            .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$22)
    6214                            .dwattr $C$DW$516, DW_AT_name("triggerType")
    6215                            .dwattr $C$DW$516, DW_AT_TI_symbol_name("triggerType")
    6216                            .dwattr $C$DW$516, DW_AT_bit_offset(0x04)
    6217                            .dwattr $C$DW$516, DW_AT_bit_size(0x04)
    6218                            .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6219                            .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    6220                            .dwattr $C$DW$516, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6221                            .dwattr $C$DW$516, DW_AT_decl_line(0x232)
    6222                            .dwattr $C$DW$516, DW_AT_decl_column(0x0f)
    6223                    
    6224                    $C$DW$517       .dwtag  DW_TAG_member
    6225                            .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$22)
    6226                            .dwattr $C$DW$517, DW_AT_name("bEnaCmd")
    6227                            .dwattr $C$DW$517, DW_AT_TI_symbol_name("bEnaCmd")
    6228                            .dwattr $C$DW$517, DW_AT_bit_offset(0x03)
    6229                            .dwattr $C$DW$517, DW_AT_bit_size(0x01)
    6230                            .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6231                            .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    6232                            .dwattr $C$DW$517, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6233                            .dwattr $C$DW$517, DW_AT_decl_line(0x233)
    6234                            .dwattr $C$DW$517, DW_AT_decl_column(0x0f)
    6235                    
    6236                    $C$DW$518       .dwtag  DW_TAG_member
    6237                            .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$22)
    6238                            .dwattr $C$DW$518, DW_AT_name("triggerNo")
    6239                            .dwattr $C$DW$518, DW_AT_TI_symbol_name("triggerNo")
    6240                            .dwattr $C$DW$518, DW_AT_bit_offset(0x01)
    6241                            .dwattr $C$DW$518, DW_AT_bit_size(0x02)
    6242                            .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6243                            .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    6244                            .dwattr $C$DW$518, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6245                            .dwattr $C$DW$518, DW_AT_decl_line(0x235)
    6246                            .dwattr $C$DW$518, DW_AT_decl_column(0x0f)
    6247                    
    6248                    $C$DW$519       .dwtag  DW_TAG_member
    6249                            .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$22)
    6250                            .dwattr $C$DW$519, DW_AT_name("pastTrig")
    6251                            .dwattr $C$DW$519, DW_AT_TI_symbol_name("pastTrig")
    6252                            .dwattr $C$DW$519, DW_AT_bit_offset(0x00)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{1C129E45-DDBE-43AE-90DD-CDEF4BAF1631} PAGE  116

    6253                            .dwattr $C$DW$519, DW_AT_bit_size(0x01)
    6254                            .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6255                            .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    6256                            .dwattr $C$DW$519, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6257                            .dwattr $C$DW$519, DW_AT_decl_line(0x236)
    6258                            .dwattr $C$DW$519, DW_AT_decl_column(0x0f)
    6259                    
    6260                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    6261                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x231)
    6262                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0b)
    6263                            .dwendtag $C$DW$T$42
    6264                    
    6265                    
    6266                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    6267                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    6268                    $C$DW$520       .dwtag  DW_TAG_member
    6269                            .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$22)
    6270                            .dwattr $C$DW$520, DW_AT_name("rule")
    6271                            .dwattr $C$DW$520, DW_AT_TI_symbol_name("rule")
    6272                            .dwattr $C$DW$520, DW_AT_bit_offset(0x04)
    6273                            .dwattr $C$DW$520, DW_AT_bit_size(0x04)
    6274                            .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6275                            .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    6276                            .dwattr $C$DW$520, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6277                            .dwattr $C$DW$520, DW_AT_decl_line(0x23a)
    6278                            .dwattr $C$DW$520, DW_AT_decl_column(0x0f)
    6279                    
    6280                    $C$DW$521       .dwtag  DW_TAG_member
    6281                            .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$22)
    6282                            .dwattr $C$DW$521, DW_AT_name("nSkip")
    6283                            .dwattr $C$DW$521, DW_AT_TI_symbol_name("nSkip")
    6284                            .dwattr $C$DW$521, DW_AT_bit_offset(0x00)
    6285                            .dwattr $C$DW$521, DW_AT_bit_size(0x04)
    6286                            .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6287                            .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    6288                            .dwattr $C$DW$521, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6289                            .dwattr $C$DW$521, DW_AT_decl_line(0x23b)
    6290                            .dwattr $C$DW$521, DW_AT_decl_column(0x0f)
    6291                    
    6292                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    6293                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x239)
    6294                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x0b)
    6295                            .dwendtag $C$DW$T$43
    6296                    
    6297                    
    6298                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    6299                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    6300                    $C$DW$522       .dwtag  DW_TAG_member
    6301                            .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$31)
    6302                            .dwattr $C$DW$522, DW_AT_name("modType")
    6303                            .dwattr $C$DW$522, DW_AT_TI_symbol_name("modType")
    6304                            .dwattr $C$DW$522, DW_AT_bit_offset(0x0d)
    6305                            .dwattr $C$DW$522, DW_AT_bit_size(0x03)
    6306                            .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6307                            .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{1C129E45-DDBE-43AE-90DD-CDEF4BAF1631} PAGE  117

    6308                            .dwattr $C$DW$522, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6309                            .dwattr $C$DW$522, DW_AT_decl_line(0x23e)
    6310                            .dwattr $C$DW$522, DW_AT_decl_column(0x10)
    6311                    
    6312                    $C$DW$523       .dwtag  DW_TAG_member
    6313                            .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$31)
    6314                            .dwattr $C$DW$523, DW_AT_name("deviation")
    6315                            .dwattr $C$DW$523, DW_AT_TI_symbol_name("deviation")
    6316                            .dwattr $C$DW$523, DW_AT_bit_offset(0x00)
    6317                            .dwattr $C$DW$523, DW_AT_bit_size(0x0d)
    6318                            .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6319                            .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    6320                            .dwattr $C$DW$523, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6321                            .dwattr $C$DW$523, DW_AT_decl_line(0x241)
    6322                            .dwattr $C$DW$523, DW_AT_decl_column(0x10)
    6323                    
    6324                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    6325                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x23d)
    6326                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x0b)
    6327                            .dwendtag $C$DW$T$44
    6328                    
    6329                    
    6330                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    6331                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x04)
    6332                    $C$DW$524       .dwtag  DW_TAG_member
    6333                            .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$37)
    6334                            .dwattr $C$DW$524, DW_AT_name("preScale")
    6335                            .dwattr $C$DW$524, DW_AT_TI_symbol_name("preScale")
    6336                            .dwattr $C$DW$524, DW_AT_bit_offset(0x1c)
    6337                            .dwattr $C$DW$524, DW_AT_bit_size(0x04)
    6338                            .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6339                            .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    6340                            .dwattr $C$DW$524, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6341                            .dwattr $C$DW$524, DW_AT_decl_line(0x244)
    6342                            .dwattr $C$DW$524, DW_AT_decl_column(0x10)
    6343                    
    6344                    $C$DW$525       .dwtag  DW_TAG_member
    6345                            .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$37)
    6346                            .dwattr $C$DW$525, DW_AT_name("rateWord")
    6347                            .dwattr $C$DW$525, DW_AT_TI_symbol_name("rateWord")
    6348                            .dwattr $C$DW$525, DW_AT_bit_offset(0x03)
    6349                            .dwattr $C$DW$525, DW_AT_bit_size(0x15)
    6350                            .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6351                            .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    6352                            .dwattr $C$DW$525, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6353                            .dwattr $C$DW$525, DW_AT_decl_line(0x246)
    6354                            .dwattr $C$DW$525, DW_AT_decl_column(0x10)
    6355                    
    6356                    $C$DW$526       .dwtag  DW_TAG_member
    6357                            .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$37)
    6358                            .dwattr $C$DW$526, DW_AT_name("decimMode")
    6359                            .dwattr $C$DW$526, DW_AT_TI_symbol_name("decimMode")
    6360                            .dwattr $C$DW$526, DW_AT_bit_offset(0x00)
    6361                            .dwattr $C$DW$526, DW_AT_bit_size(0x03)
    6362                            .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{1C129E45-DDBE-43AE-90DD-CDEF4BAF1631} PAGE  118

    6363                            .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    6364                            .dwattr $C$DW$526, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6365                            .dwattr $C$DW$526, DW_AT_decl_line(0x247)
    6366                            .dwattr $C$DW$526, DW_AT_decl_column(0x10)
    6367                    
    6368                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    6369                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x243)
    6370                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x0b)
    6371                            .dwendtag $C$DW$T$45
    6372                    
    6373                    
    6374                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    6375                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    6376                    $C$DW$527       .dwtag  DW_TAG_member
    6377                            .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$22)
    6378                            .dwattr $C$DW$527, DW_AT_name("nPreamBytes")
    6379                            .dwattr $C$DW$527, DW_AT_TI_symbol_name("nPreamBytes")
    6380                            .dwattr $C$DW$527, DW_AT_bit_offset(0x02)
    6381                            .dwattr $C$DW$527, DW_AT_bit_size(0x06)
    6382                            .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6383                            .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    6384                            .dwattr $C$DW$527, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6385                            .dwattr $C$DW$527, DW_AT_decl_line(0x24f)
    6386                            .dwattr $C$DW$527, DW_AT_decl_column(0x0f)
    6387                    
    6388                    $C$DW$528       .dwtag  DW_TAG_member
    6389                            .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$22)
    6390                            .dwattr $C$DW$528, DW_AT_name("preamMode")
    6391                            .dwattr $C$DW$528, DW_AT_TI_symbol_name("preamMode")
    6392                            .dwattr $C$DW$528, DW_AT_bit_offset(0x00)
    6393                            .dwattr $C$DW$528, DW_AT_bit_size(0x02)
    6394                            .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6395                            .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    6396                            .dwattr $C$DW$528, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6397                            .dwattr $C$DW$528, DW_AT_decl_line(0x255)
    6398                            .dwattr $C$DW$528, DW_AT_decl_column(0x0f)
    6399                    
    6400                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    6401                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x24e)
    6402                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x0b)
    6403                            .dwendtag $C$DW$T$46
    6404                    
    6405                    
    6406                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    6407                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    6408                    $C$DW$529       .dwtag  DW_TAG_member
    6409                            .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$31)
    6410                            .dwattr $C$DW$529, DW_AT_name("nSwBits")
    6411                            .dwattr $C$DW$529, DW_AT_TI_symbol_name("nSwBits")
    6412                            .dwattr $C$DW$529, DW_AT_bit_offset(0x0a)
    6413                            .dwattr $C$DW$529, DW_AT_bit_size(0x06)
    6414                            .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6415                            .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    6416                            .dwattr $C$DW$529, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6417                            .dwattr $C$DW$529, DW_AT_decl_line(0x25b)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{1C129E45-DDBE-43AE-90DD-CDEF4BAF1631} PAGE  119

    6418                            .dwattr $C$DW$529, DW_AT_decl_column(0x10)
    6419                    
    6420                    $C$DW$530       .dwtag  DW_TAG_member
    6421                            .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$31)
    6422                            .dwattr $C$DW$530, DW_AT_name("bBitReversal")
    6423                            .dwattr $C$DW$530, DW_AT_TI_symbol_name("bBitReversal")
    6424                            .dwattr $C$DW$530, DW_AT_bit_offset(0x09)
    6425                            .dwattr $C$DW$530, DW_AT_bit_size(0x01)
    6426                            .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6427                            .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    6428                            .dwattr $C$DW$530, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6429                            .dwattr $C$DW$530, DW_AT_decl_line(0x25c)
    6430                            .dwattr $C$DW$530, DW_AT_decl_column(0x10)
    6431                    
    6432                    $C$DW$531       .dwtag  DW_TAG_member
    6433                            .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$31)
    6434                            .dwattr $C$DW$531, DW_AT_name("bMsbFirst")
    6435                            .dwattr $C$DW$531, DW_AT_TI_symbol_name("bMsbFirst")
    6436                            .dwattr $C$DW$531, DW_AT_bit_offset(0x08)
    6437                            .dwattr $C$DW$531, DW_AT_bit_size(0x01)
    6438                            .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6439                            .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    6440                            .dwattr $C$DW$531, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6441                            .dwattr $C$DW$531, DW_AT_decl_line(0x25e)
    6442                            .dwattr $C$DW$531, DW_AT_decl_column(0x10)
    6443                    
    6444                    $C$DW$532       .dwtag  DW_TAG_member
    6445                            .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$31)
    6446                            .dwattr $C$DW$532, DW_AT_name("fecMode")
    6447                            .dwattr $C$DW$532, DW_AT_TI_symbol_name("fecMode")
    6448                            .dwattr $C$DW$532, DW_AT_bit_offset(0x04)
    6449                            .dwattr $C$DW$532, DW_AT_bit_size(0x04)
    6450                            .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6451                            .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    6452                            .dwattr $C$DW$532, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6453                            .dwattr $C$DW$532, DW_AT_decl_line(0x260)
    6454                            .dwattr $C$DW$532, DW_AT_decl_column(0x10)
    6455                    
    6456                    $C$DW$533       .dwtag  DW_TAG_member
    6457                            .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$31)
    6458                            .dwattr $C$DW$533, DW_AT_name("whitenMode")
    6459                            .dwattr $C$DW$533, DW_AT_TI_symbol_name("whitenMode")
    6460                            .dwattr $C$DW$533, DW_AT_bit_offset(0x00)
    6461                            .dwattr $C$DW$533, DW_AT_bit_size(0x03)
    6462                            .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6463                            .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    6464                            .dwattr $C$DW$533, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6465                            .dwattr $C$DW$533, DW_AT_decl_line(0x266)
    6466                            .dwattr $C$DW$533, DW_AT_decl_column(0x10)
    6467                    
    6468                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    6469                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x25a)
    6470                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x0b)
    6471                            .dwendtag $C$DW$T$47
    6472                    
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{1C129E45-DDBE-43AE-90DD-CDEF4BAF1631} PAGE  120

    6473                    
    6474                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    6475                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    6476                    $C$DW$534       .dwtag  DW_TAG_member
    6477                            .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$31)
    6478                            .dwattr $C$DW$534, DW_AT_name("frontEndMode")
    6479                            .dwattr $C$DW$534, DW_AT_TI_symbol_name("frontEndMode")
    6480                            .dwattr $C$DW$534, DW_AT_bit_offset(0x0d)
    6481                            .dwattr $C$DW$534, DW_AT_bit_size(0x03)
    6482                            .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6483                            .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    6484                            .dwattr $C$DW$534, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6485                            .dwattr $C$DW$534, DW_AT_decl_line(0x270)
    6486                            .dwattr $C$DW$534, DW_AT_decl_column(0x10)
    6487                    
    6488                    $C$DW$535       .dwtag  DW_TAG_member
    6489                            .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$31)
    6490                            .dwattr $C$DW$535, DW_AT_name("biasMode")
    6491                            .dwattr $C$DW$535, DW_AT_TI_symbol_name("biasMode")
    6492                            .dwattr $C$DW$535, DW_AT_bit_offset(0x0c)
    6493                            .dwattr $C$DW$535, DW_AT_bit_size(0x01)
    6494                            .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6495                            .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    6496                            .dwattr $C$DW$535, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6497                            .dwattr $C$DW$535, DW_AT_decl_line(0x276)
    6498                            .dwattr $C$DW$535, DW_AT_decl_column(0x10)
    6499                    
    6500                    $C$DW$536       .dwtag  DW_TAG_member
    6501                            .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$31)
    6502                            .dwattr $C$DW$536, DW_AT_name("analogCfgMode")
    6503                            .dwattr $C$DW$536, DW_AT_TI_symbol_name("analogCfgMode")
    6504                            .dwattr $C$DW$536, DW_AT_bit_offset(0x06)
    6505                            .dwattr $C$DW$536, DW_AT_bit_size(0x06)
    6506                            .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6507                            .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    6508                            .dwattr $C$DW$536, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6509                            .dwattr $C$DW$536, DW_AT_decl_line(0x278)
    6510                            .dwattr $C$DW$536, DW_AT_decl_column(0x10)
    6511                    
    6512                    $C$DW$537       .dwtag  DW_TAG_member
    6513                            .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$31)
    6514                            .dwattr $C$DW$537, DW_AT_name("bNoFsPowerUp")
    6515                            .dwattr $C$DW$537, DW_AT_TI_symbol_name("bNoFsPowerUp")
    6516                            .dwattr $C$DW$537, DW_AT_bit_offset(0x05)
    6517                            .dwattr $C$DW$537, DW_AT_bit_size(0x01)
    6518                            .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6519                            .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    6520                            .dwattr $C$DW$537, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6521                            .dwattr $C$DW$537, DW_AT_decl_line(0x27f)
    6522                            .dwattr $C$DW$537, DW_AT_decl_column(0x10)
    6523                    
    6524                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    6525                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x26f)
    6526                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x0b)
    6527                            .dwendtag $C$DW$T$48
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{1C129E45-DDBE-43AE-90DD-CDEF4BAF1631} PAGE  121

    6528                    
    6529                    
    6530                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    6531                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x24)
    6532                    $C$DW$538       .dwtag  DW_TAG_member
    6533                            .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$37)
    6534                            .dwattr $C$DW$538, DW_AT_name("nInactivityTimeout")
    6535                            .dwattr $C$DW$538, DW_AT_TI_symbol_name("nInactivityTimeout")
    6536                            .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6537                            .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    6538                            .dwattr $C$DW$538, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    6539                            .dwattr $C$DW$538, DW_AT_decl_line(0x50e)
    6540                            .dwattr $C$DW$538, DW_AT_decl_column(0x1d)
    6541                    
    6542                    $C$DW$539       .dwtag  DW_TAG_member
    6543                            .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$50)
    6544                            .dwattr $C$DW$539, DW_AT_name("pRfMode")
    6545                            .dwattr $C$DW$539, DW_AT_TI_symbol_name("pRfMode")
    6546                            .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6547                            .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    6548                            .dwattr $C$DW$539, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    6549                            .dwattr $C$DW$539, DW_AT_decl_line(0x50f)
    6550                            .dwattr $C$DW$539, DW_AT_decl_column(0x1d)
    6551                    
    6552                    $C$DW$540       .dwtag  DW_TAG_member
    6553                            .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$52)
    6554                            .dwattr $C$DW$540, DW_AT_name("pOpSetup")
    6555                            .dwattr $C$DW$540, DW_AT_TI_symbol_name("pOpSetup")
    6556                            .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6557                            .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    6558                            .dwattr $C$DW$540, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    6559                            .dwattr $C$DW$540, DW_AT_decl_line(0x510)
    6560                            .dwattr $C$DW$540, DW_AT_decl_column(0x1d)
    6561                    
    6562                    $C$DW$541       .dwtag  DW_TAG_member
    6563                            .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$37)
    6564                            .dwattr $C$DW$541, DW_AT_name("nPowerUpDuration")
    6565                            .dwattr $C$DW$541, DW_AT_TI_symbol_name("nPowerUpDuration")
    6566                            .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6567                            .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    6568                            .dwattr $C$DW$541, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    6569                            .dwattr $C$DW$541, DW_AT_decl_line(0x511)
    6570                            .dwattr $C$DW$541, DW_AT_decl_column(0x1d)
    6571                    
    6572                    $C$DW$542       .dwtag  DW_TAG_member
    6573                            .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$53)
    6574                            .dwattr $C$DW$542, DW_AT_name("bMeasurePowerUpDuration")
    6575                            .dwattr $C$DW$542, DW_AT_TI_symbol_name("bMeasurePowerUpDuration")
    6576                            .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6577                            .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    6578                            .dwattr $C$DW$542, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    6579                            .dwattr $C$DW$542, DW_AT_decl_line(0x512)
    6580                            .dwattr $C$DW$542, DW_AT_decl_column(0x1d)
    6581                    
    6582                    $C$DW$543       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{1C129E45-DDBE-43AE-90DD-CDEF4BAF1631} PAGE  122

    6583                            .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$53)
    6584                            .dwattr $C$DW$543, DW_AT_name("bUpdateSetup")
    6585                            .dwattr $C$DW$543, DW_AT_TI_symbol_name("bUpdateSetup")
    6586                            .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6587                            .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    6588                            .dwattr $C$DW$543, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    6589                            .dwattr $C$DW$543, DW_AT_decl_line(0x513)
    6590                            .dwattr $C$DW$543, DW_AT_decl_column(0x1d)
    6591                    
    6592                    $C$DW$544       .dwtag  DW_TAG_member
    6593                            .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$31)
    6594                            .dwattr $C$DW$544, DW_AT_name("nPowerUpDurationMargin")
    6595                            .dwattr $C$DW$544, DW_AT_TI_symbol_name("nPowerUpDurationMargin")
    6596                            .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6597                            .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    6598                            .dwattr $C$DW$544, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    6599                            .dwattr $C$DW$544, DW_AT_decl_line(0x514)
    6600                            .dwattr $C$DW$544, DW_AT_decl_column(0x1d)
    6601                    
    6602                    $C$DW$545       .dwtag  DW_TAG_member
    6603                            .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$3)
    6604                            .dwattr $C$DW$545, DW_AT_name("pPowerCb")
    6605                            .dwattr $C$DW$545, DW_AT_TI_symbol_name("pPowerCb")
    6606                            .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6607                            .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    6608                            .dwattr $C$DW$545, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    6609                            .dwattr $C$DW$545, DW_AT_decl_line(0x515)
    6610                            .dwattr $C$DW$545, DW_AT_decl_column(0x1d)
    6611                    
    6612                    $C$DW$546       .dwtag  DW_TAG_member
    6613                            .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$3)
    6614                            .dwattr $C$DW$546, DW_AT_name("pErrCb")
    6615                            .dwattr $C$DW$546, DW_AT_TI_symbol_name("pErrCb")
    6616                            .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6617                            .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    6618                            .dwattr $C$DW$546, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    6619                            .dwattr $C$DW$546, DW_AT_decl_line(0x516)
    6620                            .dwattr $C$DW$546, DW_AT_decl_column(0x1d)
    6621                    
    6622                    $C$DW$547       .dwtag  DW_TAG_member
    6623                            .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$3)
    6624                            .dwattr $C$DW$547, DW_AT_name("pClientEventCb")
    6625                            .dwattr $C$DW$547, DW_AT_TI_symbol_name("pClientEventCb")
    6626                            .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6627                            .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    6628                            .dwattr $C$DW$547, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    6629                            .dwattr $C$DW$547, DW_AT_decl_line(0x517)
    6630                            .dwattr $C$DW$547, DW_AT_decl_column(0x1d)
    6631                    
    6632                    $C$DW$548       .dwtag  DW_TAG_member
    6633                            .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$54)
    6634                            .dwattr $C$DW$548, DW_AT_name("nClientEventMask")
    6635                            .dwattr $C$DW$548, DW_AT_TI_symbol_name("nClientEventMask")
    6636                            .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6637                            .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{1C129E45-DDBE-43AE-90DD-CDEF4BAF1631} PAGE  123

    6638                            .dwattr $C$DW$548, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    6639                            .dwattr $C$DW$548, DW_AT_decl_line(0x518)
    6640                            .dwattr $C$DW$548, DW_AT_decl_column(0x1d)
    6641                    
    6642                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/
    6643                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x50d)
    6644                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x0c)
    6645                            .dwendtag $C$DW$T$55
    6646                    
    6647                    
    6648                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    6649                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x01)
    6650                    $C$DW$549       .dwtag  DW_TAG_member
    6651                            .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$22)
    6652                            .dwattr $C$DW$549, DW_AT_name("triggerType")
    6653                            .dwattr $C$DW$549, DW_AT_TI_symbol_name("triggerType")
    6654                            .dwattr $C$DW$549, DW_AT_bit_offset(0x04)
    6655                            .dwattr $C$DW$549, DW_AT_bit_size(0x04)
    6656                            .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6657                            .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    6658                            .dwattr $C$DW$549, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6659                            .dwattr $C$DW$549, DW_AT_decl_line(0xee)
    6660                            .dwattr $C$DW$549, DW_AT_decl_column(0x0f)
    6661                    
    6662                    $C$DW$550       .dwtag  DW_TAG_member
    6663                            .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$22)
    6664                            .dwattr $C$DW$550, DW_AT_name("bEnaCmd")
    6665                            .dwattr $C$DW$550, DW_AT_TI_symbol_name("bEnaCmd")
    6666                            .dwattr $C$DW$550, DW_AT_bit_offset(0x03)
    6667                            .dwattr $C$DW$550, DW_AT_bit_size(0x01)
    6668                            .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6669                            .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    6670                            .dwattr $C$DW$550, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6671                            .dwattr $C$DW$550, DW_AT_decl_line(0xef)
    6672                            .dwattr $C$DW$550, DW_AT_decl_column(0x0f)
    6673                    
    6674                    $C$DW$551       .dwtag  DW_TAG_member
    6675                            .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$22)
    6676                            .dwattr $C$DW$551, DW_AT_name("triggerNo")
    6677                            .dwattr $C$DW$551, DW_AT_TI_symbol_name("triggerNo")
    6678                            .dwattr $C$DW$551, DW_AT_bit_offset(0x01)
    6679                            .dwattr $C$DW$551, DW_AT_bit_size(0x02)
    6680                            .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6681                            .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    6682                            .dwattr $C$DW$551, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6683                            .dwattr $C$DW$551, DW_AT_decl_line(0xf1)
    6684                            .dwattr $C$DW$551, DW_AT_decl_column(0x0f)
    6685                    
    6686                    $C$DW$552       .dwtag  DW_TAG_member
    6687                            .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$22)
    6688                            .dwattr $C$DW$552, DW_AT_name("pastTrig")
    6689                            .dwattr $C$DW$552, DW_AT_TI_symbol_name("pastTrig")
    6690                            .dwattr $C$DW$552, DW_AT_bit_offset(0x00)
    6691                            .dwattr $C$DW$552, DW_AT_bit_size(0x01)
    6692                            .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:43 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{1C129E45-DDBE-43AE-90DD-CDEF4BAF1631} PAGE  124

    6693                            .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    6694                            .dwattr $C$DW$552, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    6695                            .dwattr $C$DW$552, DW_AT_decl_line(0xf2)
    6696                            .dwattr $C$DW$552, DW_AT_decl_column(0x0f)
    6697                    
    6698                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/
    6699                            .dwattr $C$DW$T$56, DW_AT_decl_line(0xed)
    6700                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x0b)
    6701                            .dwendtag $C$DW$T$56
    6702                    
    6703                    
    6704                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
    6705                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x01)
    6706                    $C$DW$553       .dwtag  DW_TAG_member
    6707                            .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$22)
    6708                            .dwattr $C$DW$553, DW_AT_name("rule")
