TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{8AA21B82-6045-4D02-9100-CF29D4218F3F} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.2.LTS *
       3                    ;* Date/Time created: Fri Nov 16 15:53:52 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/StartUp/macstack.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("D:\code\collector_cc1310lp\collector_cc1310lp")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{8AA21B82-6045-4D02-9100-CF29D4218F3F} PAGE  117

    6379                            .dwattr $C$DW$645, DW_AT_decl_column(0x05)
    6380                    
    6381                    $C$DW$646       .dwtag  DW_TAG_enumerator
    6382                            .dwattr $C$DW$646, DW_AT_name("MAC_RADIO_CC1352P")
    6383                            .dwattr $C$DW$646, DW_AT_const_value(0x02)
    6384                            .dwattr $C$DW$646, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.h")
    6385                            .dwattr $C$DW$646, DW_AT_decl_line(0x11e)
    6386                            .dwattr $C$DW$646, DW_AT_decl_column(0x05)
    6387                    
    6388                    $C$DW$647       .dwtag  DW_TAG_enumerator
    6389                            .dwattr $C$DW$647, DW_AT_name("MAC_RADIO_CCXXX2")
    6390                            .dwattr $C$DW$647, DW_AT_const_value(0x00)
    6391                            .dwattr $C$DW$647, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.h")
    6392                            .dwattr $C$DW$647, DW_AT_decl_line(0x11f)
    6393                            .dwattr $C$DW$647, DW_AT_decl_column(0x05)
    6394                    
    6395                            .dwattr $C$DW$T$1238, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.
    6396                            .dwattr $C$DW$T$1238, DW_AT_decl_line(0x118)
    6397                            .dwattr $C$DW$T$1238, DW_AT_decl_column(0x01)
    6398                            .dwendtag $C$DW$T$1238
    6399                    
    6400                    $C$DW$T$1239    .dwtag  DW_TAG_typedef
    6401                            .dwattr $C$DW$T$1239, DW_AT_name("macChipType_t")
    6402                            .dwattr $C$DW$T$1239, DW_AT_type(*$C$DW$T$1238)
    6403                            .dwattr $C$DW$T$1239, DW_AT_language(DW_LANG_C)
    6404                            .dwattr $C$DW$T$1239, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.
    6405                            .dwattr $C$DW$T$1239, DW_AT_decl_line(0x120)
    6406                            .dwattr $C$DW$T$1239, DW_AT_decl_column(0x03)
    6407                    
    6408                    
    6409                    $C$DW$T$1240    .dwtag  DW_TAG_enumeration_type
    6410                            .dwattr $C$DW$T$1240, DW_AT_byte_size(0x01)
    6411                    $C$DW$648       .dwtag  DW_TAG_enumerator
    6412                            .dwattr $C$DW$648, DW_AT_name("MAC_HW_REV_21")
    6413                            .dwattr $C$DW$648, DW_AT_const_value(0x00)
    6414                            .dwattr $C$DW$648, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.h")
    6415                            .dwattr $C$DW$648, DW_AT_decl_line(0x125)
    6416                            .dwattr $C$DW$648, DW_AT_decl_column(0x05)
    6417                    
    6418                    $C$DW$649       .dwtag  DW_TAG_enumerator
    6419                            .dwattr $C$DW$649, DW_AT_name("MAC_HW_REV_20")
    6420                            .dwattr $C$DW$649, DW_AT_const_value(0x01)
    6421                            .dwattr $C$DW$649, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.h")
    6422                            .dwattr $C$DW$649, DW_AT_decl_line(0x126)
    6423                            .dwattr $C$DW$649, DW_AT_decl_column(0x05)
    6424                    
    6425                    $C$DW$650       .dwtag  DW_TAG_enumerator
    6426                            .dwattr $C$DW$650, DW_AT_name("MAC_HW_MAX_REVS")
    6427                            .dwattr $C$DW$650, DW_AT_const_value(0x02)
    6428                            .dwattr $C$DW$650, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.h")
    6429                            .dwattr $C$DW$650, DW_AT_decl_line(0x127)
    6430                            .dwattr $C$DW$650, DW_AT_decl_column(0x05)
    6431                    
    6432                            .dwattr $C$DW$T$1240, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.
    6433                            .dwattr $C$DW$T$1240, DW_AT_decl_line(0x124)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{8AA21B82-6045-4D02-9100-CF29D4218F3F} PAGE  118

    6434                            .dwattr $C$DW$T$1240, DW_AT_decl_column(0x01)
    6435                            .dwendtag $C$DW$T$1240
    6436                    
    6437                    $C$DW$T$1241    .dwtag  DW_TAG_typedef
    6438                            .dwattr $C$DW$T$1241, DW_AT_name("macHwRevision_t")
    6439                            .dwattr $C$DW$T$1241, DW_AT_type(*$C$DW$T$1240)
    6440                            .dwattr $C$DW$T$1241, DW_AT_language(DW_LANG_C)
    6441                            .dwattr $C$DW$T$1241, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.
    6442                            .dwattr $C$DW$T$1241, DW_AT_decl_line(0x128)
    6443                            .dwattr $C$DW$T$1241, DW_AT_decl_column(0x03)
    6444                    
    6445                    
    6446                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    6447                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    6448                    $C$DW$651       .dwtag  DW_TAG_member
    6449                            .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$21)
    6450                            .dwattr $C$DW$651, DW_AT_name("event")
    6451                            .dwattr $C$DW$651, DW_AT_TI_symbol_name("event")
    6452                            .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6453                            .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    6454                            .dwattr $C$DW$651, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6455                            .dwattr $C$DW$651, DW_AT_decl_line(0x2b6)
    6456                            .dwattr $C$DW$651, DW_AT_decl_column(0x0b)
    6457                    
    6458                    $C$DW$652       .dwtag  DW_TAG_member
    6459                            .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$21)
    6460                            .dwattr $C$DW$652, DW_AT_name("status")
    6461                            .dwattr $C$DW$652, DW_AT_TI_symbol_name("status")
    6462                            .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6463                            .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    6464                            .dwattr $C$DW$652, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6465                            .dwattr $C$DW$652, DW_AT_decl_line(0x2b7)
    6466                            .dwattr $C$DW$652, DW_AT_decl_column(0x0b)
    6467                    
    6468                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    6469                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x2b5)
    6470                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x01)
    6471                            .dwendtag $C$DW$T$22
    6472                    
    6473                    $C$DW$T$38      .dwtag  DW_TAG_typedef
    6474                            .dwattr $C$DW$T$38, DW_AT_name("macEventHdr_t")
    6475                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$22)
    6476                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    6477                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    6478                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x2b8)
    6479                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x03)
    6480                    
    6481                    
    6482                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    6483                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x0a)
    6484                    $C$DW$653       .dwtag  DW_TAG_member
    6485                            .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$559)
    6486                            .dwattr $C$DW$653, DW_AT_name("addr")
    6487                            .dwattr $C$DW$653, DW_AT_TI_symbol_name("addr")
    6488                            .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{8AA21B82-6045-4D02-9100-CF29D4218F3F} PAGE  119

    6489                            .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    6490                            .dwattr $C$DW$653, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/api_mac.h")
    6491                            .dwattr $C$DW$653, DW_AT_decl_line(0x4db)
    6492                            .dwattr $C$DW$653, DW_AT_decl_column(0x07)
    6493                    
    6494                    $C$DW$654       .dwtag  DW_TAG_member
    6495                            .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$24)
    6496                            .dwattr $C$DW$654, DW_AT_name("addrMode")
    6497                            .dwattr $C$DW$654, DW_AT_TI_symbol_name("addrMode")
    6498                            .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6499                            .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    6500                            .dwattr $C$DW$654, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/api_mac.h")
    6501                            .dwattr $C$DW$654, DW_AT_decl_line(0x4de)
    6502                            .dwattr $C$DW$654, DW_AT_decl_column(0x17)
    6503                    
    6504                            .dwattr $C$DW$T$25, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/api_mac.h")
    6505                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x4d0)
    6506                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    6507                            .dwendtag $C$DW$T$25
    6508                    
    6509                    $C$DW$T$817     .dwtag  DW_TAG_typedef
    6510                            .dwattr $C$DW$T$817, DW_AT_name("ApiMac_sAddr_t")
    6511                            .dwattr $C$DW$T$817, DW_AT_type(*$C$DW$T$25)
    6512                            .dwattr $C$DW$T$817, DW_AT_language(DW_LANG_C)
    6513                            .dwattr $C$DW$T$817, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/api_mac.h")
    6514                            .dwattr $C$DW$T$817, DW_AT_decl_line(0x4df)
    6515                            .dwattr $C$DW$T$817, DW_AT_decl_column(0x03)
    6516                    
    6517                    
    6518                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    6519                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x0a)
    6520                    $C$DW$655       .dwtag  DW_TAG_member
    6521                            .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$560)
    6522                            .dwattr $C$DW$655, DW_AT_name("addr")
    6523                            .dwattr $C$DW$655, DW_AT_TI_symbol_name("addr")
    6524                            .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6525                            .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    6526                            .dwattr $C$DW$655, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/Services/saddr.h")
    6527                            .dwattr $C$DW$655, DW_AT_decl_line(0x55)
    6528                            .dwattr $C$DW$655, DW_AT_decl_column(0x05)
    6529                    
    6530                    $C$DW$656       .dwtag  DW_TAG_member
    6531                            .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$27)
    6532                            .dwattr $C$DW$656, DW_AT_name("addrMode")
    6533                            .dwattr $C$DW$656, DW_AT_TI_symbol_name("addrMode")
    6534                            .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6535                            .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    6536                            .dwattr $C$DW$656, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/Services/saddr.h")
    6537                            .dwattr $C$DW$656, DW_AT_decl_line(0x56)
    6538                            .dwattr $C$DW$656, DW_AT_decl_column(0x13)
    6539                    
    6540                            .dwattr $C$DW$T$28, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/Services/saddr.h")
    6541                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x50)
    6542                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x01)
    6543                            .dwendtag $C$DW$T$28
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{8AA21B82-6045-4D02-9100-CF29D4218F3F} PAGE  120

    6544                    
    6545                    $C$DW$T$29      .dwtag  DW_TAG_typedef
    6546                            .dwattr $C$DW$T$29, DW_AT_name("sAddr_t")
    6547                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    6548                            .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    6549                            .dwattr $C$DW$T$29, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/Services/saddr.h")
    6550                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x57)
    6551                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x03)
    6552                    
    6553                    $C$DW$T$94      .dwtag  DW_TAG_pointer_type
    6554                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$29)
    6555                            .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
    6556                    
    6557                    
    6558                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    6559                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x24)
    6560                    $C$DW$657       .dwtag  DW_TAG_member
    6561                            .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$29)
    6562                            .dwattr $C$DW$657, DW_AT_name("coordAddress")
    6563                            .dwattr $C$DW$657, DW_AT_TI_symbol_name("coordAddress")
    6564                            .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6565                            .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    6566                            .dwattr $C$DW$657, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6567                            .dwattr $C$DW$657, DW_AT_decl_line(0x3e1)
    6568                            .dwattr $C$DW$657, DW_AT_decl_column(0x11)
    6569                    
    6570                    $C$DW$658       .dwtag  DW_TAG_member
    6571                            .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$30)
    6572                            .dwattr $C$DW$658, DW_AT_name("coordPanId")
    6573                            .dwattr $C$DW$658, DW_AT_TI_symbol_name("coordPanId")
    6574                            .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6575                            .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    6576                            .dwattr $C$DW$658, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6577                            .dwattr $C$DW$658, DW_AT_decl_line(0x3e2)
    6578                            .dwattr $C$DW$658, DW_AT_decl_column(0x11)
    6579                    
    6580                    $C$DW$659       .dwtag  DW_TAG_member
    6581                            .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$30)
    6582                            .dwattr $C$DW$659, DW_AT_name("superframeSpec")
    6583                            .dwattr $C$DW$659, DW_AT_TI_symbol_name("superframeSpec")
    6584                            .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6585                            .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    6586                            .dwattr $C$DW$659, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6587                            .dwattr $C$DW$659, DW_AT_decl_line(0x3e3)
    6588                            .dwattr $C$DW$659, DW_AT_decl_column(0x11)
    6589                    
    6590                    $C$DW$660       .dwtag  DW_TAG_member
    6591                            .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$21)
    6592                            .dwattr $C$DW$660, DW_AT_name("logicalChannel")
    6593                            .dwattr $C$DW$660, DW_AT_TI_symbol_name("logicalChannel")
    6594                            .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6595                            .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    6596                            .dwattr $C$DW$660, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6597                            .dwattr $C$DW$660, DW_AT_decl_line(0x3e4)
    6598                            .dwattr $C$DW$660, DW_AT_decl_column(0x11)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{8AA21B82-6045-4D02-9100-CF29D4218F3F} PAGE  121

    6599                    
    6600                    $C$DW$661       .dwtag  DW_TAG_member
    6601                            .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$21)
    6602                            .dwattr $C$DW$661, DW_AT_name("channelPage")
    6603                            .dwattr $C$DW$661, DW_AT_TI_symbol_name("channelPage")
    6604                            .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    6605                            .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    6606                            .dwattr $C$DW$661, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6607                            .dwattr $C$DW$661, DW_AT_decl_line(0x3e5)
    6608                            .dwattr $C$DW$661, DW_AT_decl_column(0x11)
    6609                    
    6610                    $C$DW$662       .dwtag  DW_TAG_member
    6611                            .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$31)
    6612                            .dwattr $C$DW$662, DW_AT_name("gtsPermit")
    6613                            .dwattr $C$DW$662, DW_AT_TI_symbol_name("gtsPermit")
    6614                            .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6615                            .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    6616                            .dwattr $C$DW$662, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6617                            .dwattr $C$DW$662, DW_AT_decl_line(0x3e6)
    6618                            .dwattr $C$DW$662, DW_AT_decl_column(0x11)
    6619                    
    6620                    $C$DW$663       .dwtag  DW_TAG_member
    6621                            .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$21)
    6622                            .dwattr $C$DW$663, DW_AT_name("linkQuality")
    6623                            .dwattr $C$DW$663, DW_AT_TI_symbol_name("linkQuality")
    6624                            .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6625                            .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    6626                            .dwattr $C$DW$663, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6627                            .dwattr $C$DW$663, DW_AT_decl_line(0x3e7)
    6628                            .dwattr $C$DW$663, DW_AT_decl_column(0x11)
    6629                    
    6630                    $C$DW$664       .dwtag  DW_TAG_member
    6631                            .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$32)
    6632                            .dwattr $C$DW$664, DW_AT_name("timestamp")
    6633                            .dwattr $C$DW$664, DW_AT_TI_symbol_name("timestamp")
    6634                            .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6635                            .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    6636                            .dwattr $C$DW$664, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6637                            .dwattr $C$DW$664, DW_AT_decl_line(0x3e8)
    6638                            .dwattr $C$DW$664, DW_AT_decl_column(0x11)
    6639                    
    6640                    $C$DW$665       .dwtag  DW_TAG_member
    6641                            .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$31)
    6642                            .dwattr $C$DW$665, DW_AT_name("securityFailure")
    6643                            .dwattr $C$DW$665, DW_AT_TI_symbol_name("securityFailure")
    6644                            .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6645                            .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    6646                            .dwattr $C$DW$665, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6647                            .dwattr $C$DW$665, DW_AT_decl_line(0x3e9)
    6648                            .dwattr $C$DW$665, DW_AT_decl_column(0x11)
    6649                    
    6650                    $C$DW$666       .dwtag  DW_TAG_member
    6651                            .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$33)
    6652                            .dwattr $C$DW$666, DW_AT_name("sec")
    6653                            .dwattr $C$DW$666, DW_AT_TI_symbol_name("sec")
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{8AA21B82-6045-4D02-9100-CF29D4218F3F} PAGE  122

    6654                            .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    6655                            .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    6656                            .dwattr $C$DW$666, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6657                            .dwattr $C$DW$666, DW_AT_decl_line(0x3ea)
    6658                            .dwattr $C$DW$666, DW_AT_decl_column(0x11)
    6659                    
    6660                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    6661                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x3e0)
    6662                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x01)
    6663                            .dwendtag $C$DW$T$34
    6664                    
    6665                    $C$DW$T$76      .dwtag  DW_TAG_typedef
    6666                            .dwattr $C$DW$T$76, DW_AT_name("macPanDesc_t")
    6667                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$34)
    6668                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    6669                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    6670                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x3eb)
    6671                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    6672                    
    6673                    $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    6674                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    6675                            .dwattr $C$DW$T$77, DW_AT_address_class(0x20)
    6676                    
    6677                    
    6678                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6679                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x2c)
    6680                    $C$DW$667       .dwtag  DW_TAG_member
    6681                            .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$35)
    6682                            .dwattr $C$DW$667, DW_AT_name("scanChannels")
    6683                            .dwattr $C$DW$667, DW_AT_TI_symbol_name("scanChannels")
    6684                            .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6685                            .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    6686                            .dwattr $C$DW$667, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6687                            .dwattr $C$DW$667, DW_AT_decl_line(0x421)
    6688                            .dwattr $C$DW$667, DW_AT_decl_column(0x14)
    6689                    
    6690                    $C$DW$668       .dwtag  DW_TAG_member
    6691                            .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$21)
    6692                            .dwattr $C$DW$668, DW_AT_name("scanType")
    6693                            .dwattr $C$DW$668, DW_AT_TI_symbol_name("scanType")
    6694                            .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6695                            .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    6696                            .dwattr $C$DW$668, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6697                            .dwattr $C$DW$668, DW_AT_decl_line(0x422)
    6698                            .dwattr $C$DW$668, DW_AT_decl_column(0x14)
    6699                    
    6700                    $C$DW$669       .dwtag  DW_TAG_member
    6701                            .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$21)
    6702                            .dwattr $C$DW$669, DW_AT_name("scanDuration")
    6703                            .dwattr $C$DW$669, DW_AT_TI_symbol_name("scanDuration")
    6704                            .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6705                            .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    6706                            .dwattr $C$DW$669, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6707                            .dwattr $C$DW$669, DW_AT_decl_line(0x423)
    6708                            .dwattr $C$DW$669, DW_AT_decl_column(0x14)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{8AA21B82-6045-4D02-9100-CF29D4218F3F} PAGE  123

    6709                    
    6710                    $C$DW$670       .dwtag  DW_TAG_member
    6711                            .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$21)
    6712                            .dwattr $C$DW$670, DW_AT_name("channelPage")
    6713                            .dwattr $C$DW$670, DW_AT_TI_symbol_name("channelPage")
    6714                            .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    6715                            .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    6716                            .dwattr $C$DW$670, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6717                            .dwattr $C$DW$670, DW_AT_decl_line(0x424)
    6718                            .dwattr $C$DW$670, DW_AT_decl_column(0x14)
    6719                    
    6720                    $C$DW$671       .dwtag  DW_TAG_member
    6721                            .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$21)
    6722                            .dwattr $C$DW$671, DW_AT_name("phyID")
    6723                            .dwattr $C$DW$671, DW_AT_TI_symbol_name("phyID")
    6724                            .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6725                            .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    6726                            .dwattr $C$DW$671, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6727                            .dwattr $C$DW$671, DW_AT_decl_line(0x425)
    6728                            .dwattr $C$DW$671, DW_AT_decl_column(0x14)
    6729                    
    6730                    $C$DW$672       .dwtag  DW_TAG_member
    6731                            .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$21)
    6732                            .dwattr $C$DW$672, DW_AT_name("maxResults")
    6733                            .dwattr $C$DW$672, DW_AT_TI_symbol_name("maxResults")
    6734                            .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    6735                            .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    6736                            .dwattr $C$DW$672, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6737                            .dwattr $C$DW$672, DW_AT_decl_line(0x426)
    6738                            .dwattr $C$DW$672, DW_AT_decl_column(0x14)
    6739                    
    6740                    $C$DW$673       .dwtag  DW_TAG_member
    6741                            .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$31)
    6742                            .dwattr $C$DW$673, DW_AT_name("permitJoining")
    6743                            .dwattr $C$DW$673, DW_AT_TI_symbol_name("permitJoining")
    6744                            .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6745                            .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    6746                            .dwattr $C$DW$673, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6747                            .dwattr $C$DW$673, DW_AT_decl_line(0x427)
    6748                            .dwattr $C$DW$673, DW_AT_decl_column(0x14)
    6749                    
    6750                    $C$DW$674       .dwtag  DW_TAG_member
    6751                            .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$21)
    6752                            .dwattr $C$DW$674, DW_AT_name("linkQuality")
    6753                            .dwattr $C$DW$674, DW_AT_TI_symbol_name("linkQuality")
    6754                            .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    6755                            .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    6756                            .dwattr $C$DW$674, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6757                            .dwattr $C$DW$674, DW_AT_decl_line(0x429)
    6758                            .dwattr $C$DW$674, DW_AT_decl_column(0x14)
    6759                    
    6760                    $C$DW$675       .dwtag  DW_TAG_member
    6761                            .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$21)
    6762                            .dwattr $C$DW$675, DW_AT_name("percentFilter")
    6763                            .dwattr $C$DW$675, DW_AT_TI_symbol_name("percentFilter")
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{8AA21B82-6045-4D02-9100-CF29D4218F3F} PAGE  124

    6764                            .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6765                            .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    6766                            .dwattr $C$DW$675, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6767                            .dwattr $C$DW$675, DW_AT_decl_line(0x42b)
    6768                            .dwattr $C$DW$675, DW_AT_decl_column(0x14)
    6769                    
    6770                    $C$DW$676       .dwtag  DW_TAG_member
    6771                            .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$33)
    6772                            .dwattr $C$DW$676, DW_AT_name("sec")
    6773                            .dwattr $C$DW$676, DW_AT_TI_symbol_name("sec")
    6774                            .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    6775                            .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    6776                            .dwattr $C$DW$676, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6777                            .dwattr $C$DW$676, DW_AT_decl_line(0x42e)
    6778                            .dwattr $C$DW$676, DW_AT_decl_column(0x14)
    6779                    
    6780                    $C$DW$677       .dwtag  DW_TAG_member
    6781                            .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$31)
    6782                            .dwattr $C$DW$677, DW_AT_name("MPMScan")
    6783                            .dwattr $C$DW$677, DW_AT_TI_symbol_name("MPMScan")
    6784                            .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6785                            .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    6786                            .dwattr $C$DW$677, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6787                            .dwattr $C$DW$677, DW_AT_decl_line(0x42f)
    6788                            .dwattr $C$DW$677, DW_AT_decl_column(0x14)
    6789                    
    6790                    $C$DW$678       .dwtag  DW_TAG_member
    6791                            .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$21)
    6792                            .dwattr $C$DW$678, DW_AT_name("MPMScanType")
    6793                            .dwattr $C$DW$678, DW_AT_TI_symbol_name("MPMScanType")
    6794                            .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    6795                            .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    6796                            .dwattr $C$DW$678, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6797                            .dwattr $C$DW$678, DW_AT_decl_line(0x431)
    6798                            .dwattr $C$DW$678, DW_AT_decl_column(0x14)
    6799                    
    6800                    $C$DW$679       .dwtag  DW_TAG_member
    6801                            .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$30)
    6802                            .dwattr $C$DW$679, DW_AT_name("MPMScanDuration")
    6803                            .dwattr $C$DW$679, DW_AT_TI_symbol_name("MPMScanDuration")
    6804                            .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    6805                            .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    6806                            .dwattr $C$DW$679, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6807                            .dwattr $C$DW$679, DW_AT_decl_line(0x432)
    6808                            .dwattr $C$DW$679, DW_AT_decl_column(0x14)
    6809                    
    6810                    $C$DW$680       .dwtag  DW_TAG_member
    6811                            .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$561)
    6812                            .dwattr $C$DW$680, DW_AT_name("result")
    6813                            .dwattr $C$DW$680, DW_AT_TI_symbol_name("result")
    6814                            .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6815                            .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    6816                            .dwattr $C$DW$680, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6817                            .dwattr $C$DW$680, DW_AT_decl_line(0x440)
    6818                            .dwattr $C$DW$680, DW_AT_decl_column(0x05)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{8AA21B82-6045-4D02-9100-CF29D4218F3F} PAGE  125

    6819                    
    6820                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    6821                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x420)
    6822                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    6823                            .dwendtag $C$DW$T$36
    6824                    
    6825                    $C$DW$T$562     .dwtag  DW_TAG_typedef
    6826                            .dwattr $C$DW$T$562, DW_AT_name("macMlmeScanReq_t")
    6827                            .dwattr $C$DW$T$562, DW_AT_type(*$C$DW$T$36)
    6828                            .dwattr $C$DW$T$562, DW_AT_language(DW_LANG_C)
    6829                            .dwattr $C$DW$T$562, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154st
    6830                            .dwattr $C$DW$T$562, DW_AT_decl_line(0x441)
    6831                            .dwattr $C$DW$T$562, DW_AT_decl_column(0x03)
    6832                    
    6833                    
    6834                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    6835                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    6836                    $C$DW$681       .dwtag  DW_TAG_member
    6837                            .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$21)
    6838                            .dwattr $C$DW$681, DW_AT_name("msduHandle")
    6839                            .dwattr $C$DW$681, DW_AT_TI_symbol_name("msduHandle")
    6840                            .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6841                            .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    6842                            .dwattr $C$DW$681, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6843                            .dwattr $C$DW$681, DW_AT_decl_line(0x160)
    6844                            .dwattr $C$DW$681, DW_AT_decl_column(0x1f)
    6845                    
    6846                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    6847                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x15f)
    6848                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    6849                            .dwendtag $C$DW$T$37
    6850                    
    6851                    $C$DW$T$563     .dwtag  DW_TAG_typedef
    6852                            .dwattr $C$DW$T$563, DW_AT_name("macMcpsPurgeReq_t")
    6853                            .dwattr $C$DW$T$563, DW_AT_type(*$C$DW$T$37)
    6854                            .dwattr $C$DW$T$563, DW_AT_language(DW_LANG_C)
    6855                            .dwattr $C$DW$T$563, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154st
    6856                            .dwattr $C$DW$T$563, DW_AT_decl_line(0x161)
    6857                            .dwattr $C$DW$T$563, DW_AT_decl_column(0x03)
    6858                    
    6859                    
    6860                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6861                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x38)
    6862                    $C$DW$682       .dwtag  DW_TAG_member
    6863                            .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$38)
    6864                            .dwattr $C$DW$682, DW_AT_name("hdr")
    6865                            .dwattr $C$DW$682, DW_AT_TI_symbol_name("hdr")
    6866                            .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6867                            .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    6868                            .dwattr $C$DW$682, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6869                            .dwattr $C$DW$682, DW_AT_decl_line(0x167)
    6870                            .dwattr $C$DW$682, DW_AT_decl_column(0x1f)
    6871                    
    6872                    $C$DW$683       .dwtag  DW_TAG_member
    6873                            .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$564)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{8AA21B82-6045-4D02-9100-CF29D4218F3F} PAGE  126

    6874                            .dwattr $C$DW$683, DW_AT_name("mac")
    6875                            .dwattr $C$DW$683, DW_AT_TI_symbol_name("mac")
    6876                            .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6877                            .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    6878                            .dwattr $C$DW$683, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6879                            .dwattr $C$DW$683, DW_AT_decl_line(0x170)
    6880                            .dwattr $C$DW$683, DW_AT_decl_column(0x05)
    6881                    
    6882                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    6883                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x166)
    6884                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    6885                            .dwendtag $C$DW$T$39
    6886                    
    6887                    $C$DW$T$572     .dwtag  DW_TAG_typedef
    6888                            .dwattr $C$DW$T$572, DW_AT_name("macApiEvent_t")
    6889                            .dwattr $C$DW$T$572, DW_AT_type(*$C$DW$T$39)
    6890                            .dwattr $C$DW$T$572, DW_AT_language(DW_LANG_C)
    6891                            .dwattr $C$DW$T$572, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154st
    6892                            .dwattr $C$DW$T$572, DW_AT_decl_line(0x171)
    6893                            .dwattr $C$DW$T$572, DW_AT_decl_column(0x03)
    6894                    
    6895                    
    6896                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6897                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x08)
    6898                    $C$DW$684       .dwtag  DW_TAG_member
    6899                            .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$40)
    6900                            .dwattr $C$DW$684, DW_AT_name("p")
    6901                            .dwattr $C$DW$684, DW_AT_TI_symbol_name("p")
    6902                            .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6903                            .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    6904                            .dwattr $C$DW$684, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/Services/sdata.h")
    6905                            .dwattr $C$DW$684, DW_AT_decl_line(0x3d)
    6906                            .dwattr $C$DW$684, DW_AT_decl_column(0x0e)
    6907                    
    6908                    $C$DW$685       .dwtag  DW_TAG_member
    6909                            .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$30)
    6910                            .dwattr $C$DW$685, DW_AT_name("len")
    6911                            .dwattr $C$DW$685, DW_AT_TI_symbol_name("len")
    6912                            .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6913                            .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    6914                            .dwattr $C$DW$685, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/Services/sdata.h")
    6915                            .dwattr $C$DW$685, DW_AT_decl_line(0x3e)
    6916                            .dwattr $C$DW$685, DW_AT_decl_column(0x0e)
    6917                    
    6918                            .dwattr $C$DW$T$41, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/Services/sdata.h")
    6919                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x3c)
    6920                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    6921                            .dwendtag $C$DW$T$41
    6922                    
    6923                    $C$DW$T$62      .dwtag  DW_TAG_typedef
    6924                            .dwattr $C$DW$T$62, DW_AT_name("sData_t")
    6925                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$41)
    6926                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    6927                            .dwattr $C$DW$T$62, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/Services/sdata.h")
    6928                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x3f)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{8AA21B82-6045-4D02-9100-CF29D4218F3F} PAGE  127

    6929                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
    6930                    
    6931                    
    6932                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    6933                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x0a)
    6934                    $C$DW$686       .dwtag  DW_TAG_member
    6935                            .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$42)
    6936                            .dwattr $C$DW$686, DW_AT_name("lookupData")
    6937                            .dwattr $C$DW$686, DW_AT_TI_symbol_name("lookupData")
    6938                            .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6939                            .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    6940                            .dwattr $C$DW$686, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6941                            .dwattr $C$DW$686, DW_AT_decl_line(0x2c6)
    6942                            .dwattr $C$DW$686, DW_AT_decl_column(0x16)
    6943                    
    6944                    $C$DW$687       .dwtag  DW_TAG_member
    6945                            .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$21)
    6946                            .dwattr $C$DW$687, DW_AT_name("lookupDataSize")
    6947                            .dwattr $C$DW$687, DW_AT_TI_symbol_name("lookupDataSize")
    6948                            .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6949                            .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    6950                            .dwattr $C$DW$687, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6951                            .dwattr $C$DW$687, DW_AT_decl_line(0x2c7)
    6952                            .dwattr $C$DW$687, DW_AT_decl_column(0x16)
    6953                    
    6954                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    6955                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x2c5)
    6956                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x01)
    6957                            .dwendtag $C$DW$T$43
    6958                    
    6959                    $C$DW$T$46      .dwtag  DW_TAG_typedef
    6960                            .dwattr $C$DW$T$46, DW_AT_name("keyIdLookupDescriptor_t")
    6961                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$43)
    6962                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    6963                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    6964                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x2c8)
    6965                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x03)
    6966                    
    6967                    $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    6968                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    6969                            .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    6970                    
    6971                    
    6972                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    6973                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
    6974                    $C$DW$688       .dwtag  DW_TAG_member
    6975                            .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$30)
    6976                            .dwattr $C$DW$688, DW_AT_name("deviceDescriptorHandle")
    6977                            .dwattr $C$DW$688, DW_AT_TI_symbol_name("deviceDescriptorHandle")
    6978                            .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6979                            .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    6980                            .dwattr $C$DW$688, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6981                            .dwattr $C$DW$688, DW_AT_decl_line(0x2cd)
    6982                            .dwattr $C$DW$688, DW_AT_decl_column(0x16)
    6983                    
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{8AA21B82-6045-4D02-9100-CF29D4218F3F} PAGE  128

    6984                    $C$DW$689       .dwtag  DW_TAG_member
    6985                            .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$31)
    6986                            .dwattr $C$DW$689, DW_AT_name("uniqueDevice")
    6987                            .dwattr $C$DW$689, DW_AT_TI_symbol_name("uniqueDevice")
    6988                            .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6989                            .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    6990                            .dwattr $C$DW$689, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    6991                            .dwattr $C$DW$689, DW_AT_decl_line(0x2ce)
    6992                            .dwattr $C$DW$689, DW_AT_decl_column(0x16)
    6993                    
    6994                    $C$DW$690       .dwtag  DW_TAG_member
    6995                            .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$31)
    6996                            .dwattr $C$DW$690, DW_AT_name("blackListed")
    6997                            .dwattr $C$DW$690, DW_AT_TI_symbol_name("blackListed")
    6998                            .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6999                            .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    7000                            .dwattr $C$DW$690, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7001                            .dwattr $C$DW$690, DW_AT_decl_line(0x2cf)
    7002                            .dwattr $C$DW$690, DW_AT_decl_column(0x16)
    7003                    
    7004                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    7005                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x2cc)
    7006                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    7007                            .dwendtag $C$DW$T$44
    7008                    
    7009                    $C$DW$T$48      .dwtag  DW_TAG_typedef
    7010                            .dwattr $C$DW$T$48, DW_AT_name("keyDeviceDescriptor_t")
    7011                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$44)
    7012                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    7013                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    7014                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x2d0)
    7015                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x03)
    7016                    
    7017                    $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    7018                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    7019                            .dwattr $C$DW$T$49, DW_AT_address_class(0x20)
    7020                    
    7021                    
    7022                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    7023                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    7024                    $C$DW$691       .dwtag  DW_TAG_member
    7025                            .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$21)
    7026                            .dwattr $C$DW$691, DW_AT_name("frameType")
    7027                            .dwattr $C$DW$691, DW_AT_TI_symbol_name("frameType")
    7028                            .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7029                            .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    7030                            .dwattr $C$DW$691, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7031                            .dwattr $C$DW$691, DW_AT_decl_line(0x2d5)
    7032                            .dwattr $C$DW$691, DW_AT_decl_column(0x16)
    7033                    
    7034                    $C$DW$692       .dwtag  DW_TAG_member
    7035                            .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$21)
    7036                            .dwattr $C$DW$692, DW_AT_name("cmdFrameId")
    7037                            .dwattr $C$DW$692, DW_AT_TI_symbol_name("cmdFrameId")
    7038                            .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{8AA21B82-6045-4D02-9100-CF29D4218F3F} PAGE  129

    7039                            .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    7040                            .dwattr $C$DW$692, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7041                            .dwattr $C$DW$692, DW_AT_decl_line(0x2d6)
    7042                            .dwattr $C$DW$692, DW_AT_decl_column(0x16)
    7043                    
    7044                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    7045                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x2d4)
    7046                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x01)
    7047                            .dwendtag $C$DW$T$45
    7048                    
    7049                    $C$DW$T$50      .dwtag  DW_TAG_typedef
    7050                            .dwattr $C$DW$T$50, DW_AT_name("keyUsageDescriptor_t")
    7051                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$45)
    7052                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    7053                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    7054                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2d7)
    7055                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x03)
    7056                    
    7057                    $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    7058                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    7059                            .dwattr $C$DW$T$51, DW_AT_address_class(0x20)
    7060                    
    7061                    
    7062                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    7063                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x2c)
    7064                    $C$DW$693       .dwtag  DW_TAG_member
    7065                            .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$47)
    7066                            .dwattr $C$DW$693, DW_AT_name("keyIdLookupList")
    7067                            .dwattr $C$DW$693, DW_AT_TI_symbol_name("keyIdLookupList")
    7068                            .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7069                            .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    7070                            .dwattr $C$DW$693, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7071                            .dwattr $C$DW$693, DW_AT_decl_line(0x2dc)
    7072                            .dwattr $C$DW$693, DW_AT_decl_column(0x1d)
    7073                    
    7074                    $C$DW$694       .dwtag  DW_TAG_member
    7075                            .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$21)
    7076                            .dwattr $C$DW$694, DW_AT_name("keyIdLookupEntries")
    7077                            .dwattr $C$DW$694, DW_AT_TI_symbol_name("keyIdLookupEntries")
    7078                            .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7079                            .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    7080                            .dwattr $C$DW$694, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7081                            .dwattr $C$DW$694, DW_AT_decl_line(0x2dd)
    7082                            .dwattr $C$DW$694, DW_AT_decl_column(0x1c)
    7083                    
    7084                    $C$DW$695       .dwtag  DW_TAG_member
    7085                            .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$49)
    7086                            .dwattr $C$DW$695, DW_AT_name("keyDeviceList")
    7087                            .dwattr $C$DW$695, DW_AT_TI_symbol_name("keyDeviceList")
    7088                            .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7089                            .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    7090                            .dwattr $C$DW$695, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7091                            .dwattr $C$DW$695, DW_AT_decl_line(0x2df)
    7092                            .dwattr $C$DW$695, DW_AT_decl_column(0x1d)
    7093                    
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{8AA21B82-6045-4D02-9100-CF29D4218F3F} PAGE  130

    7094                    $C$DW$696       .dwtag  DW_TAG_member
    7095                            .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$30)
    7096                            .dwattr $C$DW$696, DW_AT_name("keyDeviceListEntries")
    7097                            .dwattr $C$DW$696, DW_AT_TI_symbol_name("keyDeviceListEntries")
    7098                            .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7099                            .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    7100                            .dwattr $C$DW$696, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7101                            .dwattr $C$DW$696, DW_AT_decl_line(0x2e2)
    7102                            .dwattr $C$DW$696, DW_AT_decl_column(0x1d)
    7103                    
    7104                    $C$DW$697       .dwtag  DW_TAG_member
    7105                            .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$51)
    7106                            .dwattr $C$DW$697, DW_AT_name("keyUsageList")
    7107                            .dwattr $C$DW$697, DW_AT_TI_symbol_name("keyUsageList")
    7108                            .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7109                            .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    7110                            .dwattr $C$DW$697, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7111                            .dwattr $C$DW$697, DW_AT_decl_line(0x2e4)
    7112                            .dwattr $C$DW$697, DW_AT_decl_column(0x1d)
    7113                    
    7114                    $C$DW$698       .dwtag  DW_TAG_member
    7115                            .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$21)
    7116                            .dwattr $C$DW$698, DW_AT_name("keyUsageListEntries")
    7117                            .dwattr $C$DW$698, DW_AT_TI_symbol_name("keyUsageListEntries")
    7118                            .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7119                            .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    7120                            .dwattr $C$DW$698, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7121                            .dwattr $C$DW$698, DW_AT_decl_line(0x2e6)
    7122                            .dwattr $C$DW$698, DW_AT_decl_column(0x1c)
    7123                    
    7124                    $C$DW$699       .dwtag  DW_TAG_member
    7125                            .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$52)
    7126                            .dwattr $C$DW$699, DW_AT_name("key")
    7127                            .dwattr $C$DW$699, DW_AT_TI_symbol_name("key")
    7128                            .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    7129                            .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    7130                            .dwattr $C$DW$699, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7131                            .dwattr $C$DW$699, DW_AT_decl_line(0x2e8)
    7132                            .dwattr $C$DW$699, DW_AT_decl_column(0x1c)
    7133                    
    7134                    $C$DW$700       .dwtag  DW_TAG_member
    7135                            .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$32)
    7136                            .dwattr $C$DW$700, DW_AT_name("frameCounter")
    7137                            .dwattr $C$DW$700, DW_AT_TI_symbol_name("frameCounter")
    7138                            .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7139                            .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    7140                            .dwattr $C$DW$700, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7141                            .dwattr $C$DW$700, DW_AT_decl_line(0x2e9)
    7142                            .dwattr $C$DW$700, DW_AT_decl_column(0x1c)
    7143                    
    7144                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    7145                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x2db)
    7146                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
    7147                            .dwendtag $C$DW$T$53
    7148                    
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{8AA21B82-6045-4D02-9100-CF29D4218F3F} PAGE  131

    7149                    $C$DW$T$55      .dwtag  DW_TAG_typedef
    7150                            .dwattr $C$DW$T$55, DW_AT_name("keyDescriptor_t")
    7151                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$53)
    7152                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    7153                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    7154                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x2ec)
    7155                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x03)
    7156                    
    7157                    $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    7158                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    7159                            .dwattr $C$DW$T$56, DW_AT_address_class(0x20)
    7160                    
    7161                    
    7162                    $C$DW$T$61      .dwtag  DW_TAG_structure_type
    7163                            .dwattr $C$DW$T$61, DW_AT_byte_size(0x78)
    7164                    $C$DW$701       .dwtag  DW_TAG_member
    7165                            .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$32)
    7166                            .dwattr $C$DW$701, DW_AT_name("timestamp")
    7167                            .dwattr $C$DW$701, DW_AT_TI_symbol_name("timestamp")
    7168                            .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7169                            .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    7170                            .dwattr $C$DW$701, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7171                            .dwattr $C$DW$701, DW_AT_decl_line(0x356)
    7172                            .dwattr $C$DW$701, DW_AT_decl_column(0x19)
    7173                    
    7174                    $C$DW$702       .dwtag  DW_TAG_member
    7175                            .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$30)
    7176                            .dwattr $C$DW$702, DW_AT_name("timestamp2")
    7177                            .dwattr $C$DW$702, DW_AT_TI_symbol_name("timestamp2")
    7178                            .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7179                            .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    7180                            .dwattr $C$DW$702, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7181                            .dwattr $C$DW$702, DW_AT_decl_line(0x357)
    7182                            .dwattr $C$DW$702, DW_AT_decl_column(0x19)
    7183                    
    7184                    $C$DW$703       .dwtag  DW_TAG_member
    7185                            .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$30)
    7186                            .dwattr $C$DW$703, DW_AT_name("timeToLive")
    7187                            .dwattr $C$DW$703, DW_AT_TI_symbol_name("timeToLive")
    7188                            .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7189                            .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    7190                            .dwattr $C$DW$703, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7191                            .dwattr $C$DW$703, DW_AT_decl_line(0x358)
    7192                            .dwattr $C$DW$703, DW_AT_decl_column(0x19)
    7193                    
    7194                    $C$DW$704       .dwtag  DW_TAG_member
    7195                            .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$21)
    7196                            .dwattr $C$DW$704, DW_AT_name("frameType")
    7197                            .dwattr $C$DW$704, DW_AT_TI_symbol_name("frameType")
    7198                            .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7199                            .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    7200                            .dwattr $C$DW$704, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7201                            .dwattr $C$DW$704, DW_AT_decl_line(0x359)
    7202                            .dwattr $C$DW$704, DW_AT_decl_column(0x19)
    7203                    
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{8AA21B82-6045-4D02-9100-CF29D4218F3F} PAGE  132

    7204                    $C$DW$705       .dwtag  DW_TAG_member
    7205                            .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$30)
    7206                            .dwattr $C$DW$705, DW_AT_name("txOptions")
    7207                            .dwattr $C$DW$705, DW_AT_TI_symbol_name("txOptions")
    7208                            .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7209                            .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    7210                            .dwattr $C$DW$705, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7211                            .dwattr $C$DW$705, DW_AT_decl_line(0x35a)
    7212                            .dwattr $C$DW$705, DW_AT_decl_column(0x19)
    7213                    
    7214                    $C$DW$706       .dwtag  DW_TAG_member
    7215                            .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$21)
    7216                            .dwattr $C$DW$706, DW_AT_name("txMode")
    7217                            .dwattr $C$DW$706, DW_AT_TI_symbol_name("txMode")
    7218                            .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7219                            .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    7220                            .dwattr $C$DW$706, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7221                            .dwattr $C$DW$706, DW_AT_decl_line(0x35b)
    7222                            .dwattr $C$DW$706, DW_AT_decl_column(0x19)
    7223                    
    7224                    $C$DW$707       .dwtag  DW_TAG_member
    7225                            .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$21)
    7226                            .dwattr $C$DW$707, DW_AT_name("txSched")
    7227                            .dwattr $C$DW$707, DW_AT_TI_symbol_name("txSched")
    7228                            .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7229                            .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    7230                            .dwattr $C$DW$707, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7231                            .dwattr $C$DW$707, DW_AT_decl_line(0x35c)
    7232                            .dwattr $C$DW$707, DW_AT_decl_column(0x19)
    7233                    
    7234                    $C$DW$708       .dwtag  DW_TAG_member
    7235                            .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$21)
    7236                            .dwattr $C$DW$708, DW_AT_name("retries")
    7237                            .dwattr $C$DW$708, DW_AT_TI_symbol_name("retries")
    7238                            .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7239                            .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    7240                            .dwattr $C$DW$708, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7241                            .dwattr $C$DW$708, DW_AT_decl_line(0x35d)
    7242                            .dwattr $C$DW$708, DW_AT_decl_column(0x19)
    7243                    
    7244                    $C$DW$709       .dwtag  DW_TAG_member
    7245                            .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$21)
    7246                            .dwattr $C$DW$709, DW_AT_name("channel")
    7247                            .dwattr $C$DW$709, DW_AT_TI_symbol_name("channel")
    7248                            .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    7249                            .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    7250                            .dwattr $C$DW$709, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7251                            .dwattr $C$DW$709, DW_AT_decl_line(0x35e)
    7252                            .dwattr $C$DW$709, DW_AT_decl_column(0x19)
    7253                    
    7254                    $C$DW$710       .dwtag  DW_TAG_member
    7255                            .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$21)
    7256                            .dwattr $C$DW$710, DW_AT_name("power")
    7257                            .dwattr $C$DW$710, DW_AT_TI_symbol_name("power")
    7258                            .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{8AA21B82-6045-4D02-9100-CF29D4218F3F} PAGE  133

    7259                            .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    7260                            .dwattr $C$DW$710, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7261                            .dwattr $C$DW$710, DW_AT_decl_line(0x35f)
    7262                            .dwattr $C$DW$710, DW_AT_decl_column(0x19)
    7263                    
    7264                    $C$DW$711       .dwtag  DW_TAG_member
    7265                            .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$21)
    7266                            .dwattr $C$DW$711, DW_AT_name("mpduLinkQuality")
    7267                            .dwattr $C$DW$711, DW_AT_TI_symbol_name("mpduLinkQuality")
    7268                            .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    7269                            .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    7270                            .dwattr $C$DW$711, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7271                            .dwattr $C$DW$711, DW_AT_decl_line(0x360)
    7272                            .dwattr $C$DW$711, DW_AT_decl_column(0x19)
    7273                    
    7274                    $C$DW$712       .dwtag  DW_TAG_member
    7275                            .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$21)
    7276                            .dwattr $C$DW$712, DW_AT_name("correlation")
    7277                            .dwattr $C$DW$712, DW_AT_TI_symbol_name("correlation")
    7278                            .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7279                            .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    7280                            .dwattr $C$DW$712, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7281                            .dwattr $C$DW$712, DW_AT_decl_line(0x361)
    7282                            .dwattr $C$DW$712, DW_AT_decl_column(0x19)
    7283                    
    7284                    $C$DW$713       .dwtag  DW_TAG_member
    7285                            .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$54)
    7286                            .dwattr $C$DW$713, DW_AT_name("rssi")
    7287                            .dwattr $C$DW$713, DW_AT_TI_symbol_name("rssi")
    7288                            .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    7289                            .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    7290                            .dwattr $C$DW$713, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7291                            .dwattr $C$DW$713, DW_AT_decl_line(0x362)
    7292                            .dwattr $C$DW$713, DW_AT_decl_column(0x19)
    7293                    
    7294                    $C$DW$714       .dwtag  DW_TAG_member
    7295                            .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$40)
    7296                            .dwattr $C$DW$714, DW_AT_name("ptrMData")
    7297                            .dwattr $C$DW$714, DW_AT_TI_symbol_name("ptrMData")
    7298                            .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7299                            .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    7300                            .dwattr $C$DW$714, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7301                            .dwattr $C$DW$714, DW_AT_decl_line(0x364)
    7302                            .dwattr $C$DW$714, DW_AT_decl_column(0x19)
    7303                    
    7304                    $C$DW$715       .dwtag  DW_TAG_member
    7305                            .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$56)
    7306                            .dwattr $C$DW$715, DW_AT_name("pKeyDesc")
    7307                            .dwattr $C$DW$715, DW_AT_TI_symbol_name("pKeyDesc")
    7308                            .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7309                            .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    7310                            .dwattr $C$DW$715, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7311                            .dwattr $C$DW$715, DW_AT_decl_line(0x365)
    7312                            .dwattr $C$DW$715, DW_AT_decl_column(0x19)
    7313                    
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{8AA21B82-6045-4D02-9100-CF29D4218F3F} PAGE  134

    7314                    $C$DW$716       .dwtag  DW_TAG_member
    7315                            .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$32)
    7316                            .dwattr $C$DW$716, DW_AT_name("frameCntr")
    7317                            .dwattr $C$DW$716, DW_AT_TI_symbol_name("frameCntr")
    7318                            .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7319                            .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    7320                            .dwattr $C$DW$716, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7321                            .dwattr $C$DW$716, DW_AT_decl_line(0x366)
    7322                            .dwattr $C$DW$716, DW_AT_decl_column(0x19)
    7323                    
    7324                    $C$DW$717       .dwtag  DW_TAG_member
    7325                            .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$58)
    7326                            .dwattr $C$DW$717, DW_AT_name("payloadIeInfo")
    7327                            .dwattr $C$DW$717, DW_AT_TI_symbol_name("payloadIeInfo")
    7328                            .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7329                            .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    7330                            .dwattr $C$DW$717, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7331                            .dwattr $C$DW$717, DW_AT_decl_line(0x368)
    7332                            .dwattr $C$DW$717, DW_AT_decl_column(0x19)
    7333                    
    7334                    $C$DW$718       .dwtag  DW_TAG_member
    7335                            .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$60)
    7336                            .dwattr $C$DW$718, DW_AT_name("headerIeInfo")
    7337                            .dwattr $C$DW$718, DW_AT_TI_symbol_name("headerIeInfo")
    7338                            .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    7339                            .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    7340                            .dwattr $C$DW$718, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7341                            .dwattr $C$DW$718, DW_AT_decl_line(0x369)
    7342                            .dwattr $C$DW$718, DW_AT_decl_column(0x19)
    7343                    
    7344                    $C$DW$719       .dwtag  DW_TAG_member
    7345                            .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$30)
    7346                            .dwattr $C$DW$719, DW_AT_name("totalLen")
    7347                            .dwattr $C$DW$719, DW_AT_TI_symbol_name("totalLen")
    7348                            .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    7349                            .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    7350                            .dwattr $C$DW$719, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7351                            .dwattr $C$DW$719, DW_AT_decl_line(0x36a)
    7352                            .dwattr $C$DW$719, DW_AT_decl_column(0x19)
    7353                    
    7354                    $C$DW$720       .dwtag  DW_TAG_member
    7355                            .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$40)
    7356                            .dwattr $C$DW$720, DW_AT_name("ptrHeaderIE")
    7357                            .dwattr $C$DW$720, DW_AT_TI_symbol_name("ptrHeaderIE")
    7358                            .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7359                            .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    7360                            .dwattr $C$DW$720, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7361                            .dwattr $C$DW$720, DW_AT_decl_line(0x36b)
    7362                            .dwattr $C$DW$720, DW_AT_decl_column(0x19)
    7363                    
    7364                    $C$DW$721       .dwtag  DW_TAG_member
    7365                            .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$30)
    7366                            .dwattr $C$DW$721, DW_AT_name("headerIesLen")
    7367                            .dwattr $C$DW$721, DW_AT_TI_symbol_name("headerIesLen")
    7368                            .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{8AA21B82-6045-4D02-9100-CF29D4218F3F} PAGE  135

    7369                            .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    7370                            .dwattr $C$DW$721, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7371                            .dwattr $C$DW$721, DW_AT_decl_line(0x36c)
    7372                            .dwattr $C$DW$721, DW_AT_decl_column(0x19)
    7373                    
    7374                    $C$DW$722       .dwtag  DW_TAG_member
    7375                            .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$40)
    7376                            .dwattr $C$DW$722, DW_AT_name("ptrPayloadIE")
    7377                            .dwattr $C$DW$722, DW_AT_TI_symbol_name("ptrPayloadIE")
    7378                            .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    7379                            .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    7380                            .dwattr $C$DW$722, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7381                            .dwattr $C$DW$722, DW_AT_decl_line(0x36d)
    7382                            .dwattr $C$DW$722, DW_AT_decl_column(0x19)
    7383                    
    7384                    $C$DW$723       .dwtag  DW_TAG_member
    7385                            .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$40)
    7386                            .dwattr $C$DW$723, DW_AT_name("ptrUTIE")
    7387                            .dwattr $C$DW$723, DW_AT_TI_symbol_name("ptrUTIE")
    7388                            .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    7389                            .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    7390                            .dwattr $C$DW$723, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7391                            .dwattr $C$DW$723, DW_AT_decl_line(0x36e)
    7392                            .dwattr $C$DW$723, DW_AT_decl_column(0x19)
    7393                    
    7394                    $C$DW$724       .dwtag  DW_TAG_member
    7395                            .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$40)
    7396                            .dwattr $C$DW$724, DW_AT_name("ptrBTIE")
    7397                            .dwattr $C$DW$724, DW_AT_TI_symbol_name("ptrBTIE")
    7398                            .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    7399                            .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    7400                            .dwattr $C$DW$724, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7401                            .dwattr $C$DW$724, DW_AT_decl_line(0x36f)
    7402                            .dwattr $C$DW$724, DW_AT_decl_column(0x19)
    7403                    
    7404                    $C$DW$725       .dwtag  DW_TAG_member
    7405                            .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$40)
    7406                            .dwattr $C$DW$725, DW_AT_name("ptrFrameCnt")
    7407                            .dwattr $C$DW$725, DW_AT_TI_symbol_name("ptrFrameCnt")
    7408                            .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    7409                            .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    7410                            .dwattr $C$DW$725, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7411                            .dwattr $C$DW$725, DW_AT_decl_line(0x370)
    7412                            .dwattr $C$DW$725, DW_AT_decl_column(0x19)
    7413                    
    7414                    $C$DW$726       .dwtag  DW_TAG_member
    7415                            .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$21)
    7416                            .dwattr $C$DW$726, DW_AT_name("rsl")
    7417                            .dwattr $C$DW$726, DW_AT_TI_symbol_name("rsl")
    7418                            .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    7419                            .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    7420                            .dwattr $C$DW$726, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7421                            .dwattr $C$DW$726, DW_AT_decl_line(0x371)
    7422                            .dwattr $C$DW$726, DW_AT_decl_column(0x19)
    7423                    
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{8AA21B82-6045-4D02-9100-CF29D4218F3F} PAGE  136

    7424                    $C$DW$727       .dwtag  DW_TAG_member
    7425                            .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$21)
    7426                            .dwattr $C$DW$727, DW_AT_name("nb")
    7427                            .dwattr $C$DW$727, DW_AT_TI_symbol_name("nb")
    7428                            .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
    7429                            .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    7430                            .dwattr $C$DW$727, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7431                            .dwattr $C$DW$727, DW_AT_decl_line(0x372)
    7432                            .dwattr $C$DW$727, DW_AT_decl_column(0x19)
    7433                    
    7434                    $C$DW$728       .dwtag  DW_TAG_member
    7435                            .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$21)
    7436                            .dwattr $C$DW$728, DW_AT_name("be")
    7437                            .dwattr $C$DW$728, DW_AT_TI_symbol_name("be")
    7438                            .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    7439                            .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    7440                            .dwattr $C$DW$728, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7441                            .dwattr $C$DW$728, DW_AT_decl_line(0x373)
    7442                            .dwattr $C$DW$728, DW_AT_decl_column(0x19)
    7443                    
    7444                    $C$DW$729       .dwtag  DW_TAG_member
    7445                            .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$21)
    7446                            .dwattr $C$DW$729, DW_AT_name("fhFrameType")
    7447                            .dwattr $C$DW$729, DW_AT_TI_symbol_name("fhFrameType")
    7448                            .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x5f]
    7449                            .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    7450                            .dwattr $C$DW$729, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7451                            .dwattr $C$DW$729, DW_AT_decl_line(0x374)
    7452                            .dwattr $C$DW$729, DW_AT_decl_column(0x19)
    7453                    
    7454                    $C$DW$730       .dwtag  DW_TAG_member
    7455                            .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$21)
    7456                            .dwattr $C$DW$730, DW_AT_name("gpDuration")
    7457                            .dwattr $C$DW$730, DW_AT_TI_symbol_name("gpDuration")
    7458                            .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    7459                            .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    7460                            .dwattr $C$DW$730, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7461                            .dwattr $C$DW$730, DW_AT_decl_line(0x375)
    7462                            .dwattr $C$DW$730, DW_AT_decl_column(0x19)
    7463                    
    7464                    $C$DW$731       .dwtag  DW_TAG_member
    7465                            .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$21)
    7466                            .dwattr $C$DW$731, DW_AT_name("gpNumOfTx")
    7467                            .dwattr $C$DW$731, DW_AT_TI_symbol_name("gpNumOfTx")
    7468                            .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    7469                            .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    7470                            .dwattr $C$DW$731, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7471                            .dwattr $C$DW$731, DW_AT_decl_line(0x376)
    7472                            .dwattr $C$DW$731, DW_AT_decl_column(0x19)
    7473                    
    7474                    $C$DW$732       .dwtag  DW_TAG_member
    7475                            .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$21)
    7476                            .dwattr $C$DW$732, DW_AT_name("gpInterframeDelay")
    7477                            .dwattr $C$DW$732, DW_AT_TI_symbol_name("gpInterframeDelay")
    7478                            .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{8AA21B82-6045-4D02-9100-CF29D4218F3F} PAGE  137

    7479                            .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    7480                            .dwattr $C$DW$732, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7481                            .dwattr $C$DW$732, DW_AT_decl_line(0x377)
    7482                            .dwattr $C$DW$732, DW_AT_decl_column(0x19)
    7483                    
    7484                    $C$DW$733       .dwtag  DW_TAG_member
    7485                            .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$567)
    7486                            .dwattr $C$DW$733, DW_AT_name("dest")
    7487                            .dwattr $C$DW$733, DW_AT_TI_symbol_name("dest")
    7488                            .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    7489                            .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    7490                            .dwattr $C$DW$733, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7491                            .dwattr $C$DW$733, DW_AT_decl_line(0x37d)
    7492                            .dwattr $C$DW$733, DW_AT_decl_column(0x05)
    7493                    
    7494                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    7495                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x355)
    7496                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x01)
    7497                            .dwendtag $C$DW$T$61
    7498                    
    7499                    $C$DW$T$63      .dwtag  DW_TAG_typedef
    7500                            .dwattr $C$DW$T$63, DW_AT_name("macTxIntData_t")
    7501                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$61)
    7502                            .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    7503                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    7504                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x37e)
    7505                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    7506                    
    7507                    
    7508                    $C$DW$T$64      .dwtag  DW_TAG_structure_type
    7509                            .dwattr $C$DW$T$64, DW_AT_byte_size(0xa4)
    7510                    $C$DW$734       .dwtag  DW_TAG_member
    7511                            .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$38)
    7512                            .dwattr $C$DW$734, DW_AT_name("hdr")
    7513                            .dwattr $C$DW$734, DW_AT_TI_symbol_name("hdr")
    7514                            .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7515                            .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    7516                            .dwattr $C$DW$734, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7517                            .dwattr $C$DW$734, DW_AT_decl_line(0x150)
    7518                            .dwattr $C$DW$734, DW_AT_decl_column(0x1f)
    7519                    
    7520                    $C$DW$735       .dwtag  DW_TAG_member
    7521                            .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$62)
    7522                            .dwattr $C$DW$735, DW_AT_name("mpdu")
    7523                            .dwattr $C$DW$735, DW_AT_TI_symbol_name("mpdu")
    7524                            .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7525                            .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    7526                            .dwattr $C$DW$735, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7527                            .dwattr $C$DW$735, DW_AT_decl_line(0x151)
    7528                            .dwattr $C$DW$735, DW_AT_decl_column(0x1f)
    7529                    
    7530                    $C$DW$736       .dwtag  DW_TAG_member
    7531                            .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$63)
    7532                            .dwattr $C$DW$736, DW_AT_name("internal")
    7533                            .dwattr $C$DW$736, DW_AT_TI_symbol_name("internal")
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:53:52 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{8AA21B82-6045-4D02-9100-CF29D4218F3F} PAGE  138

    7534                            .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7535                            .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    7536                            .dwattr $C$DW$736, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    7537                            .dwattr $C$DW$736, DW_AT_decl_line(0x152)
    7538                            .dwattr $C$DW$736, DW_AT_decl_column(0x1f)
    7539                    
    7540                    $C$DW$737       .dwtag  DW_TAG_member
    7541                            .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$568)
    7542                            .dwattr $C$DW$737, DW_AT_name("mac")
    7543                            .dwattr $C$DW$737, DW_AT_TI_symbol_name("mac")
    7544                            .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    7545                            .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
