TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{88FE70CB-2B34-4EAA-BBEF-A9E10743A3C3} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.2.LTS *
       3                    ;* Date/Time created: Fri Nov 16 15:54:00 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/StartUp/osaltasks.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.2.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("D:\code\collector_cc1310lp\collector_cc1310lp")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    4247                            .dwattr $C$DW$431, DW_AT_const_value(0x08)
    4248                            .dwattr $C$DW$431, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    4249                            .dwattr $C$DW$431, DW_AT_decl_line(0xa8)
    4250                            .dwattr $C$DW$431, DW_AT_decl_column(0x05)
    4251                    
    4252                    $C$DW$432       .dwtag  DW_TAG_enumerator
    4253                            .dwattr $C$DW$432, DW_AT_name("FAPI_VALIDATE_SECTOR")
    4254                            .dwattr $C$DW$432, DW_AT_const_value(0x0e)
    4255                            .dwattr $C$DW$432, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    4256                            .dwattr $C$DW$432, DW_AT_decl_line(0xa9)
    4257                            .dwattr $C$DW$432, DW_AT_decl_column(0x05)
    4258                    
    4259                    $C$DW$433       .dwtag  DW_TAG_enumerator
    4260                            .dwattr $C$DW$433, DW_AT_name("FAPI_CLEAR_STATUS")
    4261                            .dwattr $C$DW$433, DW_AT_const_value(0x10)
    4262                            .dwattr $C$DW$433, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    4263                            .dwattr $C$DW$433, DW_AT_decl_line(0xaa)
    4264                            .dwattr $C$DW$433, DW_AT_decl_column(0x05)
    4265                    
    4266                    $C$DW$434       .dwtag  DW_TAG_enumerator
    4267                            .dwattr $C$DW$434, DW_AT_name("FAPI_PROGRAM_RESUME")
    4268                            .dwattr $C$DW$434, DW_AT_const_value(0x14)
    4269                            .dwattr $C$DW$434, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    4270                            .dwattr $C$DW$434, DW_AT_decl_line(0xab)
    4271                            .dwattr $C$DW$434, DW_AT_decl_column(0x05)
    4272                    
    4273                    $C$DW$435       .dwtag  DW_TAG_enumerator
    4274                            .dwattr $C$DW$435, DW_AT_name("FAPI_ERASE_RESUME")
    4275                            .dwattr $C$DW$435, DW_AT_const_value(0x16)
    4276                            .dwattr $C$DW$435, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    4277                            .dwattr $C$DW$435, DW_AT_decl_line(0xac)
    4278                            .dwattr $C$DW$435, DW_AT_decl_column(0x05)
    4279                    
    4280                    $C$DW$436       .dwtag  DW_TAG_enumerator
    4281                            .dwattr $C$DW$436, DW_AT_name("FAPI_CLEAR_MORE")
    4282                            .dwattr $C$DW$436, DW_AT_const_value(0x18)
    4283                            .dwattr $C$DW$436, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    4284                            .dwattr $C$DW$436, DW_AT_decl_line(0xad)
    4285                            .dwattr $C$DW$436, DW_AT_decl_column(0x05)
    4286                    
    4287                    $C$DW$437       .dwtag  DW_TAG_enumerator
    4288                            .dwattr $C$DW$437, DW_AT_name("FAPI_PROGRAM_SECTOR")
    4289                            .dwattr $C$DW$437, DW_AT_const_value(0x20)
    4290                            .dwattr $C$DW$437, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{88FE70CB-2B34-4EAA-BBEF-A9E10743A3C3} PAGE   79

    4291                            .dwattr $C$DW$437, DW_AT_decl_line(0xae)
    4292                            .dwattr $C$DW$437, DW_AT_decl_column(0x05)
    4293                    
    4294                    $C$DW$438       .dwtag  DW_TAG_enumerator
    4295                            .dwattr $C$DW$438, DW_AT_name("FAPI_ERASE_OTP")
    4296                            .dwattr $C$DW$438, DW_AT_const_value(0x30)
    4297                            .dwattr $C$DW$438, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/devices/c
    4298                            .dwattr $C$DW$438, DW_AT_decl_line(0xaf)
    4299                            .dwattr $C$DW$438, DW_AT_decl_column(0x05)
    4300                    
    4301                            .dwattr $C$DW$T$1084, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/device
    4302                            .dwattr $C$DW$T$1084, DW_AT_decl_line(0xa5)
    4303                            .dwattr $C$DW$T$1084, DW_AT_decl_column(0x01)
    4304                            .dwendtag $C$DW$T$1084
    4305                    
    4306                    $C$DW$T$1085    .dwtag  DW_TAG_typedef
    4307                            .dwattr $C$DW$T$1085, DW_AT_name("tFlashStateCommandsType")
    4308                            .dwattr $C$DW$T$1085, DW_AT_type(*$C$DW$T$1084)
    4309                            .dwattr $C$DW$T$1085, DW_AT_language(DW_LANG_C)
    4310                            .dwattr $C$DW$T$1085, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/device
    4311                            .dwattr $C$DW$T$1085, DW_AT_decl_line(0xb0)
    4312                            .dwattr $C$DW$T$1085, DW_AT_decl_column(0x03)
    4313                    
    4314                    
    4315                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4316                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
    4317                    $C$DW$439       .dwtag  DW_TAG_member
    4318                            .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$22)
    4319                            .dwattr $C$DW$439, DW_AT_name("rfMode")
    4320                            .dwattr $C$DW$439, DW_AT_TI_symbol_name("rfMode")
    4321                            .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4322                            .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4323                            .dwattr $C$DW$439, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    4324                            .dwattr $C$DW$439, DW_AT_decl_line(0x41e)
    4325                            .dwattr $C$DW$439, DW_AT_decl_column(0x0d)
    4326                    
    4327                    $C$DW$440       .dwtag  DW_TAG_member
    4328                            .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$24)
    4329                            .dwattr $C$DW$440, DW_AT_name("cpePatchFxn")
    4330                            .dwattr $C$DW$440, DW_AT_TI_symbol_name("cpePatchFxn")
    4331                            .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4332                            .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4333                            .dwattr $C$DW$440, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    4334                            .dwattr $C$DW$440, DW_AT_decl_line(0x41f)
    4335                            .dwattr $C$DW$440, DW_AT_decl_column(0x0c)
    4336                    
    4337                    $C$DW$441       .dwtag  DW_TAG_member
    4338                            .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$24)
    4339                            .dwattr $C$DW$441, DW_AT_name("mcePatchFxn")
    4340                            .dwattr $C$DW$441, DW_AT_TI_symbol_name("mcePatchFxn")
    4341                            .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4342                            .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4343                            .dwattr $C$DW$441, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    4344                            .dwattr $C$DW$441, DW_AT_decl_line(0x420)
    4345                            .dwattr $C$DW$441, DW_AT_decl_column(0x0c)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{88FE70CB-2B34-4EAA-BBEF-A9E10743A3C3} PAGE   80

    4346                    
    4347                    $C$DW$442       .dwtag  DW_TAG_member
    4348                            .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$24)
    4349                            .dwattr $C$DW$442, DW_AT_name("rfePatchFxn")
    4350                            .dwattr $C$DW$442, DW_AT_TI_symbol_name("rfePatchFxn")
    4351                            .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4352                            .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4353                            .dwattr $C$DW$442, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    4354                            .dwattr $C$DW$442, DW_AT_decl_line(0x421)
    4355                            .dwattr $C$DW$442, DW_AT_decl_column(0x0c)
    4356                    
    4357                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/
    4358                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x41d)
    4359                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    4360                            .dwendtag $C$DW$T$25
    4361                    
    4362                    $C$DW$T$38      .dwtag  DW_TAG_typedef
    4363                            .dwattr $C$DW$T$38, DW_AT_name("RF_Mode")
    4364                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$25)
    4365                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4366                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/
    4367                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x422)
    4368                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x03)
    4369                    
    4370                    $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    4371                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    4372                            .dwattr $C$DW$T$39, DW_AT_address_class(0x20)
    4373                    
    4374                    
    4375                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    4376                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    4377                    $C$DW$443       .dwtag  DW_TAG_member
    4378                            .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$27)
    4379                            .dwattr $C$DW$443, DW_AT_name("rawValue")
    4380                            .dwattr $C$DW$443, DW_AT_TI_symbol_name("rawValue")
    4381                            .dwattr $C$DW$443, DW_AT_bit_offset(0x0a)
    4382                            .dwattr $C$DW$443, DW_AT_bit_size(0x16)
    4383                            .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4384                            .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4385                            .dwattr $C$DW$443, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    4386                            .dwattr $C$DW$443, DW_AT_decl_line(0x3d3)
    4387                            .dwattr $C$DW$443, DW_AT_decl_column(0x0e)
    4388                    
    4389                    $C$DW$444       .dwtag  DW_TAG_member
    4390                            .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$27)
    4391                            .dwattr $C$DW$444, DW_AT_name("__dummy")
    4392                            .dwattr $C$DW$444, DW_AT_TI_symbol_name("__dummy")
    4393                            .dwattr $C$DW$444, DW_AT_bit_offset(0x01)
    4394                            .dwattr $C$DW$444, DW_AT_bit_size(0x09)
    4395                            .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4396                            .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4397                            .dwattr $C$DW$444, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    4398                            .dwattr $C$DW$444, DW_AT_decl_line(0x3d7)
    4399                            .dwattr $C$DW$444, DW_AT_decl_column(0x0e)
    4400                    
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{88FE70CB-2B34-4EAA-BBEF-A9E10743A3C3} PAGE   81

    4401                    $C$DW$445       .dwtag  DW_TAG_member
    4402                            .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$27)
    4403                            .dwattr $C$DW$445, DW_AT_name("paType")
    4404                            .dwattr $C$DW$445, DW_AT_TI_symbol_name("paType")
    4405                            .dwattr $C$DW$445, DW_AT_bit_offset(0x00)
    4406                            .dwattr $C$DW$445, DW_AT_bit_size(0x01)
    4407                            .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4408                            .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4409                            .dwattr $C$DW$445, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    4410                            .dwattr $C$DW$445, DW_AT_decl_line(0x3d8)
    4411                            .dwattr $C$DW$445, DW_AT_decl_column(0x0e)
    4412                    
    4413                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/
    4414                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x3d2)
    4415                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    4416                            .dwendtag $C$DW$T$28
    4417                    
    4418                    $C$DW$T$31      .dwtag  DW_TAG_typedef
    4419                            .dwattr $C$DW$T$31, DW_AT_name("RF_TxPowerTable_Value")
    4420                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$28)
    4421                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    4422                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/
    4423                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x3dc)
    4424                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x03)
    4425                    
    4426                    
    4427                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    4428                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x05)
    4429                    $C$DW$446       .dwtag  DW_TAG_member
    4430                            .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$30)
    4431                            .dwattr $C$DW$446, DW_AT_name("power")
    4432                            .dwattr $C$DW$446, DW_AT_TI_symbol_name("power")
    4433                            .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4434                            .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4435                            .dwattr $C$DW$446, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    4436                            .dwattr $C$DW$446, DW_AT_decl_line(0x3f2)
    4437                            .dwattr $C$DW$446, DW_AT_decl_column(0x0c)
    4438                    
    4439                    $C$DW$447       .dwtag  DW_TAG_member
    4440                            .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$31)
    4441                            .dwattr $C$DW$447, DW_AT_name("value")
    4442                            .dwattr $C$DW$447, DW_AT_TI_symbol_name("value")
    4443                            .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4444                            .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4445                            .dwattr $C$DW$447, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/r
    4446                            .dwattr $C$DW$447, DW_AT_decl_line(0x3f5)
    4447                            .dwattr $C$DW$447, DW_AT_decl_column(0x1b)
    4448                    
    4449                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/
    4450                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x3f1)
    4451                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    4452                            .dwendtag $C$DW$T$32
    4453                    
    4454                    $C$DW$T$33      .dwtag  DW_TAG_typedef
    4455                            .dwattr $C$DW$T$33, DW_AT_name("RF_TxPowerTable_Entry")
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{88FE70CB-2B34-4EAA-BBEF-A9E10743A3C3} PAGE   82

    4456                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    4457                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4458                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/drivers/
    4459                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x3f6)
    4460                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x1b)
    4461                    
    4462                    $C$DW$T$34      .dwtag  DW_TAG_const_type
    4463                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    4464                    
    4465                    $C$DW$T$35      .dwtag  DW_TAG_typedef
    4466                            .dwattr $C$DW$T$35, DW_AT_name("macTxPwrVal_t")
    4467                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    4468                            .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    4469                            .dwattr $C$DW$T$35, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.h"
    4470                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x144)
    4471                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x25)
    4472                    
    4473                    $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    4474                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    4475                            .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
    4476                    
    4477                    
    4478                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4479                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    4480                    $C$DW$448       .dwtag  DW_TAG_member
    4481                            .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$36)
    4482                            .dwattr $C$DW$448, DW_AT_name("pTxPwrVals")
    4483                            .dwattr $C$DW$448, DW_AT_TI_symbol_name("pTxPwrVals")
    4484                            .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4485                            .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4486                            .dwattr $C$DW$448, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.h")
    4487                            .dwattr $C$DW$448, DW_AT_decl_line(0x148)
    4488                            .dwattr $C$DW$448, DW_AT_decl_column(0x12)
    4489                    
    4490                            .dwattr $C$DW$T$37, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.h"
    4491                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x147)
    4492                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    4493                            .dwendtag $C$DW$T$37
    4494                    
    4495                    $C$DW$T$41      .dwtag  DW_TAG_const_type
    4496                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$37)
    4497                    
    4498                    $C$DW$T$42      .dwtag  DW_TAG_typedef
    4499                            .dwattr $C$DW$T$42, DW_AT_name("macTxPwrTbl_t")
    4500                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    4501                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4502                            .dwattr $C$DW$T$42, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.h"
    4503                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x149)
    4504                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x03)
    4505                    
    4506                    $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    4507                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    4508                            .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    4509                    
    4510                    
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{88FE70CB-2B34-4EAA-BBEF-A9E10743A3C3} PAGE   83

    4511                    $C$DW$T$54      .dwtag  DW_TAG_structure_type
    4512                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x30)
    4513                    $C$DW$449       .dwtag  DW_TAG_member
    4514                            .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$27)
    4515                            .dwattr $C$DW$449, DW_AT_name("getHwRevision")
    4516                            .dwattr $C$DW$449, DW_AT_TI_symbol_name("getHwRevision")
    4517                            .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4518                            .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4519                            .dwattr $C$DW$449, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.h")
    4520                            .dwattr $C$DW$449, DW_AT_decl_line(0x155)
    4521                            .dwattr $C$DW$449, DW_AT_decl_column(0x1c)
    4522                    
    4523                    $C$DW$450       .dwtag  DW_TAG_member
    4524                            .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$39)
    4525                            .dwattr $C$DW$450, DW_AT_name("pRfPatchTable")
    4526                            .dwattr $C$DW$450, DW_AT_TI_symbol_name("pRfPatchTable")
    4527                            .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4528                            .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4529                            .dwattr $C$DW$450, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.h")
    4530                            .dwattr $C$DW$450, DW_AT_decl_line(0x156)
    4531                            .dwattr $C$DW$450, DW_AT_decl_column(0x1d)
    4532                    
    4533                    $C$DW$451       .dwtag  DW_TAG_member
    4534                            .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$40)
    4535                            .dwattr $C$DW$451, DW_AT_name("pRfDrvTblPtr")
    4536                            .dwattr $C$DW$451, DW_AT_TI_symbol_name("pRfDrvTblPtr")
    4537                            .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4538                            .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4539                            .dwattr $C$DW$451, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.h")
    4540                            .dwattr $C$DW$451, DW_AT_decl_line(0x157)
    4541                            .dwattr $C$DW$451, DW_AT_decl_column(0x1d)
    4542                    
    4543                    $C$DW$452       .dwtag  DW_TAG_member
    4544                            .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$40)
    4545                            .dwattr $C$DW$452, DW_AT_name("pCryptoDrvTblPtr")
    4546                            .dwattr $C$DW$452, DW_AT_TI_symbol_name("pCryptoDrvTblPtr")
    4547                            .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4548                            .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4549                            .dwattr $C$DW$452, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.h")
    4550                            .dwattr $C$DW$452, DW_AT_decl_line(0x158)
    4551                            .dwattr $C$DW$452, DW_AT_decl_column(0x1d)
    4552                    
    4553                    $C$DW$453       .dwtag  DW_TAG_member
    4554                            .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$43)
    4555                            .dwattr $C$DW$453, DW_AT_name("pTxPwrTbl")
    4556                            .dwattr $C$DW$453, DW_AT_TI_symbol_name("pTxPwrTbl")
    4557                            .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4558                            .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4559                            .dwattr $C$DW$453, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.h")
    4560                            .dwattr $C$DW$453, DW_AT_decl_line(0x159)
    4561                            .dwattr $C$DW$453, DW_AT_decl_column(0x20)
    4562                    
    4563                    $C$DW$454       .dwtag  DW_TAG_member
    4564                            .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$44)
    4565                            .dwattr $C$DW$454, DW_AT_name("pOverrides")
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{88FE70CB-2B34-4EAA-BBEF-A9E10743A3C3} PAGE   84

    4566                            .dwattr $C$DW$454, DW_AT_TI_symbol_name("pOverrides")
    4567                            .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4568                            .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4569                            .dwattr $C$DW$454, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.h")
    4570                            .dwattr $C$DW$454, DW_AT_decl_line(0x15a)
    4571                            .dwattr $C$DW$454, DW_AT_decl_column(0x1e)
    4572                    
    4573                    $C$DW$455       .dwtag  DW_TAG_member
    4574                            .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$45)
    4575                            .dwattr $C$DW$455, DW_AT_name("pLoDivider")
    4576                            .dwattr $C$DW$455, DW_AT_TI_symbol_name("pLoDivider")
    4577                            .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4578                            .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4579                            .dwattr $C$DW$455, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.h")
    4580                            .dwattr $C$DW$455, DW_AT_decl_line(0x15b)
    4581                            .dwattr $C$DW$455, DW_AT_decl_column(0x1d)
    4582                    
    4583                    $C$DW$456       .dwtag  DW_TAG_member
    4584                            .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$22)
    4585                            .dwattr $C$DW$456, DW_AT_name("rfFeModeBias")
    4586                            .dwattr $C$DW$456, DW_AT_TI_symbol_name("rfFeModeBias")
    4587                            .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4588                            .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4589                            .dwattr $C$DW$456, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.h")
    4590                            .dwattr $C$DW$456, DW_AT_decl_line(0x15c)
    4591                            .dwattr $C$DW$456, DW_AT_decl_column(0x1c)
    4592                    
    4593                    $C$DW$457       .dwtag  DW_TAG_member
    4594                            .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$22)
    4595                            .dwattr $C$DW$457, DW_AT_name("phyId")
    4596                            .dwattr $C$DW$457, DW_AT_TI_symbol_name("phyId")
    4597                            .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4598                            .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4599                            .dwattr $C$DW$457, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.h")
    4600                            .dwattr $C$DW$457, DW_AT_decl_line(0x15d)
    4601                            .dwattr $C$DW$457, DW_AT_decl_column(0x1c)
    4602                    
    4603                    $C$DW$458       .dwtag  DW_TAG_member
    4604                            .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$22)
    4605                            .dwattr $C$DW$458, DW_AT_name("last")
    4606                            .dwattr $C$DW$458, DW_AT_TI_symbol_name("last")
    4607                            .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4608                            .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4609                            .dwattr $C$DW$458, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.h")
    4610                            .dwattr $C$DW$458, DW_AT_decl_line(0x15e)
    4611                            .dwattr $C$DW$458, DW_AT_decl_column(0x1c)
    4612                    
    4613                    $C$DW$459       .dwtag  DW_TAG_member
    4614                            .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$48)
    4615                            .dwattr $C$DW$459, DW_AT_name("pSetRE")
    4616                            .dwattr $C$DW$459, DW_AT_TI_symbol_name("pSetRE")
    4617                            .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4618                            .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4619                            .dwattr $C$DW$459, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.h")
    4620                            .dwattr $C$DW$459, DW_AT_decl_line(0x15f)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{88FE70CB-2B34-4EAA-BBEF-A9E10743A3C3} PAGE   85

    4621                            .dwattr $C$DW$459, DW_AT_decl_column(0x1c)
    4622                    
    4623                    $C$DW$460       .dwtag  DW_TAG_member
    4624                            .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$49)
    4625                            .dwattr $C$DW$460, DW_AT_name("pAssertFP")
    4626                            .dwattr $C$DW$460, DW_AT_TI_symbol_name("pAssertFP")
    4627                            .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4628                            .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4629                            .dwattr $C$DW$460, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.h")
    4630                            .dwattr $C$DW$460, DW_AT_decl_line(0x160)
    4631                            .dwattr $C$DW$460, DW_AT_decl_column(0x1c)
    4632                    
    4633                    $C$DW$461       .dwtag  DW_TAG_member
    4634                            .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$52)
    4635                            .dwattr $C$DW$461, DW_AT_name("pAntSwitchFP")
    4636                            .dwattr $C$DW$461, DW_AT_TI_symbol_name("pAntSwitchFP")
    4637                            .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4638                            .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4639                            .dwattr $C$DW$461, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.h")
    4640                            .dwattr $C$DW$461, DW_AT_decl_line(0x161)
    4641                            .dwattr $C$DW$461, DW_AT_decl_column(0x1c)
    4642                    
    4643                    $C$DW$462       .dwtag  DW_TAG_member
    4644                            .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$53)
    4645                            .dwattr $C$DW$462, DW_AT_name("pAntPwrFP")
    4646                            .dwattr $C$DW$462, DW_AT_TI_symbol_name("pAntPwrFP")
    4647                            .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4648                            .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4649                            .dwattr $C$DW$462, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.h")
    4650                            .dwattr $C$DW$462, DW_AT_decl_line(0x162)
    4651                            .dwattr $C$DW$462, DW_AT_decl_column(0x1c)
    4652                    
    4653                            .dwattr $C$DW$T$54, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.h"
    4654                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x154)
    4655                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x01)
    4656                            .dwendtag $C$DW$T$54
    4657                    
    4658                    $C$DW$T$1087    .dwtag  DW_TAG_typedef
    4659                            .dwattr $C$DW$T$1087, DW_AT_name("macUserCfg_t")
    4660                            .dwattr $C$DW$T$1087, DW_AT_type(*$C$DW$T$54)
    4661                            .dwattr $C$DW$T$1087, DW_AT_language(DW_LANG_C)
    4662                            .dwattr $C$DW$T$1087, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/mac_user_config.
    4663                            .dwattr $C$DW$T$1087, DW_AT_decl_line(0x163)
    4664                            .dwattr $C$DW$T$1087, DW_AT_decl_column(0x03)
    4665                    
    4666                    $C$DW$T$1088    .dwtag  DW_TAG_pointer_type
    4667                            .dwattr $C$DW$T$1088, DW_AT_type(*$C$DW$T$1087)
    4668                            .dwattr $C$DW$T$1088, DW_AT_address_class(0x20)
    4669                    
    4670                    
    4671                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    4672                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x10)
    4673                    $C$DW$463       .dwtag  DW_TAG_member
    4674                            .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$14)
    4675                            .dwattr $C$DW$463, DW_AT_name("__max_align1")
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{88FE70CB-2B34-4EAA-BBEF-A9E10743A3C3} PAGE   86

    4676                            .dwattr $C$DW$463, DW_AT_TI_symbol_name("__max_align1")
    4677                            .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4678                            .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4679                            .dwattr $C$DW$463, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.LTS/include/s
    4680                            .dwattr $C$DW$463, DW_AT_decl_line(0x70)
    4681                            .dwattr $C$DW$463, DW_AT_decl_column(0x0c)
    4682                    
    4683                    $C$DW$464       .dwtag  DW_TAG_member
    4684                            .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$18)
    4685                            .dwattr $C$DW$464, DW_AT_name("__max_align2")
    4686                            .dwattr $C$DW$464, DW_AT_TI_symbol_name("__max_align2")
    4687                            .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4688                            .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4689                            .dwattr $C$DW$464, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.LTS/include/s
    4690                            .dwattr $C$DW$464, DW_AT_decl_line(0x71)
    4691                            .dwattr $C$DW$464, DW_AT_decl_column(0x0e)
    4692                    
    4693                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.LTS/include/
    4694                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x6f)
    4695                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
    4696                            .dwendtag $C$DW$T$55
    4697                    
    4698                    $C$DW$T$1089    .dwtag  DW_TAG_typedef
    4699                            .dwattr $C$DW$T$1089, DW_AT_name("__max_align_t")
    4700                            .dwattr $C$DW$T$1089, DW_AT_type(*$C$DW$T$55)
    4701                            .dwattr $C$DW$T$1089, DW_AT_language(DW_LANG_C)
    4702                            .dwattr $C$DW$T$1089, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.LTS/includ
    4703                            .dwattr $C$DW$T$1089, DW_AT_decl_line(0x72)
    4704                            .dwattr $C$DW$T$1089, DW_AT_decl_column(0x03)
    4705                    
    4706                    
    4707                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    4708                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x08)
    4709                    $C$DW$465       .dwtag  DW_TAG_member
    4710                            .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$10)
    4711                            .dwattr $C$DW$465, DW_AT_name("quot")
    4712                            .dwattr $C$DW$465, DW_AT_TI_symbol_name("quot")
    4713                            .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4714                            .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4715                            .dwattr $C$DW$465, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.LTS/include/s
    4716                            .dwattr $C$DW$465, DW_AT_decl_line(0x49)
    4717                            .dwattr $C$DW$465, DW_AT_decl_column(0x16)
    4718                    
    4719                    $C$DW$466       .dwtag  DW_TAG_member
    4720                            .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$10)
    4721                            .dwattr $C$DW$466, DW_AT_name("rem")
    4722                            .dwattr $C$DW$466, DW_AT_TI_symbol_name("rem")
    4723                            .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4724                            .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4725                            .dwattr $C$DW$466, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.LTS/include/s
    4726                            .dwattr $C$DW$466, DW_AT_decl_line(0x49)
    4727                            .dwattr $C$DW$466, DW_AT_decl_column(0x1c)
    4728                    
    4729                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.LTS/include/
    4730                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x49)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{88FE70CB-2B34-4EAA-BBEF-A9E10743A3C3} PAGE   87

    4731                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x10)
    4732                            .dwendtag $C$DW$T$56
    4733                    
    4734                    $C$DW$T$1090    .dwtag  DW_TAG_typedef
    4735                            .dwattr $C$DW$T$1090, DW_AT_name("div_t")
    4736                            .dwattr $C$DW$T$1090, DW_AT_type(*$C$DW$T$56)
    4737                            .dwattr $C$DW$T$1090, DW_AT_language(DW_LANG_C)
    4738                            .dwattr $C$DW$T$1090, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.LTS/includ
    4739                            .dwattr $C$DW$T$1090, DW_AT_decl_line(0x49)
    4740                            .dwattr $C$DW$T$1090, DW_AT_decl_column(0x23)
    4741                    
    4742                    
    4743                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
    4744                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x08)
    4745                    $C$DW$467       .dwtag  DW_TAG_member
    4746                            .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$10)
    4747                            .dwattr $C$DW$467, DW_AT_name("quot")
    4748                            .dwattr $C$DW$467, DW_AT_TI_symbol_name("quot")
    4749                            .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4750                            .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4751                            .dwattr $C$DW$467, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.LTS/include/s
    4752                            .dwattr $C$DW$467, DW_AT_decl_line(0x4e)
    4753                            .dwattr $C$DW$467, DW_AT_decl_column(0x16)
    4754                    
    4755                    $C$DW$468       .dwtag  DW_TAG_member
    4756                            .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$10)
    4757                            .dwattr $C$DW$468, DW_AT_name("rem")
    4758                            .dwattr $C$DW$468, DW_AT_TI_symbol_name("rem")
    4759                            .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4760                            .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4761                            .dwattr $C$DW$468, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.LTS/include/s
    4762                            .dwattr $C$DW$468, DW_AT_decl_line(0x4e)
    4763                            .dwattr $C$DW$468, DW_AT_decl_column(0x1c)
    4764                    
    4765                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.LTS/include/
    4766                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x4e)
    4767                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x10)
    4768                            .dwendtag $C$DW$T$57
    4769                    
    4770                    $C$DW$T$1091    .dwtag  DW_TAG_typedef
    4771                            .dwattr $C$DW$T$1091, DW_AT_name("ldiv_t")
    4772                            .dwattr $C$DW$T$1091, DW_AT_type(*$C$DW$T$57)
    4773                            .dwattr $C$DW$T$1091, DW_AT_language(DW_LANG_C)
    4774                            .dwattr $C$DW$T$1091, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.LTS/includ
    4775                            .dwattr $C$DW$T$1091, DW_AT_decl_line(0x4e)
    4776                            .dwattr $C$DW$T$1091, DW_AT_decl_column(0x23)
    4777                    
    4778                    
    4779                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    4780                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x10)
    4781                    $C$DW$469       .dwtag  DW_TAG_member
    4782                            .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$14)
    4783                            .dwattr $C$DW$469, DW_AT_name("quot")
    4784                            .dwattr $C$DW$469, DW_AT_TI_symbol_name("quot")
    4785                            .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{88FE70CB-2B34-4EAA-BBEF-A9E10743A3C3} PAGE   88

    4786                            .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4787                            .dwattr $C$DW$469, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.LTS/include/s
    4788                            .dwattr $C$DW$469, DW_AT_decl_line(0x56)
    4789                            .dwattr $C$DW$469, DW_AT_decl_column(0x1c)
    4790                    
    4791                    $C$DW$470       .dwtag  DW_TAG_member
    4792                            .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$14)
    4793                            .dwattr $C$DW$470, DW_AT_name("rem")
    4794                            .dwattr $C$DW$470, DW_AT_TI_symbol_name("rem")
    4795                            .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4796                            .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4797                            .dwattr $C$DW$470, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.LTS/include/s
    4798                            .dwattr $C$DW$470, DW_AT_decl_line(0x56)
    4799                            .dwattr $C$DW$470, DW_AT_decl_column(0x22)
    4800                    
    4801                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.LTS/include/
    4802                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x56)
    4803                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x10)
    4804                            .dwendtag $C$DW$T$58
    4805                    
    4806                    $C$DW$T$1092    .dwtag  DW_TAG_typedef
    4807                            .dwattr $C$DW$T$1092, DW_AT_name("lldiv_t")
    4808                            .dwattr $C$DW$T$1092, DW_AT_type(*$C$DW$T$58)
    4809                            .dwattr $C$DW$T$1092, DW_AT_language(DW_LANG_C)
    4810                            .dwattr $C$DW$T$1092, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.2.LTS/includ
    4811                            .dwattr $C$DW$T$1092, DW_AT_decl_line(0x56)
    4812                            .dwattr $C$DW$T$1092, DW_AT_decl_column(0x29)
    4813                    
    4814                    
    4815                    $C$DW$T$63      .dwtag  DW_TAG_structure_type
    4816                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x08)
    4817                    $C$DW$471       .dwtag  DW_TAG_member
    4818                            .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$61)
    4819                            .dwattr $C$DW$471, DW_AT_name("pointerStack")
    4820                            .dwattr $C$DW$471, DW_AT_TI_symbol_name("pointerStack")
    4821                            .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4822                            .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4823                            .dwattr $C$DW$471, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    4824                            .dwattr $C$DW$471, DW_AT_decl_line(0x3f5)
    4825                            .dwattr $C$DW$471, DW_AT_decl_column(0x16)
    4826                    
    4827                    $C$DW$472       .dwtag  DW_TAG_member
    4828                            .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$62)
    4829                            .dwattr $C$DW$472, DW_AT_name("directAPI")
    4830                            .dwattr $C$DW$472, DW_AT_TI_symbol_name("directAPI")
    4831                            .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4832                            .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4833                            .dwattr $C$DW$472, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    4834                            .dwattr $C$DW$472, DW_AT_decl_line(0x3f6)
    4835                            .dwattr $C$DW$472, DW_AT_decl_column(0x15)
    4836                    
    4837                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    4838                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x3f4)
    4839                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x01)
    4840                            .dwendtag $C$DW$T$63
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{88FE70CB-2B34-4EAA-BBEF-A9E10743A3C3} PAGE   89

    4841                    
    4842                    $C$DW$T$65      .dwtag  DW_TAG_typedef
    4843                            .dwattr $C$DW$T$65, DW_AT_name("icall_directAPIMsg_t")
    4844                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$63)
    4845                            .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    4846                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    4847                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x3f7)
    4848                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    4849                    
    4850                    
    4851                    $C$DW$T$66      .dwtag  DW_TAG_structure_type
    4852                            .dwattr $C$DW$T$66, DW_AT_byte_size(0x14)
    4853                    $C$DW$473       .dwtag  DW_TAG_member
    4854                            .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$64)
    4855                            .dwattr $C$DW$473, DW_AT_name("hdr")
    4856                            .dwattr $C$DW$473, DW_AT_TI_symbol_name("hdr")
    4857                            .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4858                            .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4859                            .dwattr $C$DW$473, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    4860                            .dwattr $C$DW$473, DW_AT_decl_line(0x3fb)
    4861                            .dwattr $C$DW$473, DW_AT_decl_column(0x10)
    4862                    
    4863                    $C$DW$474       .dwtag  DW_TAG_member
    4864                            .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$65)
    4865                            .dwattr $C$DW$474, DW_AT_name("msg")
    4866                            .dwattr $C$DW$474, DW_AT_TI_symbol_name("msg")
    4867                            .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4868                            .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4869                            .dwattr $C$DW$474, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    4870                            .dwattr $C$DW$474, DW_AT_decl_line(0x3fc)
    4871                            .dwattr $C$DW$474, DW_AT_decl_column(0x1a)
    4872                    
    4873                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    4874                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x3fa)
    4875                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x01)
    4876                            .dwendtag $C$DW$T$66
    4877                    
    4878                    $C$DW$T$1093    .dwtag  DW_TAG_typedef
    4879                            .dwattr $C$DW$T$1093, DW_AT_name("icallLiteMsg_t")
    4880                            .dwattr $C$DW$T$1093, DW_AT_type(*$C$DW$T$66)
    4881                            .dwattr $C$DW$T$1093, DW_AT_language(DW_LANG_C)
    4882                            .dwattr $C$DW$T$1093, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154s
    4883                            .dwattr $C$DW$T$1093, DW_AT_decl_line(0x3fd)
    4884                            .dwattr $C$DW$T$1093, DW_AT_decl_column(0x03)
    4885                    
    4886                    
    4887                    $C$DW$T$67      .dwtag  DW_TAG_structure_type
    4888                            .dwattr $C$DW$T$67, DW_AT_byte_size(0x0a)
    4889                    $C$DW$475       .dwtag  DW_TAG_member
    4890                            .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$494)
    4891                            .dwattr $C$DW$475, DW_AT_name("addr")
    4892                            .dwattr $C$DW$475, DW_AT_TI_symbol_name("addr")
    4893                            .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4894                            .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4895                            .dwattr $C$DW$475, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/Services/saddr.h")
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{88FE70CB-2B34-4EAA-BBEF-A9E10743A3C3} PAGE   90

    4896                            .dwattr $C$DW$475, DW_AT_decl_line(0x55)
    4897                            .dwattr $C$DW$475, DW_AT_decl_column(0x05)
    4898                    
    4899                    $C$DW$476       .dwtag  DW_TAG_member
    4900                            .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$22)
    4901                            .dwattr $C$DW$476, DW_AT_name("addrMode")
    4902                            .dwattr $C$DW$476, DW_AT_TI_symbol_name("addrMode")
    4903                            .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4904                            .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    4905                            .dwattr $C$DW$476, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/Services/saddr.h")
    4906                            .dwattr $C$DW$476, DW_AT_decl_line(0x56)
    4907                            .dwattr $C$DW$476, DW_AT_decl_column(0x13)
    4908                    
    4909                            .dwattr $C$DW$T$67, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/Services/saddr.h")
    4910                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x50)
    4911                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x01)
    4912                            .dwendtag $C$DW$T$67
    4913                    
    4914                    $C$DW$T$386     .dwtag  DW_TAG_typedef
    4915                            .dwattr $C$DW$T$386, DW_AT_name("sAddr_t")
    4916                            .dwattr $C$DW$T$386, DW_AT_type(*$C$DW$T$67)
    4917                            .dwattr $C$DW$T$386, DW_AT_language(DW_LANG_C)
    4918                            .dwattr $C$DW$T$386, DW_AT_decl_file("D:/code/collector_cc1310lp/Application/Services/saddr.h"
    4919                            .dwattr $C$DW$T$386, DW_AT_decl_line(0x57)
    4920                            .dwattr $C$DW$T$386, DW_AT_decl_column(0x03)
    4921                    
    4922                    $C$DW$T$442     .dwtag  DW_TAG_pointer_type
    4923                            .dwattr $C$DW$T$442, DW_AT_type(*$C$DW$T$386)
    4924                            .dwattr $C$DW$T$442, DW_AT_address_class(0x20)
    4925                    
    4926                    
    4927                    $C$DW$T$70      .dwtag  DW_TAG_structure_type
    4928                            .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    4929                    $C$DW$477       .dwtag  DW_TAG_member
    4930                            .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$497)
    4931                            .dwattr $C$DW$477, DW_AT_name("addr")
    4932                            .dwattr $C$DW$477, DW_AT_TI_symbol_name("addr")
    4933                            .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4934                            .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4935                            .dwattr $C$DW$477, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    4936                            .dwattr $C$DW$477, DW_AT_decl_line(0x139)
    4937                            .dwattr $C$DW$477, DW_AT_decl_column(0x05)
    4938                    
    4939                    $C$DW$478       .dwtag  DW_TAG_member
    4940                            .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$69)
    4941                            .dwattr $C$DW$478, DW_AT_name("addrMode")
    4942                            .dwattr $C$DW$478, DW_AT_TI_symbol_name("addrMode")
    4943                            .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4944                            .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4945                            .dwattr $C$DW$478, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    4946                            .dwattr $C$DW$478, DW_AT_decl_line(0x13a)
    4947                            .dwattr $C$DW$478, DW_AT_decl_column(0x08)
    4948                    
    4949                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    4950                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x134)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{88FE70CB-2B34-4EAA-BBEF-A9E10743A3C3} PAGE   91

    4951                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x01)
    4952                            .dwendtag $C$DW$T$70
    4953                    
    4954                    $C$DW$T$1094    .dwtag  DW_TAG_typedef
    4955                            .dwattr $C$DW$T$1094, DW_AT_name("zAddrType_t")
    4956                            .dwattr $C$DW$T$1094, DW_AT_type(*$C$DW$T$70)
    4957                            .dwattr $C$DW$T$1094, DW_AT_language(DW_LANG_C)
    4958                            .dwattr $C$DW$T$1094, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154s
    4959                            .dwattr $C$DW$T$1094, DW_AT_decl_line(0x13b)
    4960                            .dwattr $C$DW$T$1094, DW_AT_decl_column(0x03)
    4961                    
    4962                    
    4963                    $C$DW$T$73      .dwtag  DW_TAG_structure_type
    4964                            .dwattr $C$DW$T$73, DW_AT_byte_size(0x0c)
    4965                    $C$DW$479       .dwtag  DW_TAG_member
    4966                            .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$68)
    4967                            .dwattr $C$DW$479, DW_AT_name("txCounter")
    4968                            .dwattr $C$DW$479, DW_AT_TI_symbol_name("txCounter")
    4969                            .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4970                            .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4971                            .dwattr $C$DW$479, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    4972                            .dwattr $C$DW$479, DW_AT_decl_line(0x198)
    4973                            .dwattr $C$DW$479, DW_AT_decl_column(0x0a)
    4974                    
    4975                    $C$DW$480       .dwtag  DW_TAG_member
    4976                            .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$68)
    4977                            .dwattr $C$DW$480, DW_AT_name("txCost")
    4978                            .dwattr $C$DW$480, DW_AT_TI_symbol_name("txCost")
    4979                            .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4980                            .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4981                            .dwattr $C$DW$480, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    4982                            .dwattr $C$DW$480, DW_AT_decl_line(0x199)
    4983                            .dwattr $C$DW$480, DW_AT_decl_column(0x0a)
    4984                    
    4985                    $C$DW$481       .dwtag  DW_TAG_member
    4986                            .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$68)
    4987                            .dwattr $C$DW$481, DW_AT_name("rxLqi")
    4988                            .dwattr $C$DW$481, DW_AT_TI_symbol_name("rxLqi")
    4989                            .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4990                            .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4991                            .dwattr $C$DW$481, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    4992                            .dwattr $C$DW$481, DW_AT_decl_line(0x19b)
    4993                            .dwattr $C$DW$481, DW_AT_decl_column(0x0a)
    4994                    
    4995                    $C$DW$482       .dwtag  DW_TAG_member
    4996                            .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$68)
    4997                            .dwattr $C$DW$482, DW_AT_name("inKeySeqNum")
    4998                            .dwattr $C$DW$482, DW_AT_TI_symbol_name("inKeySeqNum")
    4999                            .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5000                            .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    5001                            .dwattr $C$DW$482, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    5002                            .dwattr $C$DW$482, DW_AT_decl_line(0x19d)
    5003                            .dwattr $C$DW$482, DW_AT_decl_column(0x0a)
    5004                    
    5005                    $C$DW$483       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{88FE70CB-2B34-4EAA-BBEF-A9E10743A3C3} PAGE   92

    5006                            .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$71)
    5007                            .dwattr $C$DW$483, DW_AT_name("inFrmCntr")
    5008                            .dwattr $C$DW$483, DW_AT_TI_symbol_name("inFrmCntr")
    5009                            .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5010                            .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    5011                            .dwattr $C$DW$483, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    5012                            .dwattr $C$DW$483, DW_AT_decl_line(0x19e)
    5013                            .dwattr $C$DW$483, DW_AT_decl_column(0x0a)
    5014                    
    5015                    $C$DW$484       .dwtag  DW_TAG_member
    5016                            .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$72)
    5017                            .dwattr $C$DW$484, DW_AT_name("txFailure")
    5018                            .dwattr $C$DW$484, DW_AT_TI_symbol_name("txFailure")
    5019                            .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5020                            .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    5021                            .dwattr $C$DW$484, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    5022                            .dwattr $C$DW$484, DW_AT_decl_line(0x19f)
    5023                            .dwattr $C$DW$484, DW_AT_decl_column(0x0a)
    5024                    
    5025                            .dwattr $C$DW$T$73, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    5026                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x197)
    5027                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x01)
    5028                            .dwendtag $C$DW$T$73
    5029                    
    5030                    $C$DW$T$1095    .dwtag  DW_TAG_typedef
    5031                            .dwattr $C$DW$T$1095, DW_AT_name("linkInfo_t")
    5032                            .dwattr $C$DW$T$1095, DW_AT_type(*$C$DW$T$73)
    5033                            .dwattr $C$DW$T$1095, DW_AT_language(DW_LANG_C)
    5034                            .dwattr $C$DW$T$1095, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154s
    5035                            .dwattr $C$DW$T$1095, DW_AT_decl_line(0x1a0)
    5036                            .dwattr $C$DW$T$1095, DW_AT_decl_column(0x03)
    5037                    
    5038                    
    5039                    $C$DW$T$74      .dwtag  DW_TAG_structure_type
    5040                            .dwattr $C$DW$T$74, DW_AT_byte_size(0x02)
    5041                    $C$DW$485       .dwtag  DW_TAG_member
    5042                            .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$68)
    5043                            .dwattr $C$DW$485, DW_AT_name("event")
    5044                            .dwattr $C$DW$485, DW_AT_TI_symbol_name("event")
    5045                            .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5046                            .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    5047                            .dwattr $C$DW$485, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    5048                            .dwattr $C$DW$485, DW_AT_decl_line(0x79)
    5049                            .dwattr $C$DW$485, DW_AT_decl_column(0x0a)
    5050                    
    5051                    $C$DW$486       .dwtag  DW_TAG_member
    5052                            .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$68)
    5053                            .dwattr $C$DW$486, DW_AT_name("status")
    5054                            .dwattr $C$DW$486, DW_AT_TI_symbol_name("status")
    5055                            .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5056                            .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    5057                            .dwattr $C$DW$486, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154stac
    5058                            .dwattr $C$DW$486, DW_AT_decl_line(0x7a)
    5059                            .dwattr $C$DW$486, DW_AT_decl_column(0x0a)
    5060                    
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{88FE70CB-2B34-4EAA-BBEF-A9E10743A3C3} PAGE   93

    5061                            .dwattr $C$DW$T$74, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154sta
    5062                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x78)
    5063                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x01)
    5064                            .dwendtag $C$DW$T$74
    5065                    
    5066                    $C$DW$T$1096    .dwtag  DW_TAG_typedef
    5067                            .dwattr $C$DW$T$1096, DW_AT_name("osal_event_hdr_t")
    5068                            .dwattr $C$DW$T$1096, DW_AT_type(*$C$DW$T$74)
    5069                            .dwattr $C$DW$T$1096, DW_AT_language(DW_LANG_C)
    5070                            .dwattr $C$DW$T$1096, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_20_00_38/source/ti/ti154s
    5071                            .dwattr $C$DW$T$1096, DW_AT_decl_line(0x7b)
    5072                            .dwattr $C$DW$T$1096, DW_AT_decl_column(0x03)
    5073                    
    5074                    
    5075                    $C$DW$T$107     .dwtag  DW_TAG_structure_type
    5076                            .dwattr $C$DW$T$107, DW_AT_byte_size(0x4c)
    5077                    $C$DW$487       .dwtag  DW_TAG_member
    5078                            .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$77)
    5079                            .dwattr $C$DW$487, DW_AT_name("Crc32")
    5080                            .dwattr $C$DW$487, DW_AT_TI_symbol_name("Crc32")
    5081                            .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5082                            .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    5083                            .dwattr $C$DW$487, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_20_00_38\source\ti\devices\c
    5084                            .dwattr $C$DW$487, DW_AT_decl_line(0x76)
    5085                            .dwattr $C$DW$487, DW_AT_decl_column(0x25)
    5086                    
    5087                    $C$DW$488       .dwtag  DW_TAG_member
    5088                            .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$80)
    5089                            .dwattr $C$DW$488, DW_AT_name("FlashGetSize")
    5090                            .dwattr $C$DW$488, DW_AT_TI_symbol_name("FlashGetSize")
    5091                            .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5092                            .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    5093                            .dwattr $C$DW$488, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_20_00_38\source\ti\devices\c
    5094                            .dwattr $C$DW$488, DW_AT_decl_line(0x77)
    5095                            .dwattr $C$DW$488, DW_AT_decl_column(0x25)
    5096                    
    5097                    $C$DW$489       .dwtag  DW_TAG_member
    5098                            .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$81)
    5099                            .dwattr $C$DW$489, DW_AT_name("GetChipId")
    5100                            .dwattr $C$DW$489, DW_AT_TI_symbol_name("GetChipId")
    5101                            .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5102                            .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    5103                            .dwattr $C$DW$489, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_20_00_38\source\ti\devices\c
    5104                            .dwattr $C$DW$489, DW_AT_decl_line(0x78)
    5105                            .dwattr $C$DW$489, DW_AT_decl_column(0x25)
    5106                    
    5107                    $C$DW$490       .dwtag  DW_TAG_member
    5108                            .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$84)
    5109                            .dwattr $C$DW$490, DW_AT_name("ReservedLocation1")
    5110                            .dwattr $C$DW$490, DW_AT_TI_symbol_name("ReservedLocation1")
    5111                            .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5112                            .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    5113                            .dwattr $C$DW$490, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_20_00_38\source\ti\devices\c
    5114                            .dwattr $C$DW$490, DW_AT_decl_line(0x79)
    5115                            .dwattr $C$DW$490, DW_AT_decl_column(0x25)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{88FE70CB-2B34-4EAA-BBEF-A9E10743A3C3} PAGE   94

    5116                    
    5117                    $C$DW$491       .dwtag  DW_TAG_member
    5118                            .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$85)
    5119                            .dwattr $C$DW$491, DW_AT_name("ReservedLocation2")
    5120                            .dwattr $C$DW$491, DW_AT_TI_symbol_name("ReservedLocation2")
    5121                            .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5122                            .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    5123                            .dwattr $C$DW$491, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_20_00_38\source\ti\devices\c
    5124                            .dwattr $C$DW$491, DW_AT_decl_line(0x7a)
    5125                            .dwattr $C$DW$491, DW_AT_decl_column(0x25)
    5126                    
    5127                    $C$DW$492       .dwtag  DW_TAG_member
    5128                            .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$86)
    5129                            .dwattr $C$DW$492, DW_AT_name("ReservedLocation3")
    5130                            .dwattr $C$DW$492, DW_AT_TI_symbol_name("ReservedLocation3")
    5131                            .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5132                            .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    5133                            .dwattr $C$DW$492, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_20_00_38\source\ti\devices\c
    5134                            .dwattr $C$DW$492, DW_AT_decl_line(0x7b)
    5135                            .dwattr $C$DW$492, DW_AT_decl_column(0x25)
    5136                    
    5137                    $C$DW$493       .dwtag  DW_TAG_member
    5138                            .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$87)
    5139                            .dwattr $C$DW$493, DW_AT_name("ResetDevice")
    5140                            .dwattr $C$DW$493, DW_AT_TI_symbol_name("ResetDevice")
    5141                            .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5142                            .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    5143                            .dwattr $C$DW$493, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_20_00_38\source\ti\devices\c
    5144                            .dwattr $C$DW$493, DW_AT_decl_line(0x7c)
    5145                            .dwattr $C$DW$493, DW_AT_decl_column(0x25)
    5146                    
    5147                    $C$DW$494       .dwtag  DW_TAG_member
    5148                            .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$93)
    5149                            .dwattr $C$DW$494, DW_AT_name("Fletcher32")
    5150                            .dwattr $C$DW$494, DW_AT_TI_symbol_name("Fletcher32")
    5151                            .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5152                            .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    5153                            .dwattr $C$DW$494, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_20_00_38\source\ti\devices\c
    5154                            .dwattr $C$DW$494, DW_AT_decl_line(0x7d)
    5155                            .dwattr $C$DW$494, DW_AT_decl_column(0x25)
    5156                    
    5157                    $C$DW$495       .dwtag  DW_TAG_member
    5158                            .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$96)
    5159                            .dwattr $C$DW$495, DW_AT_name("MinValue")
    5160                            .dwattr $C$DW$495, DW_AT_TI_symbol_name("MinValue")
    5161                            .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5162                            .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    5163                            .dwattr $C$DW$495, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_20_00_38\source\ti\devices\c
    5164                            .dwattr $C$DW$495, DW_AT_decl_line(0x7e)
    5165                            .dwattr $C$DW$495, DW_AT_decl_column(0x25)
    5166                    
    5167                    $C$DW$496       .dwtag  DW_TAG_member
    5168                            .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$97)
    5169                            .dwattr $C$DW$496, DW_AT_name("MaxValue")
    5170                            .dwattr $C$DW$496, DW_AT_TI_symbol_name("MaxValue")
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{88FE70CB-2B34-4EAA-BBEF-A9E10743A3C3} PAGE   95

    5171                            .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5172                            .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    5173                            .dwattr $C$DW$496, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_20_00_38\source\ti\devices\c
    5174                            .dwattr $C$DW$496, DW_AT_decl_line(0x7f)
    5175                            .dwattr $C$DW$496, DW_AT_decl_column(0x25)
    5176                    
    5177                    $C$DW$497       .dwtag  DW_TAG_member
    5178                            .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$98)
    5179                            .dwattr $C$DW$497, DW_AT_name("MeanValue")
    5180                            .dwattr $C$DW$497, DW_AT_TI_symbol_name("MeanValue")
    5181                            .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5182                            .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    5183                            .dwattr $C$DW$497, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_20_00_38\source\ti\devices\c
    5184                            .dwattr $C$DW$497, DW_AT_decl_line(0x80)
    5185                            .dwattr $C$DW$497, DW_AT_decl_column(0x25)
    5186                    
    5187                    $C$DW$498       .dwtag  DW_TAG_member
    5188                            .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$99)
    5189                            .dwattr $C$DW$498, DW_AT_name("StandDeviationValue")
    5190                            .dwattr $C$DW$498, DW_AT_TI_symbol_name("StandDeviationValue")
    5191                            .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    5192                            .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    5193                            .dwattr $C$DW$498, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_20_00_38\source\ti\devices\c
    5194                            .dwattr $C$DW$498, DW_AT_decl_line(0x81)
    5195                            .dwattr $C$DW$498, DW_AT_decl_column(0x25)
    5196                    
    5197                    $C$DW$499       .dwtag  DW_TAG_member
    5198                            .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$100)
    5199                            .dwattr $C$DW$499, DW_AT_name("ReservedLocation4")
    5200                            .dwattr $C$DW$499, DW_AT_TI_symbol_name("ReservedLocation4")
    5201                            .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    5202                            .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    5203                            .dwattr $C$DW$499, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_20_00_38\source\ti\devices\c
    5204                            .dwattr $C$DW$499, DW_AT_decl_line(0x82)
    5205                            .dwattr $C$DW$499, DW_AT_decl_column(0x25)
    5206                    
    5207                    $C$DW$500       .dwtag  DW_TAG_member
    5208                            .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$101)
    5209                            .dwattr $C$DW$500, DW_AT_name("ReservedLocation5")
    5210                            .dwattr $C$DW$500, DW_AT_TI_symbol_name("ReservedLocation5")
    5211                            .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    5212                            .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    5213                            .dwattr $C$DW$500, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_20_00_38\source\ti\devices\c
    5214                            .dwattr $C$DW$500, DW_AT_decl_line(0x83)
    5215                            .dwattr $C$DW$500, DW_AT_decl_column(0x25)
    5216                    
    5217                    $C$DW$501       .dwtag  DW_TAG_member
    5218                            .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$102)
    5219                            .dwattr $C$DW$501, DW_AT_name("HFSourceSafeSwitch")
    5220                            .dwattr $C$DW$501, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    5221                            .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    5222                            .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    5223                            .dwattr $C$DW$501, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_20_00_38\source\ti\devices\c
    5224                            .dwattr $C$DW$501, DW_AT_decl_line(0x84)
    5225                            .dwattr $C$DW$501, DW_AT_decl_column(0x25)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{88FE70CB-2B34-4EAA-BBEF-A9E10743A3C3} PAGE   96

    5226                    
    5227                    $C$DW$502       .dwtag  DW_TAG_member
    5228                            .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$103)
    5229                            .dwattr $C$DW$502, DW_AT_name("SelectCompAInput")
    5230                            .dwattr $C$DW$502, DW_AT_TI_symbol_name("SelectCompAInput")
    5231                            .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    5232                            .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    5233                            .dwattr $C$DW$502, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_20_00_38\source\ti\devices\c
    5234                            .dwattr $C$DW$502, DW_AT_decl_line(0x85)
    5235                            .dwattr $C$DW$502, DW_AT_decl_column(0x25)
    5236                    
    5237                    $C$DW$503       .dwtag  DW_TAG_member
    5238                            .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$104)
    5239                            .dwattr $C$DW$503, DW_AT_name("SelectCompARef")
    5240                            .dwattr $C$DW$503, DW_AT_TI_symbol_name("SelectCompARef")
    5241                            .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5242                            .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    5243                            .dwattr $C$DW$503, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_20_00_38\source\ti\devices\c
    5244                            .dwattr $C$DW$503, DW_AT_decl_line(0x86)
    5245                            .dwattr $C$DW$503, DW_AT_decl_column(0x25)
    5246                    
    5247                    $C$DW$504       .dwtag  DW_TAG_member
    5248                            .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$105)
    5249                            .dwattr $C$DW$504, DW_AT_name("SelectADCCompBInput")
    5250                            .dwattr $C$DW$504, DW_AT_TI_symbol_name("SelectADCCompBInput")
    5251                            .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5252                            .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    5253                            .dwattr $C$DW$504, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_20_00_38\source\ti\devices\c
    5254                            .dwattr $C$DW$504, DW_AT_decl_line(0x87)
    5255                            .dwattr $C$DW$504, DW_AT_decl_column(0x25)
    5256                    
    5257                    $C$DW$505       .dwtag  DW_TAG_member
    5258                            .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$106)
    5259                            .dwattr $C$DW$505, DW_AT_name("SelectCompBRef")
    5260                            .dwattr $C$DW$505, DW_AT_TI_symbol_name("SelectCompBRef")
    5261                            .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    5262                            .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    5263                            .dwattr $C$DW$505, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_20_00_38\source\ti\devices\c
    5264                            .dwattr $C$DW$505, DW_AT_decl_line(0x88)
    5265                            .dwattr $C$DW$505, DW_AT_decl_column(0x25)
    5266                    
    5267                            .dwattr $C$DW$T$107, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_20_00_38\source\ti\devices
    5268                            .dwattr $C$DW$T$107, DW_AT_decl_line(0x75)
    5269                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x01)
    5270                            .dwendtag $C$DW$T$107
    5271                    
    5272                    $C$DW$T$1097    .dwtag  DW_TAG_typedef
    5273                            .dwattr $C$DW$T$1097, DW_AT_name("HARD_API_T")
    5274                            .dwattr $C$DW$T$1097, DW_AT_type(*$C$DW$T$107)
    5275                            .dwattr $C$DW$T$1097, DW_AT_language(DW_LANG_C)
    5276                            .dwattr $C$DW$T$1097, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_20_00_38\source\ti\device
    5277                            .dwattr $C$DW$T$1097, DW_AT_decl_line(0x89)
    5278                            .dwattr $C$DW$T$1097, DW_AT_decl_column(0x03)
    5279                    
    5280                    
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{88FE70CB-2B34-4EAA-BBEF-A9E10743A3C3} PAGE   97

    5281                    $C$DW$T$110     .dwtag  DW_TAG_structure_type
    5282                            .dwattr $C$DW$T$110, DW_AT_byte_size(0x0a)
    5283                    $C$DW$506       .dwtag  DW_TAG_member
    5284                            .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$498)
    5285                            .dwattr $C$DW$506, DW_AT_name("addr")
    5286                            .dwattr $C$DW$506, DW_AT_TI_symbol_name("addr")
    5287                            .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5288                            .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    5289                            .dwattr $C$DW$506, DW_AT_decl_file("D:\code\collector_cc1310lp\Application\api_mac.h")
    5290                            .dwattr $C$DW$506, DW_AT_decl_line(0x4db)
    5291                            .dwattr $C$DW$506, DW_AT_decl_column(0x07)
    5292                    
    5293                    $C$DW$507       .dwtag  DW_TAG_member
    5294                            .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$109)
    5295                            .dwattr $C$DW$507, DW_AT_name("addrMode")
    5296                            .dwattr $C$DW$507, DW_AT_TI_symbol_name("addrMode")
    5297                            .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5298                            .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    5299                            .dwattr $C$DW$507, DW_AT_decl_file("D:\code\collector_cc1310lp\Application\api_mac.h")
    5300                            .dwattr $C$DW$507, DW_AT_decl_line(0x4de)
    5301                            .dwattr $C$DW$507, DW_AT_decl_column(0x17)
    5302                    
    5303                            .dwattr $C$DW$T$110, DW_AT_decl_file("D:\code\collector_cc1310lp\Application\api_mac.h")
    5304                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x4d0)
    5305                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x01)
    5306                            .dwendtag $C$DW$T$110
    5307                    
    5308                    $C$DW$T$744     .dwtag  DW_TAG_typedef
    5309                            .dwattr $C$DW$T$744, DW_AT_name("ApiMac_sAddr_t")
    5310                            .dwattr $C$DW$T$744, DW_AT_type(*$C$DW$T$110)
    5311                            .dwattr $C$DW$T$744, DW_AT_language(DW_LANG_C)
    5312                            .dwattr $C$DW$T$744, DW_AT_decl_file("D:\code\collector_cc1310lp\Application\api_mac.h")
    5313                            .dwattr $C$DW$T$744, DW_AT_decl_line(0x4df)
    5314                            .dwattr $C$DW$T$744, DW_AT_decl_column(0x03)
    5315                    
    5316                    
    5317                    $C$DW$T$111     .dwtag  DW_TAG_structure_type
    5318                            .dwattr $C$DW$T$111, DW_AT_byte_size(0x08)
    5319                    $C$DW$508       .dwtag  DW_TAG_member
    5320                            .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$27)
    5321                            .dwattr $C$DW$508, DW_AT_name("frameCounter")
    5322                            .dwattr $C$DW$508, DW_AT_TI_symbol_name("frameCounter")
    5323                            .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5324                            .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    5325                            .dwattr $C$DW$508, DW_AT_decl_file("D:\code\collector_cc1310lp\Application\api_mac.h")
    5326                            .dwattr $C$DW$508, DW_AT_decl_line(0x575)
    5327                            .dwattr $C$DW$508, DW_AT_decl_column(0x1a)
    5328                    
    5329                    $C$DW$509       .dwtag  DW_TAG_member
    5330                            .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$89)
    5331                            .dwattr $C$DW$509, DW_AT_name("keyIdx")
    5332                            .dwattr $C$DW$509, DW_AT_TI_symbol_name("keyIdx")
    5333                            .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5334                            .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    5335                            .dwattr $C$DW$509, DW_AT_decl_file("D:\code\collector_cc1310lp\Application\api_mac.h")
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{88FE70CB-2B34-4EAA-BBEF-A9E10743A3C3} PAGE   98

    5336                            .dwattr $C$DW$509, DW_AT_decl_line(0x576)
    5337                            .dwattr $C$DW$509, DW_AT_decl_column(0x1a)
    5338                    
    5339                            .dwattr $C$DW$T$111, DW_AT_decl_file("D:\code\collector_cc1310lp\Application\api_mac.h")
    5340                            .dwattr $C$DW$T$111, DW_AT_decl_line(0x574)
    5341                            .dwattr $C$DW$T$111, DW_AT_decl_column(0x01)
    5342                            .dwendtag $C$DW$T$111
    5343                    
    5344                    $C$DW$T$804     .dwtag  DW_TAG_typedef
    5345                            .dwattr $C$DW$T$804, DW_AT_name("ApiMac_frameCntr_t")
    5346                            .dwattr $C$DW$T$804, DW_AT_type(*$C$DW$T$111)
    5347                            .dwattr $C$DW$T$804, DW_AT_language(DW_LANG_C)
    5348                            .dwattr $C$DW$T$804, DW_AT_decl_file("D:\code\collector_cc1310lp\Application\api_mac.h")
    5349                            .dwattr $C$DW$T$804, DW_AT_decl_line(0x577)
    5350                            .dwattr $C$DW$T$804, DW_AT_decl_column(0x03)
    5351                    
    5352                    $C$DW$T$805     .dwtag  DW_TAG_pointer_type
    5353                            .dwattr $C$DW$T$805, DW_AT_type(*$C$DW$T$804)
    5354                            .dwattr $C$DW$T$805, DW_AT_address_class(0x20)
    5355                    
    5356                    
    5357                    $C$DW$T$115     .dwtag  DW_TAG_structure_type
    5358                            .dwattr $C$DW$T$115, DW_AT_byte_size(0x40)
    5359                    $C$DW$510       .dwtag  DW_TAG_member
    5360                            .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$113)
    5361                            .dwattr $C$DW$510, DW_AT_name("beaconType")
    5362                            .dwattr $C$DW$510, DW_AT_TI_symbol_name("beaconType")
    5363                            .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5364                            .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    5365                            .dwattr $C$DW$510, DW_AT_decl_file("D:\code\collector_cc1310lp\Application\api_mac.h")
    5366                            .dwattr $C$DW$510, DW_AT_decl_line(0x886)
    5367                            .dwattr $C$DW$510, DW_AT_decl_column(0x19)
    5368                    
    5369                    $C$DW$511       .dwtag  DW_TAG_member
    5370                            .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$22)
    5371                            .dwattr $C$DW$511, DW_AT_name("bsn")
    5372                            .dwattr $C$DW$511, DW_AT_TI_symbol_name("bsn")
    5373                            .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5374                            .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    5375                            .dwattr $C$DW$511, DW_AT_decl_file("D:\code\collector_cc1310lp\Application\api_mac.h")
    5376                            .dwattr $C$DW$511, DW_AT_decl_line(0x888)
    5377                            .dwattr $C$DW$511, DW_AT_decl_column(0x0d)
    5378                    
    5379                    $C$DW$512       .dwtag  DW_TAG_member
    5380                            .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$114)
    5381                            .dwattr $C$DW$512, DW_AT_name("panDesc")
    5382                            .dwattr $C$DW$512, DW_AT_TI_symbol_name("panDesc")
    5383                            .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5384                            .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    5385                            .dwattr $C$DW$512, DW_AT_decl_file("D:\code\collector_cc1310lp\Application\api_mac.h")
    5386                            .dwattr $C$DW$512, DW_AT_decl_line(0x88a)
    5387                            .dwattr $C$DW$512, DW_AT_decl_column(0x16)
    5388                    
    5389                    $C$DW$513       .dwtag  DW_TAG_member
    5390                            .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$501)
TI ARM Assembler PC v18.1.2 Fri Nov 16 15:54:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\masong\AppData\Local\Temp\{88FE70CB-2B34-4EAA-BBEF-A9E10743A3C3} PAGE   99

    5391                            .dwattr $C$DW$513, DW_AT_name("beaconData")
    5392                            .dwattr $C$DW$513, DW_AT_TI_symbol_name("beaconData")
    5393                            .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5394                            .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    5395                            .dwattr $C$DW$513, DW_AT_decl_file("D:\code\collector_cc1310lp\Application\api_mac.h")
    5396                            .dwattr $C$DW$513, DW_AT_decl_line(0x895)
    5397                            .dwattr $C$DW$513, DW_AT_decl_column(0x07)
    5398                    
    5399                            .dwattr $C$DW$T$115, DW_AT_decl_file("D:\code\collector_cc1310lp\Application\api_mac.h")
    5400                            .dwattr $C$DW$T$115, DW_AT_decl_line(0x884)
    5401                            .dwattr $C$DW$T$115, DW_AT_decl_column(0x01)
    5402                            .dwendtag $C$DW$T$115
    5403                    
    5404                    $C$DW$T$658     .dwtag  DW_TAG_typedef
    5405                            .dwattr $C$DW$T$658, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    5406                            .dwattr $C$DW$T$658, DW_AT_type(*$C$DW$T$115)
    5407                            .dwattr $C$DW$T$658, DW_AT_language(DW_LANG_C)
    5408                            .dwattr $C$DW$T$658, DW_AT_decl_file("D:\code\collector_cc1310lp\Application\api_mac.h")
    5409                            .dwattr $C$DW$T$658, DW_AT_decl_line(0x896)
    5410                            .dwattr $C$DW$T$658, DW_AT_decl_column(0x03)
    5411                    
    5412                    $C$DW$T$659     .dwtag  DW_TAG_pointer_type
    5413                            .dwattr $C$DW$T$659, DW_AT_type(*$C$DW$T$658)
    5414                            .dwattr $C$DW$T$659, DW_AT_address_class(0x20)
    5415                    
    5416                    
    5417                    $C$DW$T$116     .dwtag  DW_TAG_structure_type
    5418                            .dwattr $C$DW$T$116, DW_AT_byte_size(0x08)
    5419                    $C$DW$514       .dwtag  DW_TAG_member
    5420                            .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$45)
    5421                            .dwattr $C$DW$514, DW_AT_name("pCurrEntry")
    5422                            .dwattr $C$DW$514, DW_AT_TI_symbol_name("pCurrEntry")
    5423                            .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5424                            .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    5425                            .dwattr $C$DW$514, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_20_00_38\source\ti\devices\c
    5426                            .dwattr $C$DW$514, DW_AT_decl_line(0x41)
